{
    "accessibility": [],
    "additionDate": "2019-08-15T14:50:15Z",
    "biotoolsCURIE": "biotools:deML",
    "biotoolsID": "deML",
    "collectionID": [],
    "confidence_flag": null,
    "cost": "Free of charge",
    "credit": [],
    "description": "deML is a maximum likelihood demultiplexing algorithm that allows probabilistic sample assignments. We compute the likelihood of assignment to various samples and assign to the most likely sample. We then compute the assignment quality to avoid ambiguous assignments. This is similar to how mapping quality solves the problem of ambiguous assignments.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [],
    "homepage": "http://grenaud.github.io/deML/",
    "homepage_status": 0,
    "language": [
        "C++"
    ],
    "lastUpdate": "2019-08-15T14:55:52Z",
    "license": null,
    "link": [],
    "maturity": "Mature",
    "name": "deML",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [],
    "owner": "grenaud",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btu719",
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved.Motivation: Pooling multiple samples increases the efficiency and lowers the cost of DNA sequencing. One approach to multiplexing is to use short DNA indices to uniquely identify each sample. After sequencing, reads must be assigned in silico to the sample of origin, a process referred to as demultiplexing. Demultiplexing software typically identifies the sample of origin using a fixed number of mismatches between the read index and a reference index set. This approach may fail or misassign reads when the sequencing quality of the indices is poor. Results: We introduce deML, a maximum likelihood algorithm that demultiplexes Illumina sequences. deML computes the likelihood of an observed index sequence being derived from a specified sample. A quality score which reflects the probability of the assignment being correct is generated for each read. Using these quality scores, even very problematic datasets can be demultiplexed and an error threshold can be set.",
                "authors": [
                    {
                        "name": "Renaud G."
                    },
                    {
                        "name": "Stenzel U."
                    },
                    {
                        "name": "Maricic T."
                    },
                    {
                        "name": "Wiebe V."
                    },
                    {
                        "name": "Kelso J."
                    }
                ],
                "citationCount": 49,
                "date": "2015-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeML: Robust demultiplexing of Illumina sequences using a likelihood-based approach"
            },
            "note": null,
            "pmcid": null,
            "pmid": "25359895",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 0,
    "version": []
}