{
    "name": "botXminer", 
    "description": "botXminer is a literature searching tool that allows you to search BotDB.  BotDB citations contain only those articles with either 'botulinum' or 'tetanus' anywhere in their text.  botXminer is an interface to this subset of complete medline xml files loaded into an Oracle XMLDB.", 
    "homepage": "http://botdb.abcc.ncifcrf.gov/", 
    "biotoolsID": "botxminer", 
    "biotoolsCURIE": "biotools:botxminer", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_1812", 
                    "term": "Loading"
                }, 
                {
                    "uri": "http://edamontology.org/operation_0305", 
                    "term": "Literature search"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }, 
        {
            "uri": "http://edamontology.org/topic_3068", 
            "term": "Literature and language"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [], 
    "publication": [
        {
            "doi": null, 
            "pmid": "16845112", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "botXminer: Mining biomedical literature with a new web-based application", 
                "abstract": "This paper outlines botXminer, a publicly available application to search XML-formatted MEDLINE® data in a complete, object-relational schema implemented in Oraclea XML DB. An advantage offered by botXminer is that it can generate quantitative results with certain queries that are not feasible through the Entrez-PubMed® interface. After retrieving citations associated with user-supplied search terms, MEDLINE fields (title, abstract, journal, MeSH® and chemical) and terms (MeSH qualifiers and descriptors, keywords, author, gene symbol and chemical), these citations are grouped and displayed as tabulated or graphic results. This work represents an extension of previous research for integrating these citations with relational systems. botXminer has a user-friendly, intuitive interface that can be freely accessed at http:// botdb.abcc.ncifcrf.gov. © The Author 2006. Published by Oxford University Press. All rights reserved.", 
                "date": "2006-07-01T00:00:00Z", 
                "citationCount": 9, 
                "authors": [
                    {
                        "name": "Mudunuri U."
                    }, 
                    {
                        "name": "Stephens R."
                    }, 
                    {
                        "name": "Bruining D."
                    }, 
                    {
                        "name": "Liu D."
                    }, 
                    {
                        "name": "Lebeda F.J."
                    }
                ], 
                "journal": "Nucleic Acids Research"
            }
        }, 
        {
            "doi": null, 
            "pmid": "15027052", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "BotDB: A database resource for the clostridial neurotoxins", 
                "abstract": "BotDB is a database designed to encapsulate the rapidly expanding amount of information about the structure and function of the botulinum (BoNT) and tetanus neurotoxins and to track a variety of basic and applied research efforts. The AceDB management system was chosen for this project because of its flexibility in manipulating semistructured data sets and for its information retrieval query languages. In addition to storing amino and nucleic acid sequences of the clostridial neurotoxin genes and proteins, BotDB provides sequence data for new classes of objects, including neurotoxin mutants, substrates and their mutants, associated nontoxic proteins, and C-fragment vaccine candidates. New data types provide information on detection assays for the neurotoxins and on structural data from X-ray crystallographic and circular dichroism spectroscopic studies. Kinetic parameters from biochemical experiments include reaction rates for substrate cleavage and block of neurotransmission. The structures and kinetic characteristics of presently known chemical inhibitors are also being archived. All of these data are associated with citations of the relevant literature for on-line annotation. Graphics viewer programs are provided to display stored images and three-dimensional representations of protein structures. BotDB is in the alpha test phase of development and will become a publicly available Web site. © 2004 Movement Disorder Society.", 
                "date": "2004-08-04T00:00:00Z", 
                "citationCount": 7, 
                "authors": [
                    {
                        "name": "Lebeda F.J."
                    }
                ], 
                "journal": "Movement Disorders"
            }
        }
    ], 
    "credit": [
        {
            "name": "BotDB team", 
            "email": "botdb@mail.nih.gov", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "ELIXIR-EE", 
    "additionDate": "2017-02-10T14:13:57Z", 
    "lastUpdate": "2018-12-10T12:58:56Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}