{"credit":[{"email":"shuzhang@mtu.edu","name":"Shuanglin Zhang","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.math.mtu.edu/~shuzhang/"}],"documentation":[{"type":"GENERAL","url":"http://www.math.mtu.edu/~shuzhang/software.html"}],"function":[{"operation":[{"term":"Gene set testing","uri":"http://edamontology.org/operation_3224"}]}],"labels":{"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Genetics","uri":"http://edamontology.org/topic_3053"},{"term":"Genotype and phenotype","uri":"http://edamontology.org/topic_0625"},{"term":"Molecular genetics","uri":"http://edamontology.org/topic_3321"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/hs-tdt-haplotype-sharing-transmission-disequilibrium-test.html"}],"publication":[{"abstract":"Studies using haplotypes of multiple tightly linked markers are more informative than those using a single marker. However, studies based on multimarker haplotypes have some difficulties. First, if we consider each haplotype as an allele and use the conventional single-marker transmission/disequilibrium test (TDT), then the rapid increase in the degrees of freedom with an increasing number of markers means that the statistical power of the conventional tests will be low. Second, the parental haplotypes cannot always be unambiguously reconstructed. In the present article, we propose a haplotype-sharing TDT (HS-TDT) for linkage or association between a disease-susceptibility locus and a chromosome region in which several tightly linked markers have been typed. This method is applicable to both quantitative traits and qualitative traits. It is applicable to any size of nuclear family, with or without ambiguous phase information, and it is applicable to any number of alleles at each of the markers. The degrees of freedom (in a broad sense) of the test increase linearly as the number of markers considered increases but do not increase as the number of alleles at the markers increases. Our simulation results show that the HS-TDT has the correct type I error rate in structured populations and that, in most cases, the power of HS-TDT is higher than the power of the existing single-marker TDTs and haplotype-based TDTs.","authors":["Zhang S.","Sha Q.","Chen H.-S.","Dong J.","Jiang R."],"cit_count":62,"journal":"American Journal of Human Genetics","pmid":"12929082","title":"Transmission/disequilibrium test based on haplotype sharing for tightly linked markers","year":"2003-09-01"}],"summary":{"biotoolsCURIE":"biotools:hs-tdt","biotoolsID":"hs-tdt","description":"Software of testing association using tightly linked markers in nuclear pedigrees.","homepage":"http://www.math.mtu.edu/~shuzhang/software.html","name":"HS-TDT"}}