{
    "additionDate": "2020-01-14T19:32:48Z",
    "biotoolsCURIE": "biotools:AlphaFamImpute",
    "biotoolsID": "AlphaFamImpute",
    "confidence_flag": "tool",
    "description": "high accuracy imputation in full-sib families from genotype-by-sequencing data.\n\nAlphaFamImpute is a genotype calling, phasing, and imputation algorithm for large full-sib families in diploid plants and animals which supports individuals genotyped with SNP array or GBS data. The approach draws heavily on single and multi-locus iterative peeling (as in AlphaPeel). It also has been inspired by work outside our group such as hs-phase (Ferdosi et al. 2014), and magicimpute (Zheng et al. 2018). AlphaFamImpute was written by Andrew Whalen, and is currently being supported by Andrew Whalen and Steve Thorn.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/heat_seq (ROSLIN.ED.AC.UK)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Haplotype mapping",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://www.AlphaGenes.roslin.ed.ac.uk/AlphaFamImpute",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-02T12:45:25.350000Z",
    "name": "AlphaFamImpute",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa499",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.AlphaFamImpute is an imputation package for calling, phasing and imputing genome-wide genotypes in outbred full-sib families from single nucleotide polymorphism (SNP) array and genotype-by-sequencing (GBS) data. GBS data are increasingly being used to genotype individuals, especially when SNP arrays do not exist for a population of interest. Low-coverage GBS produces data with a large number of missing or incorrect naïve genotype calls, which can be improved by identifying shared haplotype segments between full-sib individuals. Here, we present AlphaFamImpute, an algorithm specifically designed to exploit the genetic structure of full-sib families. It performs imputation using a two-step approach. In the first step, it phases and imputes parental genotypes based on the segregation states of their offspring (i.e. which pair of parental haplotypes the offspring inherited). In the second step, it phases and imputes the offspring genotypes by detecting which haplotype segments the offspring inherited from their parents. With a series of simulations, we find that AlphaFamImpute obtains high-accuracy genotypes, even when the parents are not genotyped and individuals are sequenced at <1x coverage. Availability and implementation: AlphaFamImpute is available as a Python package from the AlphaGenes website http://www.AlphaGenes.roslin.ed.ac.uk/AlphaFamImpute.",
                "authors": [
                    {
                        "name": "Whalen A."
                    },
                    {
                        "name": "Gorjanc G."
                    },
                    {
                        "name": "Hickey J.M."
                    }
                ],
                "date": "2020-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AlphaFamImpute: High-accuracy imputation in full-sib families from genotype-by-sequencing data"
            }
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ]
}