{
    "additionDate": "2019-11-14T19:58:21Z",
    "biotoolsCURIE": "biotools:BACMMAN",
    "biotoolsID": "BACMMAN",
    "confidence_flag": "tool",
    "description": "High-throughput detection and tracking of cells and intracellular spots in mother machine experiments | BACteria in Mother Maching Analyzer (BACMMAN) is a software allowing fast and reliable automated image analysis of high-throughput 2D/3D time-series images from mother machine. Mother machine is a very popular microfluidic device allowing investigating biological processes in bacteria at the single-cell level | BACMMAN: BACteria in Mother Machine Analyzer | BACMMAN was designed to analyse data from Mother machine experiments",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://github.com/jeanollion/bacmman/wiki"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jeanollion/bacmman",
    "language": [
        "Java"
    ],
    "lastUpdate": "2020-12-03T07:11:11Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jeanollion/bacmman.git"
        }
    ],
    "name": "BACMMAN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/S41596-019-0216-9",
            "metadata": {
                "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature Limited.The analysis of bacteria at the single-cell level is essential to characterization of processes in which cellular heterogeneity plays an important role. BACMMAN (bacteria mother machine analysis) is a software allowing fast and reliable automated image analysis of high-throughput 2D or 3D time-series images from experiments using the ‘mother machine’, a very popular microfluidic device allowing biological processes in bacteria to be investigated at the single-cell level. Here, we describe how to use some of the BACMMAN features, including (i) segmentation and tracking of bacteria and intracellular fluorescent spots, (ii) visualization and editing of the results, (iii) configuration of the image-processing pipeline for different datasets and (iv) BACMMAN coupling to data analysis software for visualization and analysis of data subsets with specific properties. Among software specifically dedicated to the analysis of mother machine data, only BACMMAN allows segmentation and tracking of both bacteria and intracellular spots. For a single position, single channel with 1,000 frames (2-GB dataset), image processing takes ~6 min on a regular computer. Numerous implemented algorithms, easy configuration and high modularity ensure wide applicability of the BACMMAN software.",
                "authors": [
                    {
                        "name": "Ollion J."
                    },
                    {
                        "name": "Elez M."
                    },
                    {
                        "name": "Robert L."
                    }
                ],
                "citationCount": 7,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Nature Protocols",
                "title": "High-throughput detection and tracking of cells and intracellular spots in mother machine experiments"
            },
            "pmid": "31554957"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}