{
    "additionDate": "2023-11-06T09:29:56.888140Z",
    "biotoolsCURIE": "biotools:genespace",
    "biotoolsID": "genespace",
    "description": "GENESPACE: an R package for synteny- and orthology-constrained comparative genomics",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                },
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jtlovell/GENESPACE",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:33:50.734343Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/jtlovell/GENESPACE"
        }
    ],
    "name": "GENESPACE",
    "owner": "alexcorm",
    "publication": [
        {
            "doi": "10.7554/elife.78526",
            "metadata": {
                "abstract": "The development of multiple chromosome-scale reference genome sequences in many taxonomic groups has yielded a high-resolution view of the patterns and processes of molecular evolution. Nonetheless, leveraging information across multiple genomes remains a significant challenge in nearly all eukaryotic systems. These challenges range from studying the evolution of chromosome structure, to finding candidate genes for quantitative trait loci, to testing hypotheses about speciation and adaptation. Here, we present GENESPACE, which addresses these challenges by integrating conserved gene order and orthology to define the expected physical position of all genes across multiple genomes. We demonstrate this utility by dissecting presence–absence, copy-number, and structural variation at three levels of biological organization: spanning 300 million years of vertebrate sex chromosome evolution, across the diversity of the Poaceae (grass) plant family, and among 26 maize cultivars. The methods to build and visualize syntenic orthology in the GENESPACE R package offer a significant addition to existing gene family and synteny programs, especially in polyploid, outbred, and other complex genomes.",
                "authors": [
                    {
                        "name": "Carlson J.W."
                    },
                    {
                        "name": "Emms D."
                    },
                    {
                        "name": "Goodstein D.M."
                    },
                    {
                        "name": "Harkess A."
                    },
                    {
                        "name": "Lovell J.T."
                    },
                    {
                        "name": "Schmutz J."
                    },
                    {
                        "name": "Schranz M.E."
                    },
                    {
                        "name": "Sreedasyam A."
                    },
                    {
                        "name": "Wilson M."
                    }
                ],
                "citationCount": 78,
                "date": "2022-01-01T00:00:00Z",
                "journal": "eLife",
                "title": "GENESPACE tracks regions of interest and gene copy number variation across multiple genomes"
            },
            "pmcid": "PMC9462846",
            "pmid": "36083267"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        }
    ]
}
