
{
    "credit": [
        {
            "email": "brudno@cs.toronto.edu",
            "name": "Michael Brudno",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://lagan.stanford.edu/lagan_web/authors.shtml"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://lagan.stanford.edu/lagan_web/about.shtml"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Nucleic acid structure analysis",
                "uri": "http://edamontology.org/topic_0097"
            },
            {
                "term": "Comparative genomics",
                "uri": "http://edamontology.org/topic_0797"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/lagan-2-0-genomic-alignment.html"
        }
    ],
    "publication": [
        {
            "abstract": "To compare entire genomes from different species, biologists increasingly need alignment methods that are efficient enough to handle long sequences, and accurate enough to correctly align the conserved biological features between distant species. We present LAGAN, a system for rapid global alignment of two homologous genomic sequences, and Multi-LAGAN, a system for multiple global alignment of genomic sequences. We tested our systems on a data set consisting of greater than 12 Mb of high-quality sequence from 12 vertebrate species. All the sequence was derived from the genomic region orthologous to an ∼1.5-Mb region on human chromosome 7q31.3. We found that both LAGAN and Multi-LAGAN compare favorably with other leading alignment methods in correctly aligning protein-coding exons, especially between distant homologs such as human and chicken, or human and fugu. Multi-LAGAN produced the most accurate alignments, while requiring just 75 minutes on a personal computer to obtain the multiple alignment of all 12 sequences. Multi-LAGAN is a practical method for generating multiple alignments of long genomic sequences at any evolutionary distance. Our systems are publicly available at http://lagan.stanford.edu.",
            "authors": [
                "Brudno M.",
                "Do C.B.",
                "Cooper G.M.",
                "Kim M.F.",
                "Davydov E.",
                "Green E.D.",
                "Sidow A.",
                "Batzoglou S."
            ],
            "cit_count": 736,
            "journal": "Genome Research",
            "pmid": "12654723",
            "title": "LAGAN and Multi-LAGAN: Efficient tools for large-scale multiple alignment of genomic DNA",
            "year": "2003-04-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lagan",
        "biotoolsID": "lagan",
        "description": "Tools for genomic alignment. These include the MLAGAN multiple alignment tool, and Shuffle-LAGAN for alignment with rearrangements.. All three are based on the CHAOS local alignment tool and combine speed (regions up to several megabases can be aligned in minutes) with high accuracy.",
        "homepage": "http://lagan.stanford.edu/lagan_web/index.shtml",
        "name": "LAGAN"
    }
}