{
    "accessibility": [],
    "additionDate": "2017-12-18T00:03:58Z",
    "biotoolsCURIE": "biotools:bhageerath-h",
    "biotoolsID": "bhageerath-h",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.scfbio-iitd.res.in/"
        }
    ],
    "description": "Energy based, for narrowing down the search space of tertiary structures of small globular proteins. The protocol comprises 8 different computational modules that form an automated pipeline. It combines physics based potentials with biophysical filters to arrive at 10 plausible candidate structures starting from sequence and secondary structure information. The methodology has been validated here on 50 small globular proteins consisting of helices and strands with known tertiary structures.",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "http://www.scfbio-iitd.res.in/bhageerath/help.htm"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www.scfbio-iitd.res.in/bhageerath/index.jsp",
    "homepage_status": 0,
    "language": [],
    "lastUpdate": "2018-12-29T15:06:29Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/bhageerath-1-0-energy-based-protein-structure-prediction.html"
        }
    ],
    "maturity": null,
    "name": "BHAGEERATH-H",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.2174/138920310794109094",
            "metadata": {
                "abstract": "In an era that has been dominated by Structural Biology for the last 30-40 years, a dramatic change of focus towards sequence analysis has spurred the advent of the genome projects and the resultant diverging sequence/structure deficit. The central challenge of Computational Structural Biology is therefore to rationalize the mass of sequence information into biochemical and biophysical knowledge and to decipher the structural, functional and evolutionary clues encoded in the language of biological sequences. In investigating the meaning of sequences, two distinct analytical themes have emerged: in the first approach, pattern recognition techniques are used to detect similarity between sequences and hence to infer related structures and functions; in the second ab initio prediction methods are used to deduce 3D structure, and ultimately to infer function, directly from the linear sequence. In this article, we attempt to provide a critical assessment of what one may and may not expect from the biological sequences and to identify major issues yet to be resolved. The presentation is organized under several subtitles like protein sequences, pattern recognition techniques, protein tertiary structure prediction, membrane protein bioinformatics, human proteome, protein-protein interactions, metabolic networks, potential drug targets based on simple sequence properties, disordered proteins, the sequence-structure relationship and chemical logic of protein sequences. © 2010 Bentham Science Publishers Ltd.",
                "authors": [
                    {
                        "name": "Shenoy S.R."
                    },
                    {
                        "name": "Jayaram B."
                    }
                ],
                "citationCount": 44,
                "date": "2010-12-01T00:00:00Z",
                "journal": "Current Protein and Peptide Science",
                "title": "Proteins: Sequence to structure and function - current status"
            },
            "note": null,
            "pmcid": null,
            "pmid": "20887265",
            "type": "Primary",
            "version": null
        },
        {
            "doi": "10.1093/nar/gkl789",
            "metadata": {
                "abstract": "We describe here an energy based computer software suite for narrowing down the search space of tertiary structures of small globular proteins. The protocol comprises eight different computational modules that form an automated pipeline. It combines physics based potentials with biophysical filters to arrive at 10 plausible candidate structures starting from sequence and secondary structure information. The methodology has been validated here on 50 small globular proteins consisting of 2-3 helices and strands with known tertiary structures. For each of these proteins, a structure within 3-6 Å RMSD (root mean square deviation) of the native has been obtained in the 10 lowest energy structures. The protocol has been web enabled and is accessible at http://www.scfbio-iitd.res.in/bhageerath. © 2006 Oxford University Press.",
                "authors": [
                    {
                        "name": "Jayaram B."
                    },
                    {
                        "name": "Bhushan K."
                    },
                    {
                        "name": "Shenoy S.R."
                    },
                    {
                        "name": "Narang P."
                    },
                    {
                        "name": "Bose S."
                    },
                    {
                        "name": "Agrawal P."
                    },
                    {
                        "name": "Sahu D."
                    },
                    {
                        "name": "Pandey V."
                    }
                ],
                "citationCount": 59,
                "date": "2006-12-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Bhageerath: An energy based web enabled computer software suite for limiting the search space of tertiary structures of small globular proteins"
            },
            "note": null,
            "pmcid": null,
            "pmid": null,
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1,
    "version": []
}