{
    "accessibility": "Open access",
    "additionDate": "2022-10-30T21:25:58.702286Z",
    "biotoolsCURIE": "biotools:svd-clahe",
    "biotoolsID": "svd-clahe",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Vibhuti Bansal"
        },
        {
            "name": "Mrinal Tyagi",
            "orcidid": "https://orcid.org/0000-0003-0871-5695"
        },
        {
            "name": "Vikas Jain",
            "orcidid": "https://orcid.org/0000-0002-6382-5814"
        },
        {
            "name": "Santanu Roy",
            "orcidid": "https://orcid.org/0000-0001-6963-8019",
            "typeEntity": "Person"
        }
    ],
    "description": "SVD CLAHE Boosting and BWCCE Loss Function Experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/MrinalTyagi/SVD-CLAHE-and-BWCCE",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:24:56.209924Z",
    "license": "BSD-3-Clause",
    "name": "SVD-CLAHE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/j.compbiomed.2022.106092",
            "metadata": {
                "abstract": "Covid-19 disease has had a disastrous effect on the health of the global population, for the last two years. Automatic early detection of Covid-19 disease from Chest X-Ray (CXR) images is a very crucial step for human survival against Covid-19. In this paper, we propose a novel data-augmentation technique, called SVD-CLAHE Boosting and a novel loss function Balanced Weighted Categorical Cross Entropy (BWCCE), in order to detect Covid 19 disease efficiently from a highly class-imbalanced Chest X-Ray image dataset. Our proposed SVD-CLAHE Boosting method is comprised of both oversampling and under-sampling methods. First, a novel Singular Value Decomposition (SVD) based contrast enhancement and Contrast Limited Adaptive Histogram Equalization (CLAHE) methods are employed for oversampling the data in minor classes. Simultaneously, a Random Under Sampling (RUS) method is incorporated in major classes, so that the number of images per class will be more balanced. Thereafter, Balanced Weighted Categorical Cross Entropy (BWCCE) loss function is proposed in order to further reduce small class imbalance after SVD-CLAHE Boosting. Experimental results reveal that ResNet-50 model on the augmented dataset (by SVD-CLAHE Boosting), along with BWCCE loss function, achieved 95% F1 score, 94% accuracy, 95% recall, 96% precision and 96% AUC, which is far better than the results by other conventional Convolutional Neural Network (CNN) models like InceptionV3, DenseNet-121, Xception etc. as well as other existing models like Covid-Lite and Covid-Net. Hence, our proposed framework outperforms other existing methods for Covid-19 detection. Furthermore, the same experiment is conducted on VGG-19 model in order to check the validity of our proposed framework. Both ResNet-50 and VGG-19 model are pre-trained on the ImageNet dataset. We publicly shared our proposed augmented dataset on Kaggle website (https://www.kaggle.com/tr1gg3rtrash/balanced-augmented-covid-cxr-dataset), so that any research community can widely utilize this dataset. Our code is available on GitHub website online (https://github.com/MrinalTyagi/SVD-CLAHE-and-BWCCE).",
                "authors": [
                    {
                        "name": "Bansal V."
                    },
                    {
                        "name": "Jain V."
                    },
                    {
                        "name": "Roy S."
                    },
                    {
                        "name": "Tyagi M."
                    }
                ],
                "citationCount": 15,
                "date": "2022-11-01T00:00:00Z",
                "journal": "Computers in Biology and Medicine",
                "title": "SVD-CLAHE boosting and balanced loss function for Covid-19 detection from an imbalanced Chest X-Ray dataset"
            },
            "pmcid": "PMC9514969",
            "pmid": "36208598"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
