{
    "additionDate": "2019-11-14T18:15:52Z",
    "biotoolsCURIE": "biotools:ATEN",
    "biotoolsID": "ATEN",
    "confidence_flag": "tool",
    "description": "And/Or Tree Ensemble for inferring accurate Boolean network topology and dynamics | # Download the development version of ATEN from GitHub: | Note: please note that set.seed() is not suitable for the Package parallel. In order to make the results reproducible, we introduced function clusterSetRNGStream(), more deatails please see the Pacakge parallel | B, the number of And/Or trees in ATEN. This parameter always depends on the size/noise of the data. We suggest you set a higher B for large/noisy networks. If you set a very large B, although it won't affect the results much, but it takes much time..",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ningshi/ATEN",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-02T15:51:11Z",
    "license": "GPL-2.0",
    "name": "ATEN",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ563",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved.Motivation: Inferring gene regulatory networks from gene expression time series data is important for gaining insights into the complex processes of cell life. A popular approach is to infer Boolean networks. However, it is still a pressing open problem to infer accurate Boolean networks from experimental data that are typically short and noisy. Results: To address the problem, we propose a Boolean network inference algorithm which is able to infer accurate Boolean network topology and dynamics from short and noisy time series data. The main idea is that, for each target gene, we use an And/Or tree ensemble algorithm to select prime implicants of which each is a conjunction of a set of input genes. The selected prime implicants are important features for predicting the states of the target gene. Using these important features we then infer the Boolean function of the target gene. Finally, the Boolean functions of all target genes are combined as a Boolean network. Using the data generated from artificial and real-world gene regulatory networks, we show that our algorithm can infer more accurate Boolean network topology and dynamics from short and noisy time series data than other algorithms. Our algorithm enables us to gain better insights into complex regulatory mechanisms of cell life.",
                "authors": [
                    {
                        "name": "Shi N."
                    },
                    {
                        "name": "Zhu Z."
                    },
                    {
                        "name": "Tang K."
                    },
                    {
                        "name": "Parker D."
                    },
                    {
                        "name": "He S."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ATEN: And/Or tree ensemble for inferring accurate Boolean network topology and dynamics"
            },
            "pmid": "31368481"
        }
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 1
}