{
    "additionDate": "2022-03-28T07:19:05.430013Z",
    "biotoolsCURIE": "biotools:adc",
    "biotoolsID": "adc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "zsh@amss.ac.cn",
            "name": "Shihua Zhang",
            "orcidid": "https://orcid.org/0000-0003-0192-7118",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "ADC is an efficient method to identify highly interrelated genes across datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zhanglabtools/ADC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-03-28T07:19:05.432693Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/zhanglabtools/ADC/issues"
        }
    ],
    "name": "ADC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009548",
            "metadata": {
                "abstract": "Copyright © 2021 Shen, Zhang.With the rapid accumulation of biological omics datasets, decoding the underlying relationships of cross-dataset genes becomes an important issue. Previous studies have attempted to identify differentially expressed genes across datasets. However, it is hard for them to detect interrelated ones. Moreover, existing correlation-based algorithms can only measure the relationship between genes within a single dataset or two multi-modal datasets from the same samples. It is still unclear how to quantify the strength of association of the same gene across two biological datasets with different samples. To this end, we propose Approximate Distance Correlation (ADC) to select interrelated genes with statistical significance across two different biological datasets. ADC first obtains the k most correlated genes for each target gene as its approximate observations, and then calculates the distance correlation (DC) for the target gene across two datasets. ADC repeats this process for all genes and then performs the Benjamini-Hochberg adjustment to control the false discovery rate. We demonstrate the effectiveness of ADC with simulation data and four real applications to select highly interrelated genes across two datasets. These four applications including 21 cancer RNA-seq datasets of different tissues; six single-cell RNA-seq (scRNA-seq) datasets of mouse hematopoietic cells across six different cell types along the hematopoietic cell lineage; five scRNA-seq datasets of pancreatic islet cells across five different technologies; coupled single-cell ATAC-seq (scATAC-seq) and scRNA-seq data of peripheral blood mononuclear cells (PBMC). Extensive results demonstrate that ADC is a powerful tool to uncover interrelated genes with strong biological implications and is scalable to large-scale datasets. Moreover, the number of such genes can serve as a metric to measure the similarity between two datasets, which could characterize the relative difference of diverse cell types and technologies.",
                "authors": [
                    {
                        "name": "Shen Q."
                    },
                    {
                        "name": "Zhang S."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Approximate distance correlation for selecting highly interrelated genes across datasets"
            },
            "pmcid": "PMC8604336",
            "pmid": "34752449",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Immunoproteins and antigens",
            "uri": "http://edamontology.org/topic_2830"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
