{
    "additionDate": "2017-03-24T09:34:19Z",
    "biotoolsCURIE": "biotools:geneseqer",
    "biotoolsID": "geneseqer",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.plantgdb.org/utility/feedback.php"
        }
    ],
    "description": "Method to identify exon/intron structure by splice site prediction and spliced alignment in plant genomes.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.plantgdb.org/search/misc/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Splice site prediction",
                    "uri": "http://edamontology.org/operation_0433"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                },
                {
                    "term": "EST assembly",
                    "uri": "http://edamontology.org/operation_0526"
                },
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                }
            ]
        }
    ],
    "homepage": "http://www.plantgdb.org/search/misc/PublicPlantSeq.php",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "GeneSeqer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "PlantGDB (http://www.plantgdb.org/) is a database of molecular sequence data for all plant species with significant sequencing efforts. The database organizes EST sequences into contigs that represent tentative unique genes. Contigs are annotated and, whenever possible, linked to their respective genomic DNA. Genome sequence fragments are assembled similarly. The goal of the PlantGDB web site is to establish the basis for identifying sets of genes common to all plants or specific to particular species by integrating a number of bioinformatics tools that facilitate gene prediction and cross-species comparisons. For species with large-scale genome sequencing efforts, PlantGDB provides genome browsing capabilities that integrate all available EST and cDNA evidence for current gene models (for Arabidopsis thaliana, see the AtGDB site at http://www.plantgdb.org/AtGDB/).",
                "authors": [
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Schlueter S.D."
                    },
                    {
                        "name": "Brendel V."
                    }
                ],
                "citationCount": 137,
                "date": "2004-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PlantGDB, plant genome database and analysis tools"
            },
            "pmid": "14681433"
        },
        {
            "metadata": {
                "abstract": "The GeneSeqer@PlantGDB Web server (http://www.plantgdb.org/cgi-bin/GeneSeqer.cgi) provides a gene structure prediction tool tailored for applications to plant genomic sequences. Predictions are based on spliced alignment with source-native ESTs and full-length cDNAs or non-native probes derived from putative homologous genes. The tool is illustrated with applications to refinement of current gene structure annotation and de novo annotation of draft genomic sequences. The service should facilitate expert annotation as a community effort by providing convenient access to all public plant sequences via the PlantGDB database, a simple four-step protocol for spliced alignment and visually appealing displays of the predicted gene structures in addition to detailed sequence alignments.",
                "authors": [
                    {
                        "name": "Schlueter S.D."
                    },
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Brendel V."
                    }
                ],
                "citationCount": 50,
                "date": "2003-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "GeneSeqer@PlantGDB: Gene structure prediction in plant genomes"
            },
            "pmid": "12824374"
        },
        {
            "metadata": {
                "abstract": "PlantGDB (http://www.plantgdb.org/) is a database of plant molecular sequences. Expressed sequence tag (EST) sequences are assembled into contigs that represent tentative unique genes. EST contigs are functionally annotated with information derived from known protein sequences that are highly similar to the putative translation products. Tentative Gene Ontology terms are assigned to match those of the similar sequences identified. Genome survey sequences are assembled similarly. The resulting genome survey sequence contigs are matched to ESTs and conserved protein homologs to identify putative full-length open reading frame-containing genes, which are subsequently provisionally classified according to established gene family designations. For Arabidopsis (Arabidopsis thaliana) and rice (Oryza sativa), the exon-intron boundaries for gene structures are annotated by spliced alignment of ESTs and full-length cDNAs to their respective complete genome sequences. Unique genome browsers have been developed to present all available EST and cDNA evidence for current transcript models (for Arabidopsis, see the AtGDB site at http://www.plantgdb.org/AtGDB/; for rice, see the OsGDB site at http://www.plantgdb. org/OsGDB/). In addition, a number of bioinformatic tools have been integrated at PlantGDB that enable researchers to carry out sequence analyses on-site using both their own data and data residing within the database. © 2005 American Society of Plant Biologists.",
                "authors": [
                    {
                        "name": "Dong Q."
                    },
                    {
                        "name": "Lawrence C.J."
                    },
                    {
                        "name": "Schlueter S.D."
                    },
                    {
                        "name": "Wilkerson M.D."
                    },
                    {
                        "name": "Kurtz S."
                    },
                    {
                        "name": "Lushbough C."
                    },
                    {
                        "name": "Brendel V."
                    }
                ],
                "citationCount": 75,
                "date": "2005-12-01T00:00:00Z",
                "journal": "Plant Physiology",
                "title": "Comparative plant genomics resources at PlantGDB"
            },
            "pmid": "16219921"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Plants",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}