{
    "additionDate": "2021-01-18T08:42:54Z",
    "biotoolsCURIE": "biotools:scnet",
    "biotoolsID": "scnet",
    "confidence_flag": "tool",
    "description": "A Novel UGI Cancer Screening Framework Based on Semantic-Level Multimodal Data Fusion.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/netflymachine/SCNET",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-13T14:39:22Z",
    "name": "SCNET",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1109/JBHI.2020.2983126",
            "metadata": {
                "abstract": "© 2013 IEEE.Upper gastrointestinal (UGI) cancer has been identified as one of the ten most common causes of cancer deaths globally. UGI cancer screening is critical to improving the survival rate of UGI cancer patients. While many approaches to UGI cancer screening rely on single-modality data such as gastroscope imaging, limited studies have been dedicated to UGI cancer screening exploiting multisource and multimodal medical data, which could potentially lead to improved screening results. In this paper, we propose semantic-level cancer-screening network (SCNET), a framework for UGI cancer screening based on semantic-level multimodal upper gastrointestinal data fusion. Specifically, the proposed SCNET consists of a gastrointestinal image recognition flow and a textual medical record processing flow. High-level features of upper gastrointestinal data are extracted by identifying effective feature channels according to the correlation between the textual features and the spatial structure of the image features. The final screening results are obtained after the data fusion step. The experimental results show that the improvement of our approach over the state-of-the-art ones reached 4.01% in average. The source code of SCNET is available at https://github.com/netflymachine/SCNET.",
                "authors": [
                    {
                        "name": "Ding S."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Yang S."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "SCNET: A Novel UGI Cancer Screening Framework Based on Semantic-Level Multimodal Data Fusion"
            },
            "pmid": "32224471"
        }
    ],
    "topic": [
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        }
    ]
}