{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T10:34:40.330657Z",
    "biotoolsCURIE": "biotools:toxicr",
    "biotoolsID": "toxicr",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "matt.wheeler@nih.gov",
            "name": "Matthew W. Wheeler",
            "typeEntity": "Person"
        },
        {
            "name": "John House",
            "typeEntity": "Person"
        },
        {
            "name": "Sooyeong Lim",
            "typeEntity": "Person"
        }
    ],
    "description": "ToxicR is an R package that utilizes the core functionality of the US EPA’s Benchmark Dose Software and the NTP’s BMDexpress. It was developed in unison with researchers from the National Institute of Environmental Health. ToxicR is fully interactive and can be used to create custom analysis pipelines within the R programming environment.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway analysis",
                    "uri": "http://edamontology.org/operation_3928"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=36909352",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:33:17.921450Z",
    "name": "ToxicR",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/j.comtox.2022.100259",
            "metadata": {
                "abstract": "The need to analyze the complex relationships observed in high-throughput toxicogenomic and other omic platforms has resulted in an explosion of methodological advances in computational toxicology. However, advancements in the literature often outpace the development of software researchers can implement in their pipelines, and existing software is frequently based on pre-specified workflows built from well-vetted assumptions that may not be optimal for novel research questions. Accordingly, there is a need for a stable platform and open-source codebase attached to a programming language that allows users to program new algorithms. To fill this gap, the Biostatistics and Computational Biology Branch of the National Institute of Environmental Health Sciences, in cooperation with the National Toxicology Program (NTP) and US Environmental Protection Agency (EPA), developed ToxicR, an open-source R programming package. The ToxicR platform implements many of the standard analyses used by the NTP and EPA, including dose–response analyses for continuous and dichotomous data that employ Bayesian, maximum likelihood, and model averaging methods, as well as many standard tests the NTP uses in rodent toxicology and carcinogenicity studies, such as the poly-K and Jonckheere trend tests. ToxicR is built on the same codebase as current versions of the EPA's Benchmark Dose software and NTP's BMDExpress software but has increased flexibility because it directly accesses this software. To demonstrate ToxicR, we developed a custom workflow to illustrate its capabilities for analyzing toxicogenomic data. The unique features of ToxicR will allow researchers in other fields to add modules, increasing its functionality in the future.",
                "authors": [
                    {
                        "name": "Allen Davis J."
                    },
                    {
                        "name": "Auerbach S.S."
                    },
                    {
                        "name": "Fostel J."
                    },
                    {
                        "name": "Gift J.S."
                    },
                    {
                        "name": "House J.S."
                    },
                    {
                        "name": "John Bailer A."
                    },
                    {
                        "name": "Lim S."
                    },
                    {
                        "name": "Motsinger-Reif A.A."
                    },
                    {
                        "name": "Raghuraman A."
                    },
                    {
                        "name": "Shockley K.R."
                    },
                    {
                        "name": "Talley D."
                    },
                    {
                        "name": "Wheeler M.W."
                    },
                    {
                        "name": "Yang L."
                    }
                ],
                "citationCount": 9,
                "date": "2023-02-01T00:00:00Z",
                "journal": "Computational Toxicology",
                "title": "ToxicR: A computational platform in R for computational toxicology and dose–response analyses"
            },
            "pmcid": "PMC9997717",
            "pmid": "36909352"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Toxicology",
            "uri": "http://edamontology.org/topic_2840"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
