{
    "accessibility": "Open access",
    "additionDate": "2019-05-27T16:59:15Z",
    "biotoolsCURIE": "biotools:SLiM_software",
    "biotoolsID": "SLiM_software",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "messer@cornell.edu",
            "name": "Philipp Messer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "bhaller@benhaller.com",
            "name": "Benjamin C. Haller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Evolutionary simulation framework that combines a powerful engine for population genetic simulations with the capability of modeling arbitrarily complex evolutionary scenarios.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://benhaller.com/slim/SLiM_Manual.pdf"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://benhaller.com/slim/SLiM.zip"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://messerlab.org/slim/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2020-06-16T10:55:22Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "SLiM",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1093/molbev/msy228",
            "metadata": {
                "abstract": "© The Author(s) 2019. Published by Oxford University Press on behalf of the Society for Molecular Biology and Evolution.With the desire to model population genetic processes under increasingly realistic scenarios, forward genetic simulations have become a critical part of the toolbox of modern evolutionary biology. The SLiM forward genetic simulation framework is one of the most powerful and widely used tools in this area. However, its foundation in the Wright-Fisher model has been found to pose an obstacle to implementing many types of models; it is difficult to adapt the Wright-Fisher model, with its many assumptions, to modeling ecologically realistic scenarios such as explicit space, overlapping generations, individual variation in reproduction, density-dependent population regulation, individual variation in dispersal or migration, local extinction and recolonization, mating between subpopulations, age structure, fitness-based survival and hard selection, emergent sex ratios, and so forth. In response to this need, we here introduce SLiM 3, which contains two key advancements aimed at abolishing these limitations. First, the new non-Wright-Fisher or \"nonWF\" model type provides a much more flexible foundation that allows the easy implementation of all of the above scenarios and many more. Second, SLiM 3 adds support for continuous space, including spatial interactions and spatial maps of environmental variables. We provide a conceptual overview of these new features, and present several example models to illustrate their use.",
                "authors": [
                    {
                        "name": "Haller B.C."
                    },
                    {
                        "name": "Messer P.W."
                    }
                ],
                "citationCount": 102,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "SLiM 3: Forward Genetic Simulations Beyond the Wright-Fisher Model"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ],
    "version": [
        "3.3"
    ]
}