{
    "accessibility": "Open access",
    "additionDate": "2019-05-27T16:59:15Z",
    "biotoolsCURIE": "biotools:SLiM_software",
    "biotoolsID": "SLiM_software",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bhaller@benhaller.com",
            "name": "Benjamin C. Haller",
            "orcidid": "https://orcid.org/0000-0003-1874-8327",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://benhaller.com"
        },
        {
            "email": "messer@cornell.edu",
            "name": "Philipp Messer",
            "orcidid": "https://orcid.org/0000-0001-8453-9377",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://messerlab.org"
        }
    ],
    "description": "Evolutionary simulation framework that combines a powerful engine for population genetic simulations with the capability of modeling arbitrarily complex evolutionary scenarios.  Includes a graphical modeling environment.",
    "documentation": [
        {
            "note": "Quick reference sheets for SLiM and Eidos",
            "type": [
                "Quick start guide"
            ],
            "url": "http://benhaller.com/slim/SLiMEidosRefSheets.zip"
        },
        {
            "note": "The manual for Eidos, the scripting language used by SLiM",
            "type": [
                "User manual"
            ],
            "url": "http://benhaller.com/slim/Eidos_Manual.pdf"
        },
        {
            "note": "The manual for SLiM itself",
            "type": [
                "User manual"
            ],
            "url": "http://benhaller.com/slim/SLiM_Manual.pdf"
        }
    ],
    "download": [
        {
            "note": "A source archive for the command-line `slim` tool only.  Complete source code is on GitHub, but most platforms have an installer anyway; see the manual, chapter 2, for installation instructions.",
            "type": "Source code",
            "url": "http://benhaller.com/slim/SLiM.zip"
        },
        {
            "note": "The GitHub page for the current release version, to obtain full source code.",
            "type": "Downloads page",
            "url": "https://github.com/MesserLab/SLiM/releases/latest"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Run individual-based eco-evolutionary simulations with explicit genetics",
            "operation": [
                {
                    "term": "DNA substitution modelling",
                    "uri": "http://edamontology.org/operation_0550"
                },
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Sequence generation",
                    "uri": "http://edamontology.org/operation_0230"
                }
            ]
        }
    ],
    "homepage": "https://messerlab.org/slim/",
    "language": [
        "C++"
    ],
    "lastUpdate": "2025-04-18T17:40:38.228809Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": "Announcements mailing list",
            "type": [
                "Mailing list"
            ],
            "url": "https://groups.google.com/g/slim-announce"
        },
        {
            "note": "Discussion forum for SLiM questions",
            "type": [
                "Discussion forum"
            ],
            "url": "https://groups.google.com/g/slim-discuss"
        },
        {
            "note": "GitHub repository for SLiM",
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MesserLab/SLiM"
        },
        {
            "note": "SLiM home page in the Messer Lab website",
            "type": [
                "Software catalogue"
            ],
            "url": "https://messerlab.org/slim/"
        }
    ],
    "maturity": "Mature",
    "name": "SLiM",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bchaller",
    "publication": [
        {
            "doi": "10.1086/723601",
            "metadata": {
                "abstract": "The SLiM software framework for genetically explicit forward simulation has been widely used in population genetics. However, it has been largely restricted to modeling only a single species, which has limited its broader utility in evolutionary biology. Indeed, to our knowledge no general-purpose, flexible modeling framework exists that provides support for simulating multiple species while also providing other key features, such as explicit genetics and continuous space. The lack of such software has limited our ability to model higher biological levels such as communities, eco-systems, coevolutionary and eco-evolutionary processes, and bio-diversity, which is crucial for many purposes, from extending our basic understanding of evolutionary ecology to informing conservation and management decisions. We here announce the release of SLiM 4, which fills this important gap by adding support for multiple species, including ecological interactions between species such as predation, parasitism, and mutualism, and illustrate its new features with examples.",
                "authors": [
                    {
                        "name": "Haller B.C."
                    },
                    {
                        "name": "Messer P.W."
                    }
                ],
                "citationCount": 79,
                "date": "2023-05-01T00:00:00Z",
                "journal": "American Naturalist",
                "title": "SLiM 4: Multispecies Eco-Evolutionary Modeling"
            },
            "note": "B.C. Haller, P.W. Messer. (2023). SLiM 4: Multispecies eco-evolutionary modeling. The American Naturalist 201(5), E127–E139.",
            "pmcid": "PMC10793872",
            "pmid": "37130229",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/molbev/msy228",
            "metadata": {
                "abstract": "With the desire to model population genetic processes under increasingly realistic scenarios, forward genetic simulations have become a critical part of the toolbox of modern evolutionary biology. The SLiM forward genetic simulation framework is one of the most powerful and widely used tools in this area. However, its foundation in the Wright-Fisher model has been found to pose an obstacle to implementing many types of models; it is difficult to adapt the Wright-Fisher model, with its many assumptions, to modeling ecologically realistic scenarios such as explicit space, overlapping generations, individual variation in reproduction, density-dependent population regulation, individual variation in dispersal or migration, local extinction and recolonization, mating between subpopulations, age structure, fitness-based survival and hard selection, emergent sex ratios, and so forth. In response to this need, we here introduce SLiM 3, which contains two key advancements aimed at abolishing these limitations. First, the new non-Wright-Fisher or \"nonWF\" model type provides a much more flexible foundation that allows the easy implementation of all of the above scenarios and many more. Second, SLiM 3 adds support for continuous space, including spatial interactions and spatial maps of environmental variables. We provide a conceptual overview of these new features, and present several example models to illustrate their use.",
                "authors": [
                    {
                        "name": "Haller B.C."
                    },
                    {
                        "name": "Messer P.W."
                    }
                ],
                "citationCount": 504,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "SLiM 3: Forward Genetic Simulations Beyond the Wright-Fisher Model"
            },
            "note": "B.C. Haller, P.W. Messer. (2019). SLiM 3: Forward genetic simulations beyond the Wright–Fisher Model. Molecular Biology and Evolution 36(3), 632–637.",
            "pmcid": "PMC6389312",
            "pmid": "30517680",
            "type": [
                "Other"
            ]
        },
        {
            "doi": "10.1093/molbev/msy237",
            "metadata": {
                "abstract": "The SLiM forward genetic simulation framework has proved to be a powerful and flexible tool for population genetic modeling. However, as a complex piece of software with many features that allow simulating a diverse assortment of evolutionary models, its initial learning curve can be difficult. Here we provide a step-by-step demonstration of how to build a simple evolutionary model in SLiM 3, to help new users get started. We will begin with a panmictic neutral model, and build up to a model of the evolution of a polygenic quantitative trait under selection for an environmental phenotypic optimum.",
                "authors": [
                    {
                        "name": "Haller B.C."
                    },
                    {
                        "name": "Messer P.W."
                    }
                ],
                "citationCount": 12,
                "date": "2019-05-01T00:00:00Z",
                "journal": "Molecular Biology and Evolution",
                "title": "Evolutionary Modeling in SLiM 3 for Beginners"
            },
            "note": "B.C. Haller, P.W. Messer. (2019). Evolutionary modeling in SLiM 3 for beginners. Molecular Biology and Evolution 36(5), 1101–1109.",
            "pmcid": "PMC6501880",
            "pmid": "30590560",
            "type": [
                "Usage"
            ]
        },
        {
            "doi": "10.1111/1755-0998.12968",
            "metadata": {
                "abstract": "There is an increasing demand for evolutionary models to incorporate relatively realistic dynamics, ranging from selection at many genomic sites to complex demography, population structure, and ecological interactions. Such models can generally be implemented as individual-based forward simulations, but the large computational overhead of these models often makes simulation of whole chromosome sequences in large populations infeasible. This situation presents an important obstacle to the field that requires conceptual advances to overcome. The recently developed tree-sequence recording method (Kelleher, Thornton, Ashander, & Ralph, 2018), which stores the genealogical history of all genomes in the simulated population, could provide such an advance. This method has several benefits: (1) it allows neutral mutations to be omitted entirely from forward-time simulations and added later, thereby dramatically improving computational efficiency; (2) it allows neutral burn-in to be constructed extremely efficiently after the fact, using “recapitation”; (3) it allows direct examination and analysis of the genealogical trees along the genome; and (4) it provides a compact representation of a population's genealogy that can be analysed in Python using the msprime package. We have implemented the tree-sequence recording method in SLiM 3 (a free, open-source evolutionary simulation software package) and extended it to allow the recording of non-neutral mutations, greatly broadening the utility of this method. To demonstrate the versatility and performance of this approach, we showcase several practical applications that would have been beyond the reach of previously existing methods, opening up new horizons for the modelling and exploration of evolutionary processes.",
                "authors": [
                    {
                        "name": "Galloway J."
                    },
                    {
                        "name": "Haller B.C."
                    },
                    {
                        "name": "Kelleher J."
                    },
                    {
                        "name": "Messer P.W."
                    },
                    {
                        "name": "Ralph P.L."
                    }
                ],
                "citationCount": 109,
                "date": "2019-03-01T00:00:00Z",
                "journal": "Molecular Ecology Resources",
                "title": "Tree-sequence recording in SLiM opens new horizons for forward-time simulation of whole genomes"
            },
            "note": "B.C. Haller, J. Galloway, J. Kelleher, P.W. Messer, P.L. Ralph. (2019). Tree-sequence recording in SLiM opens new horizons for forward-time simulation of whole genomes. Molecular Ecology Resources 19(2), 552–566.",
            "pmcid": "PMC6393187",
            "pmid": "30565882",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "version": [
        "5.0"
    ]
}
