{
    "additionDate": "2020-01-09T18:10:49Z",
    "biotoolsCURIE": "biotools:SSRSC",
    "biotoolsID": "SSRSC",
    "confidence_flag": "tool",
    "description": "Scaled Simplex Representation for Subspace Clustering.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/csjunxu/SSRSC",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-01-16T14:24:18Z",
    "name": "SSRSC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1109/TCYB.2019.2943691",
            "metadata": {
                "abstract": "© 2013 IEEE.The self-expressive property of data points, that is, each data point can be linearly represented by the other data points in the same subspace, has proven effective in leading subspace clustering (SC) methods. Most self-expressive methods usually construct a feasible affinity matrix from a coefficient matrix, obtained by solving an optimization problem. However, the negative entries in the coefficient matrix are forced to be positive when constructing the affinity matrix via exponentiation, absolute symmetrization, or squaring operations. This consequently damages the inherent correlations among the data. Besides, the affine constraint used in these methods is not flexible enough for practical applications. To overcome these problems, in this article, we introduce a scaled simplex representation (SSR) for the SC problem. Specifically, the non-negative constraint is used to make the coefficient matrix physically meaningful, and the coefficient vector is constrained to be summed up to a scalar s < 1 to make it more discriminative. The proposed SSR-based SC (SSRSC) model is reformulated as a linear equality-constrained problem, which is solved efficiently under the alternating direction method of multipliers framework. Experiments on benchmark datasets demonstrate that the proposed SSRSC algorithm is very efficient and outperforms the state-of-the-art SC methods on accuracy. The code can be found at https://github.com/csjunxu/SSRSC.",
                "authors": [
                    {
                        "name": "Meng D."
                    },
                    {
                        "name": "Shao L."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Yu M."
                    },
                    {
                        "name": "Zhang D."
                    },
                    {
                        "name": "Zhang L."
                    },
                    {
                        "name": "Zuo W."
                    }
                ],
                "citationCount": 3,
                "date": "2021-03-01T00:00:00Z",
                "journal": "IEEE Transactions on Cybernetics",
                "title": "Scaled Simplex Representation for Subspace Clustering"
            },
            "pmid": "31634148"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Physics",
            "uri": "http://edamontology.org/topic_3318"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}
