{
    "additionDate": "2017-08-20T15:59:11Z",
    "biotoolsCURIE": "biotools:sweed",
    "biotoolsID": "sweed",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "credit": [
        {
            "email": "pavlidisp@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "n.alachiotis@gmail.com",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Parallel and checkpointable tool implementing a composite ratio test for detecting selective sweeps. SweeD is based on the SweepFinder algorithm. SweeD can calculate the theoretical SFS of a give demographic model (stepwise changes or with an exponential growth phase + stepwise changes) using the method of Zickovic and Stephan (2011).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://github.com/alachins/sweed/blob/master/sweed3.0_manual.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alachins/sweed",
    "language": [
        "Shell",
        "C++",
        "C"
    ],
    "lastUpdate": "2019-09-04T08:38:38Z",
    "license": "GPL-3.0",
    "name": "SweeD",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "admin",
    "publication": [
        {
            "doi": "10.1101/gr.4252305",
            "metadata": {
                "abstract": "Detecting selective sweeps from genomic SNP data is complicated by the intricate ascertainment schemes used to discover SNPs, and by the confounding influence of the underlying complex demographics and varying mutation and recombination rates. Current methods for detecting selective sweeps have little or no robustness to the demographic assumptions and varying recombination rates, and provide no method for correcting for ascertainment biases. Here, we present several new tests aimed at detecting selective sweeps from genomic SNP data. Using extensive simulations, we show that a new parametric test, based on composite likelihood, has a high power to detect selective sweeps and is surprisingly robust to assumptions regarding recombination rates and demography (i.e., has low Type I error). Our new test also provides estimates of the location of the selective sweep(s) and the magnitude of the selection coefficient. To illustrate the method, we apply our approach to data from the Seattle SNP project and to Chromosome 2 data from the HapMap project. In Chromosome 2, the most extreme signal is found in the lactase gene, which previously has been shown to be undergoing positive selection. Evidence for selective sweeps is also found in many other regions, including genes known to be associated with disease risk such as DPP10 and COL4A3. ©2005 by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Nielsen R."
                    },
                    {
                        "name": "Williamson S."
                    },
                    {
                        "name": "Kim Y."
                    },
                    {
                        "name": "Hubisz M.J."
                    },
                    {
                        "name": "Clark A.G."
                    },
                    {
                        "name": "Bustamante C."
                    }
                ],
                "citationCount": 596,
                "date": "2005-11-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Genomic scans for selective sweeps using SNP data"
            },
            "pmcid": "PMC1310644",
            "pmid": "16251466",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}