{
    "additionDate": "2017-08-03T18:57:46Z",
    "biotoolsCURIE": "biotools:rexprimer",
    "biotoolsID": "rexprimer",
    "credit": [
        {
            "email": "chumpol.nga@biotec.or.th",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www4a.biotec.or.th/GI"
        }
    ],
    "description": "A web application that provides many functionalities for improved PCR primer design.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www4a.biotec.or.th/rexprimer/help/User_Manual.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://www4a.biotec.or.th/rexprimer/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/rexprimer-web-based-application-for-primer-design.html"
        }
    ],
    "name": "RExPrimer",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Background: Polymerase chain reaction (PCR) is very useful in many areas of molecular biology research. It is commonly observed that PCR success is critically dependent on design of an effective primer pair. Current tools for primer design do not adequately address the problem of PCR failure due to mis-priming on target-related sequences and structural variations in the genome. Methods: We have developed an integrated graphical web-based application for primer design, called RExPrimer, which was written in Python language. The software uses Primer3 as the primer designing core algorithm. Locally stored sequence information and genomic variant information were hosted on MySQLv5.0 and were incorporated into RExPrimer. Results: RExPrimer provides many functionalities for improved PCR primer design. Several databases, namely annotated human SNP databases, insertion/deletion (indel) polymorphisms database, pseudogene database, and structural genomic variation databases were integrated into RExPrimer, enabling an effective without-leaving-the-website validation of the resulting primers. By incorporating these databases, the primers reported by RExPrimer avoid mis-priming to related sequences (e.g. pseudogene, segmental duplication) as well as possible PCR failure because of structural polymorphisms (SNP, indel, and copy number variation (CNV)). To prevent mismatching caused by unexpected SNPs in the designed primers, in particular the 3' end (SNP-in-Primer), several SNP databases covering the broad range of population-specific SNP information are utilized to report SNPs present in the primer sequences. Population-specific SNP information also helps customize primer design for a specific population. Furthermore, RExPrimer offers a graphical user-friendly interface through the use of scalable vector graphic image that intuitively presents resulting primers along with the corresponding gene structure. In this study, we demonstrated the program effectiveness in successfully generating primers for strong homologous sequences. Conclusion: The improvements for primer design incorporated into RExPrimer were demonstrated to be effective in designing primers for challenging PCR experiments. Integration of SNP and structural variation databases allows for robust primer design for a variety of PCR applications, irrespective of the sequence complexity in the region of interest. This software is freely available at http://www4a.biotec.or.th/rexprimer. © 2009 Piriyapongsa et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Piriyapongsa J."
                    },
                    {
                        "name": "Ngamphiw C."
                    },
                    {
                        "name": "Assawamakin A."
                    },
                    {
                        "name": "Wangkumhang P."
                    },
                    {
                        "name": "Suwannasri P."
                    },
                    {
                        "name": "Ruangrit U."
                    },
                    {
                        "name": "Agavatpanitch G."
                    },
                    {
                        "name": "Tongsima S."
                    }
                ],
                "citationCount": 15,
                "date": "2009-12-03T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "RExPrimer: An integrated primer designing tool increases PCR effectiveness by avoiding 3' SNP-in-primer and mis-priming from structural variation"
            },
            "pmid": "19958502"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        }
    ],
    "validated": 1
}