{
    "accessibility": [],
    "additionDate": "2017-01-13T13:15:12Z",
    "biotoolsCURIE": "biotools:krona",
    "biotoolsID": "krona",
    "collectionID": [
        "Animal and Crop Genomics"
    ],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "ondovb@nbacc.net",
            "gridid": null,
            "name": "B.D. Ondov",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": null
        },
        {
            "email": null,
            "gridid": null,
            "name": "GitHub Issues",
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://github.com/marbl/Krona/issues"
        }
    ],
    "description": "Krona creates interactive HTML5 charts of hierarchical data (such as taxonomic abundance in a metagenome).",
    "documentation": [
        {
            "note": null,
            "type": "General",
            "url": "https://github.com/marbl/Krona/wiki/Help"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [
            "animalandcropgenomics"
        ],
        "type": "group"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://github.com/marbl/Krona/wiki",
    "homepage_status": 0,
    "language": [
        "JavaScript",
        "Perl"
    ],
    "lastUpdate": "2019-01-29T12:06:38Z",
    "license": "Proprietary",
    "link": [],
    "maturity": "Mature",
    "name": "Krona",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "otherID": [],
    "owner": "seqwiki_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "Background: A critical output of metagenomic studies is the estimation of abundances of taxonomical or functional groups. The inherent uncertainty in assignments to these groups makes it important to consider both their hierarchical contexts and their prediction confidence. The current tools for visualizing metagenomic data, however, omit or distort quantitative hierarchical relationships and lack the facility for displaying secondary variables.Results: Here we present Krona, a new visualization tool that allows intuitive exploration of relative abundances and confidences within the complex hierarchies of metagenomic classifications. Krona combines a variant of radial, space-filling displays with parametric coloring and interactive polar-coordinate zooming. The HTML5 and JavaScript implementation enables fully interactive charts that can be explored with any modern Web browser, without the need for installed software or plug-ins. This Web-based architecture also allows each chart to be an independent document, making them easy to share via e-mail or post to a standard Web server. To illustrate Krona's utility, we describe its application to various metagenomic data sets and its compatibility with popular metagenomic analysis tools.Conclusions: Krona is both a powerful metagenomic visualization tool and a demonstration of the potential of HTML5 for highly accessible bioinformatic visualizations. Its rich and interactive displays facilitate more informed interpretations of metagenomic analyses, while its implementation as a browser-based application makes it extremely portable and easily adopted into existing analysis packages. Both the Krona rendering code and conversion tools are freely available under a BSD open-source license, and available from: http://krona.sourceforge.net. © 2011 Ondov et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Ondov B.D."
                    },
                    {
                        "name": "Bergman N.H."
                    },
                    {
                        "name": "Phillippy A.M."
                    }
                ],
                "citationCount": 385,
                "date": "2011-09-30T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Interactive metagenomic visualization in a Web browser"
            },
            "note": null,
            "pmcid": null,
            "pmid": "21961884",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        }
    ],
    "validated": 1,
    "version": []
}