{
    "additionDate": "2016-03-03T13:38:30Z",
    "biotoolsCURIE": "biotools:cspritz",
    "biotoolsID": "cspritz",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "silvio.tosatto@unipd.it",
            "name": "Silvio C.E. Tosatto",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://protein.bio.unipd.it"
        }
    ],
    "description": "Prediction of protein disorder.",
    "documentation": [
        {
            "type": "General",
            "url": "http://protein.bio.unipd.it/cspritz/help_pages/help.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "Cspritz is a new web server to detect regions of proteins which are thought to contain no structural content.",
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "http://protein.bio.unipd.it/cspritz/",
    "lastUpdate": "2018-12-10T12:58:50Z",
    "name": "CSpritz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1093/nar/gkr411",
            "metadata": {
                "abstract": "CSpritz is a web server for the prediction of intrinsic protein disorder. It is a combination of previous Spritz with two novel orthogonal systems developed by our group (Punch and ESpritz). Punch is based on sequence and structural templates trained with support vector machines. ESpritz is an efficient single sequence method based on bidirectional recursive neural networks. Spritz was extended to filter predictions based on structural homologues. After extensive testing, predictions are combined by averaging their probabilities. The CSpritz website can elaborate single or multiple predictions for either short or long disorder. The server provides a global output page, for download and simultaneous statistics of all predictions. Links are provided to each individual protein where the amino acid sequence and disorder prediction are displayed along with statistics for the individual protein. As a novel feature, CSpritz provides information about structural homologues as well as secondary structure and short functional linear motifs in each disordered segment. Benchmarking was performed on the very recent CASP9 data, where CSpritz would have ranked consistently well with a Sw measure of 49.27 and AUC of 0.828. The server, together with help and methods pages including examples, are freely available at URL: http://protein.bio.unipd.it/cspritz/. © 2011 The Author(s).",
                "authors": [
                    {
                        "name": "Walsh I."
                    },
                    {
                        "name": "Martin A.J.M."
                    },
                    {
                        "name": "Di Domenico T."
                    },
                    {
                        "name": "Vullo A."
                    },
                    {
                        "name": "Pollastri G."
                    },
                    {
                        "name": "Tosatto S.C.E."
                    }
                ],
                "citationCount": 47,
                "date": "2011-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "CSpritz: Accurate prediction of protein disorder segments with annotation for homology, secondary structure and linear motifs"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}