{
    "additionDate": "2021-01-18T12:17:37Z",
    "biotoolsCURIE": "biotools:polyfold",
    "biotoolsID": "polyfold",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bhattacharyad@auburn.edu",
            "name": "Debswapna Bhattacharya",
            "orcidid": "https://orcid.org/0000-0002-9630-0141",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive visual simulator for distance-based protein folding.\n\nPolyFold is an interactive visual simulator for distance-based protein folding. The goal of PolyFold is to give both researchers and non-experts an intuitive and easy-to-use visual interface which elucidates the process of distance-based protein folding. PolyFold embeds powerful stochastic optimization algorithms with on-demand customizations and interactive manipulations in real-time to fold a protein molecule through the satisfaction of spatial constraints derived from a protein's inter-residue distance matrix.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein folding analysis",
                    "uri": "http://edamontology.org/operation_2415"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Protein structure prediction",
                    "uri": "http://edamontology.org/operation_0474"
                },
                {
                    "term": "Protein-protein interaction analysis",
                    "uri": "http://edamontology.org/operation_2949"
                },
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Bhattacharya-Lab/PolyFold",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-24T14:54:39Z",
    "license": "GPL-3.0",
    "name": "PolyFold",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0243331",
            "metadata": {
                "abstract": "© 2020 McGehee et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Recent advances in distance-based protein folding have led to a paradigm shift in protein structure prediction. Through sufficiently precise estimation of the inter-residue distance matrix for a protein sequence, it is now feasible to predict the correct folds for new proteins much more accurately than ever before. Despite the exciting progress, a dedicated visualization system that can dynamically capture the distance-based folding process is still lacking. Most molecular visualizers typically provide only a static view of a folded protein conformation, but do not capture the folding process. Even among the selected few graphical interfaces that do adopt a dynamic perspective, none of them are distance-based. Here we present PolyFold, an interactive visual simulator for dynamically capturing the distance-based protein folding process through real-time rendering of a distance matrix and its compatible spatial conformation as it folds in an intuitive and easy-to-use interface. PolyFold integrates highly convergent stochastic optimization algorithms with on-demand customizations and interactive manipulations to maximally satisfy the geometric constraints imposed by a distance matrix. PolyFold is capable of simulating the complex process of protein folding even on modest personal computers, thus making it accessible to the general public for fostering citizen science. Open source code of PolyFold is freely available for download at https://github.com/Bhattacharya-Lab/PolyFold. It is implemented in cross-platform Java and binary executables are available for macOS, Linux, and Windows.",
                "authors": [
                    {
                        "name": "McGehee A.J."
                    },
                    {
                        "name": "Bhattacharya S."
                    },
                    {
                        "name": "Roche R."
                    },
                    {
                        "name": "Bhattacharya D."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "PolyFold: An interactive visual simulator for distance-based protein folding"
            },
            "pmcid": "PMC7714222",
            "pmid": "33270805"
        }
    ],
    "topic": [
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        },
        {
            "term": "Protein folds and structural domains",
            "uri": "http://edamontology.org/topic_0736"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ],
    "validated": 1
}