{
    "additionDate": "2021-01-18T10:33:59Z",
    "biotoolsCURIE": "biotools:gpredictor",
    "biotoolsID": "gpredictor",
    "confidence_flag": "tool",
    "description": "An improved machine learning-based model for predicting internal m7G modifications using sequence properties.\n\nAn improved machine-learning based prediction tool for identifying RNA m7G modifications.\n\nm7Gpredictor was implemented in python 2.7.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                }
            ]
        }
    ],
    "homepage": "https://github.com/NWAFU-LiuLab/m7Gpredictor",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-19T08:23:29Z",
    "name": "GPredictor",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.AB.2020.113905",
            "metadata": {
                "abstract": "© 2020 Elsevier Inc.As one of the most important post-transcriptional modifications, the N7-methylguanosine (m7G) plays a key role in many RNA processing events. The accurate identification of m7G is crucial for elucidating its biological significance and future application in the medical field. In this study, a machine learning-based model was developed for the prediction of internal m7G sites, and five different feature extraction methods (Pseudo dinucleotide composition, Pseudo k-tuple composition, K monomeric units, Ksnpf frequency, and Nucleotide chemical property) were used in the feature extraction. The Random Forest algorithm was used to find the optimized feature subset and the SVM-based predictor achieved the best performance by taking the top 240 features for model training. With different performance assessment methods, 10-fold cross validation, Jackknife test, and independent test, m7GPredictor achieved competitive performance compared with the state-of-the-art predictor iRNA-m7G. The predictor developed in this study can offer useful information for elucidating the mechanism of internal m7G sites and related experimental validations. The dataset used in this study and the source code of m7Gpredictor is all available at https://github.com/NWAFU-LiuLab/m7Gpredictor.",
                "authors": [
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu Z."
                    },
                    {
                        "name": "Mao X."
                    },
                    {
                        "name": "Li Q."
                    }
                ],
                "citationCount": 2,
                "date": "2020-11-15T00:00:00Z",
                "journal": "Analytical Biochemistry",
                "title": "m7GPredictor: An improved machine learning-based model for predicting internal m7G modifications using sequence properties"
            },
            "pmid": "32805275"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}