{
    "additionDate": "2019-11-14T19:59:20Z",
    "biotoolsCURIE": "biotools:CoRNeA",
    "biotoolsID": "CoRNeA",
    "confidence_flag": "tool",
    "description": "A pipeline to decrypt the inter protein interfaces from amino acid sequence information | Abstract Computational methods have been devised in the past to predict the interface residues using amino acid sequence information but have been majorly applied to predict for prokaryotic protein complexes. Since the composition and rate of evolution of the primary sequence are different between prokaryotes and eukaryotes, it is important to develop a method specifically for eukaryotic complexes. Here we report a new hybrid pipeline for the prediction of protein-protein interaction interfaces from the amino acid sequence information alone based on the framework of Co -evolution, machine learning ( R andom forest) and Ne twork A nalysis named CoRNeA trained specifically on eukaryotic protein complexes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Fold recognition",
                    "uri": "http://edamontology.org/operation_0303"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Residue contact prediction",
                    "uri": "http://edamontology.org/operation_0272"
                }
            ]
        }
    ],
    "homepage": "https://github.com/krits04/cornea",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-12-16T18:11:06Z",
    "name": "CoRNeA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/741280"
        },
        {
            "doi": "10.3390/biom10060938",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.Decrypting the interface residues of the protein complexes provides insight into the functions of the proteins and, hence, the overall cellular machinery. Computational methods have been devised in the past to predict the interface residues using amino acid sequence information, but all these methods have been majorly applied to predict for prokaryotic protein complexes. Since the composition and rate of evolution of the primary sequence is different between prokaryotes and eukaryotes, it is important to develop a method specifically for eukaryotic complexes. Here, we report a new hybrid pipeline for predicting the protein-protein interaction interfaces in a pairwise manner from the amino acid sequence information of the interacting proteins. It is based on the framework of Co-evolution, machine learning (Random Forest), and Network Analysis named CoRNeA trained specifically on eukaryotic protein complexes. We use Co-evolution, physicochemical properties, and contact potential as major group of features to train the Random Forest classifier. We also incorporate the intra-contact information of the individual proteins to eliminate false positives from the predictions keeping in mind that the amino acid sequence of a protein also holds information for its own folding and not only the interface propensities. Our prediction on example datasets shows that CoRNeA not only enhances the prediction of true interface residues but also reduces false positive rates significantly.",
                "authors": [
                    {
                        "name": "Burdak B."
                    },
                    {
                        "name": "Chauhan R."
                    },
                    {
                        "name": "Chopra K."
                    },
                    {
                        "name": "Kembhavi A."
                    },
                    {
                        "name": "Mande S.C."
                    },
                    {
                        "name": "Sharma K."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Biomolecules",
                "title": "Cornea: A pipeline to decrypt the inter-protein interfaces from amino acid sequence information"
            },
            "pmcid": "PMC7356028",
            "pmid": "32580303"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Protein interaction experiment",
            "uri": "http://edamontology.org/topic_3957"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
