{
    "additionDate": "2017-12-18T00:07:23Z",
    "biotoolsCURIE": "biotools:hapi-ur",
    "biotoolsID": "hapi-ur",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://genetics.med.harvard.edu/reich/Reich_Lab/Welcome.html"
        }
    ],
    "description": "HAPI-UR is a program for inferring phased haplotypes from unphased genotypes",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Haplotype inference",
                    "uri": "http://edamontology.org/operation_0487"
                }
            ]
        }
    ],
    "homepage": "http://code.google.com/p/hapi-ur/",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/hapi-ur-1-01-haplotype-inference-unrelated-samples.html"
        }
    ],
    "name": "HAPI-UR",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1016/j.ajhg.2012.06.013",
            "metadata": {
                "abstract": "Haplotypes are an important resource for a large number of applications in human genetics, but computationally inferred haplotypes are subject to switch errors that decrease their utility. The accuracy of computationally inferred haplotypes increases with sample size, and although ever larger genotypic data sets are being generated, the fact that existing methods require substantial computational resources limits their applicability to data sets containing tens or hundreds of thousands of samples. Here, we present HAPI-UR (haplotype inference for unrelated samples), an algorithm that is designed to handle unrelated and/or trio and duo family data, that has accuracy comparable to or greater than existing methods, and that is computationally efficient and can be applied to 100,000 samples or more. We use HAPI-UR to phase a data set with 58,207 samples and show that it achieves practical runtime and that switch errors decrease with sample size even with the use of samples from multiple ethnicities. Using a data set with 16,353 samples, we compare HAPI-UR to Beagle, MaCH, IMPUTE2, and SHAPEIT and show that HAPI-UR runs 18× faster than all methods and has a lower switch-error rate than do other methods except for Beagle; with the use of consensus phasing, running HAPI-UR three times gives a slightly lower switch-error rate than Beagle does and is more than six times faster. We demonstrate results similar to those from Beagle on another data set with a higher marker density. Lastly, we show that HAPI-UR has better runtime scaling properties than does Beagle so that for larger data sets, HAPI-UR will be practical and will have an even larger runtime advantage. HAPI-UR is available online (see Web Resources). © 2012 The American Society of Human Genetics.",
                "authors": [
                    {
                        "name": "Williams A.L."
                    },
                    {
                        "name": "Patterson N."
                    },
                    {
                        "name": "Glessner J."
                    },
                    {
                        "name": "Hakonarson H."
                    },
                    {
                        "name": "Reich D."
                    }
                ],
                "citationCount": 52,
                "date": "2012-08-10T00:00:00Z",
                "journal": "American Journal of Human Genetics",
                "title": "Phasing of many thousands of genotyped samples"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "samples",
            "uri": "http://edamontology.org/topic_3277"
        }
    ],
    "validated": 1,
    "version": [
        "1.01"
    ]
}