{
    "additionDate": "2018-09-03T17:06:55Z",
    "biotoolsCURIE": "biotools:strum",
    "biotoolsID": "strum",
    "credit": [
        {
            "email": "nathan.morris@cwru.edu",
            "name": "Nathan J. Morris",
            "orcidid": "http://orcid.org/0000-0001-7989-5764",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "strum is a structural equation modelling software tool for genetic analysis.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://cran.r-project.org/web/packages/strum/strum.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/strum/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-11T00:37:34Z",
    "license": "GPL-3.0",
    "name": "strum",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1186/s12863-015-0190-3",
            "metadata": {
                "abstract": "© Song et al.; licensee BioMed Central.Background: Structural equation modeling (SEM) is an extremely general and powerful approach to account for measurement error and causal pathways when analyzing data, and it has been used in wide range of applied sciences. There are many commercial and freely available software packages for SEM. However, it is difficult to use any of the packages to analyze general pedigree data, and SEM packages for genetics are limited in their application. Results: We present the new R package strum to serve the need of a suitable SEM software tool for genetic analysis. It implements a general framework for SEM within the context of general pedigree data. This context requires specialized considerations such as familial correlations and ascertainment. Our package is an extraordinarily flexible tool capable of modeling genetic association, linkage analysis, polygenic effects, shared environment, and ascertainment combined with confirmatory factor analysis and general SEM. It also provides a convenient tool for model visualization, and integrates tools for simulating pedigree data. The various features of this package are tested through a simulation study to evaluate performance, and our results show that strum is very reliable and robust in terms of the accuracy and coverage of parameter estimates. Conclusions: strum is a valuable new tool for genetic analysis. It can be easily used with general pedigree data, incorporating both measurement and structural models, giving it some significant advantages over other software packages. It also includes a built-in approach for handling ascertainment, a helpful integrated tool for genetic data simulation, and built-in tools for model visualization, providing a significant addition to biomedical research.",
                "authors": [
                    {
                        "name": "Song Y.E."
                    },
                    {
                        "name": "Stein C.M."
                    },
                    {
                        "name": "Morris N.J."
                    }
                ],
                "citationCount": 7,
                "date": "2015-04-09T00:00:00Z",
                "journal": "BMC Genetics",
                "title": "Strum: An R package for structural modeling of latent variables for general pedigrees"
            },
            "pmcid": "PMC4404673",
            "pmid": "25887541",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        }
    ],
    "validated": 1,
    "version": [
        "0.6.2"
    ]
}