{
    "additionDate": "2022-10-07T09:06:34.192758Z",
    "biotoolsCURIE": "biotools:mtbveb",
    "biotoolsID": "mtbveb",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/mtbveb/index.php"
        }
    ],
    "description": "MtbVeb is a web-based platform developed for designing vaccines against existing and emerging strains of mycobacterium tuberculosis. This includes drug resistant and extreme drug resistant M.Tb strains. It also allow users to design vaccines against M.tb using all three appraches (strain, antigen and epitope based vaccines).",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/mtbveb/index.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/mtbveb/index.php",
    "lastUpdate": "2022-10-07T09:06:41.247035Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/mtbveb/index.php"
        }
    ],
    "name": "mtbveb",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0153771",
            "metadata": {
                "abstract": "© 2016 Dhanda et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Development of an effective vaccine against drug-resistant Mycobacterium tuberculosis (Mtb) is crucial for saving millions of premature deaths every year due to tuberculosis. This paper describes a web portal developed for assisting researchers in designing vaccines against emerging Mtb strains using traditional and modern approaches. Firstly, we annotated 59 genomes of Mycobacterium species to understand similarity/dissimilarity between tuberculoid, non-tuberculoid and vaccine strains at genome level. Secondly, antigen-based vaccine candidates have been predicted in each Mtb strain. Thirdly, epitopes-based vaccine candidates were predicted/discovered in above antigen-based vaccine candidates that can stimulate all arms of immune system. Finally, a database of predicted vaccine candidates at epitopes as well at antigen level has been developed for above strains. In order to design vaccine against a newly sequenced genome of Mtb strain, server integrates three modules for identification of strain-, antigen-, epitope-specific vaccine candidates. We observed that 103522 unique peptides (9mers) had the potential to induce an antibody response and/or promiscuous binder to MHC alleles and/or have the capability to stimulate T lymphocytes. In summary, this web-portal will be useful for researchers working on designing vaccines against Mtb including drug-resistant strains. Availability: The database is available freely at http://crdd.osdd.net/raghava/mtbveb/.",
                "authors": [
                    {
                        "name": "Dhanda S.K."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Kumar S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    },
                    {
                        "name": "Singla D."
                    },
                    {
                        "name": "Vir P."
                    }
                ],
                "citationCount": 15,
                "date": "2016-04-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "A Web-Based platform for designing vaccines against existing and emerging strains of mycobacterium tuberculosis"
            }
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
