{
    "additionDate": "2020-01-14T19:34:37Z",
    "biotoolsCURIE": "biotools:deltaRpkm",
    "biotoolsID": "deltaRpkm",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "Laurent.Falquet@unifr.ch",
            "name": "Laurent Falquet",
            "orcidid": "https://orcid.org/0000-0001-8102-7579",
            "typeEntity": "Person"
        }
    ],
    "description": "an R package for a rapid detection of differential gene presence between related bacterial genomes.\n\nAn R package for a rapid differential gene presence analysis between similar genomes.\n\ndeltaRpkm is an R package whose main purpose is to quickly identify genes potentially involved in a given trait by performing a differential analysis of genes coverage between two sets of closely related bacterial genomes.\n\nAn R package for a rapid differential gene presence analysis between large datasets of similar bacterial genomes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/frihaka/deltaRpkm",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T19:34:37Z",
    "license": "GPL-2.0",
    "name": "deltaRpkm",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3234-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Comparative genomics has seen the development of many software performing the clustering, polymorphism and gene content analysis of genomes at different phylogenetic levels (isolates, species). These tools rely on de novo assembly and/or multiple alignments that can be computationally intensive for large datasets. With a large number of similar genomes in particular, e.g., in surveillance and outbreak detection, assembling each genome can become a redundant and expensive step in the identification of genes potentially involved in a given clinical feature. Results: We have developed deltaRpkm, an R package that performs a rapid differential gene presence evaluation between two large groups of closely related genomes. Starting from a standard gene count table, deltaRpkm computes the RPKM per gene per sample, then the inter-group δRPKM values, the corresponding median δRPKM (m) for each gene and the global standard deviation value of m (s m ). Genes with m > = 2 s m (standard deviation s of all the m values) are considered as \"differentially present\" in the reference genome group. Our simple yet effective method of differential RPKM has been successfully applied in a recent study published by our group (N = 225 genomes of Listeria monocytogenes) (Aguilar-Bultet et al. Front Cell Infect Microbiol 8:20, 2018). Conclusions: To our knowledge, deltaRpkm is the first tool to propose a straightforward inter-group differential gene presence analysis with large datasets of related genomes, including non-coding genes, and to output directly a list of genes potentially involved in a phenotype.",
                "authors": [
                    {
                        "name": "Akarsu H."
                    },
                    {
                        "name": "Aguilar-Bultet L."
                    },
                    {
                        "name": "Falquet L."
                    }
                ],
                "date": "2019-12-02T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DeltaRpkm: An R package for a rapid detection of differential gene presence between related bacterial genomes"
            },
            "pmcid": "PMC6889214",
            "pmid": "31791245"
        }
    ],
    "topic": [
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}