{
    "additionDate": "2020-01-14T08:52:58Z",
    "biotoolsCURIE": "biotools:GRONS",
    "biotoolsID": "GRONS",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "wangju@tmu.edu.cn",
            "name": "Ju Wang",
            "orcidid": "https://orcid.org/0000-0002-6514-0923",
            "typeEntity": "Person"
        },
        {
            "email": "limd586@outlook.com",
            "name": "Ming D Li",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive genetic resource of nicotine and smoking.\n\nGenetic resources of nicotine and smoking.\n\nGenetic Resources Of Nicotine and Smoking (GRONS) is a database devoted to provide a comprehensive and systematic collection of cross-platform genetic data on genes associated with the biological response to nicotine exposure and smoking related behaviors or diseases. By this database, we try to make such information easily accessible and interpretable for investigators in the smoking/nicotine addiction research community",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                },
                {
                    "term": "Literature search",
                    "uri": "http://edamontology.org/operation_0305"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.tmu.edu.cn/GRONS/",
    "lastUpdate": "2020-12-07T08:19:14Z",
    "name": "GRONS",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAX097",
            "metadata": {
                "abstract": "© The Author(s) 2017. Published by Oxford University Press.Nicotine, the primary psychoactive component in tobacco, can exert a broad impact on both the central and peripheral nervous systems. During the past years, a tremendous amount of efforts has been put to exploring the molecular mechanisms underlying tobacco smoking related behaviors and diseases, and many susceptibility genes have been identified via various genomic approaches. For many human complex diseases, there is a trend towards collecting and integrating the data from genetic studies and the biological information related to them into a comprehensive resource for further investigation, but we have not found such an effort for nicotine addiction or smoking-related phenotypes yet. To collect, curate, and integrate cross-platform genetic data so as to make them interpretable and easily accessible, we developed Genetic Resources Of Nicotine and Smoking (GRONS), a comprehensive database for genes related to biological response to nicotine exposure, tobacco smoking related behaviors or diseases. GRONS deposits genes from nicotine addiction studies in the following four categories, i.e. association study, genome-wide linkage scan, expression analysis on genes/proteins via high-throughput technologies, as well as single gene/protein-based experimental studies via literature search. Moreover, GRONS not only provides tools for data browse, search and graphical presentation of gene prioritization, but also presents the results from comprehensive bioinformatics analyses for the prioritized genes associated with nicotine addiction. With more and more genetic data and analysis tools integrated, GRONS will become a useful resource for studies focusing on nicotine addiction or tobacco smoking. Database URL: http://bioinfo.tmu.edu.cn/GRONS/.",
                "authors": [
                    {
                        "name": "Fang Z."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "Li M.D."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Yang Y."
                    }
                ],
                "citationCount": 2,
                "date": "2017-01-01T00:00:00Z",
                "journal": "Database : the journal of biological databases and curation",
                "title": "GRONS: a comprehensive genetic resource of nicotine and smoking"
            },
            "pmcid": "PMC5750854",
            "pmid": "31725863"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}
