{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2019-08-03T15:43:11Z",
    "biotoolsCURIE": "biotools:RuleBuilder",
    "biotoolsID": "RuleBuilder",
    "cost": "Free of charge",
    "description": "tool for drawing graphs that can be represented by the BioNetGen language, which is used to formulate mathematical, rule-based models of biochemical systems.",
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/RuleWorld/RuleBuilder/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/RuleWorld/RuleBuilder/releases",
            "version": "2.0.2"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RuleWorld/RuleBuilder",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-08-03T15:43:11Z",
    "license": "Other",
    "link": [
        {
            "type": "Issue tracker",
            "url": "https://github.com/RuleWorld/RuleBuilder/issues"
        }
    ],
    "maturity": "Mature",
    "name": "RuleBuilder",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1007/978-1-4939-9102-0_2",
            "metadata": {
                "abstract": "© 2019, Springer Science+Business Media, LLC, part of Springer Nature. RuleBuilder is a tool for drawing graphs that can be represented by the BioNetGen language (BNGL), which is used to formulate mathematical, rule-based models of biochemical systems. BNGL provides an intuitive plain text, or string, representation of such systems, which is based on a graphical formalism. Reactions are defined in terms of graph-rewriting rules that specify the necessary intrinsic properties of the reactants, a transformation, and a rate law. Rules also contain contextual constraints that restrict application of the rule. In some cases, the specification of contextual constraints can be verbose, making a rule difficult to read. RuleBuilder is designed to ease the task of reading and writing individual reaction rules or other BNGL patterns required for model formulation. The software assists in the reading of existing models by converting BNGL strings of interest into a graph-based representation composed of nodes and edges. RuleBuilder also enables the user to construct de novo a visual representation of BNGL strings using drawing tools available in its interface. As objects are added to the drawing canvas, the corresponding BNGL string is generated on the fly, and objects are similarly drawn on the fly as BNGL strings are entered into the application. RuleBuilder thus facilitates construction and interpretation of rule-based models.",
                "authors": [
                    {
                        "name": "Suderman R."
                    },
                    {
                        "name": "Fricke G.M."
                    },
                    {
                        "name": "Hlavacek W.S."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Methods in Molecular Biology",
                "title": "Using RuleBuilder to Graphically Define and Visualize BioNetGen-Language Patterns and Reaction Rules"
            },
            "pmid": "30945241",
            "type": "Primary"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ]
}