{
    "additionDate": "2021-01-18T11:11:53Z",
    "biotoolsCURIE": "biotools:intapt",
    "biotoolsID": "intapt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "xuan@vt.edu",
            "name": "Xu Shi",
            "typeEntity": "Person"
        }
    ],
    "description": "Integrated assembly of phenotype-specific transcripts from multiple RNA-seq profiles.\n\nIntAPT is a C++ package to identify alternatively spliced isoforms using multiple RNA-seq data. The user manual of IntAPT is available here. We have provided both precompiled binaries (require gcc 5.4.0 or newer) and source code.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                },
                {
                    "term": "Alternative splicing prediction",
                    "uri": "http://edamontology.org/operation_0264"
                }
            ]
        }
    ],
    "homepage": "http://github.com/henryxushi/IntAPT",
    "language": [
        "C++"
    ],
    "lastUpdate": "2021-02-05T07:14:40Z",
    "name": "IntAPT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA852",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: High-throughput RNA sequencing has revolutionized the scope and depth of transcriptome analysis. Accurate reconstruction of a phenotype-specific transcriptome is challenging due to the noise and variability of RNA-seq data. This requires computational identification of transcripts from multiple samples of the same phenotype, given the underlying consensus transcript structure. Results: We present a Bayesian method, integrated assembly of phenotype-specific transcripts (IntAPT), that identifies phenotype-specific isoforms from multiple RNA-seq profiles. IntAPT features a novel two-layer Bayesian model to capture the presence of isoforms at the group layer and to quantify the abundance of isoforms at the sample layer. A spike-and-slab prior is used to model the isoform expression and to enforce the sparsity of expressed isoforms. Dependencies between the existence of isoforms and their expression are modeled explicitly to facilitate parameter estimation. Model parameters are estimated iteratively using Gibbs sampling to infer the joint posterior distribution, from which the presence and abundance of isoforms can reliably be determined. Studies using both simulations and real datasets show that IntAPT consistently outperforms existing methods for the IntAPT. Experimental results demonstrate that, despite sequencing errors, IntAPT exhibits a robust performance among multiple samples, resulting in notably improved identification of expressed isoforms of low abundance.",
                "authors": [
                    {
                        "name": "Shi X."
                    },
                    {
                        "name": "Neuwald A.F."
                    },
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Wang T.-L."
                    },
                    {
                        "name": "Hilakivi-Clarke L."
                    },
                    {
                        "name": "Clarke R."
                    },
                    {
                        "name": "Xuan J."
                    }
                ],
                "date": "2021-03-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IntAPT: Integrated assembly of phenotype-specific transcripts from multiple RNA-seq profiles"
            },
            "pmid": "33016988"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA splicing",
            "uri": "http://edamontology.org/topic_3320"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ]
}