{
    "additionDate": "2017-12-18T00:09:40Z",
    "biotoolsCURIE": "biotools:ncis",
    "biotoolsID": "ncis",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://compbio.bioen.illinois.edu/index.html"
        }
    ],
    "description": "NCIS (network-assisted co-clustering for the identification of cancer subtypes) combines molecular interaction network into co-clustering.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://bioen-compbio.bioen.illinois.edu/NCIS/",
    "homepage_status": 1,
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/ncis-network-assisted-co-clustering-algorithm-to-discover-cancer-subtypes-based-on-gene-expression.html"
        }
    ],
    "name": "NCIS",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-15-37",
            "metadata": {
                "abstract": "Background: Cancer subtype information is critically important for understanding tumor heterogeneity. Existing methods to identify cancer subtypes have primarily focused on utilizing generic clustering algorithms (such as hierarchical clustering) to identify subtypes based on gene expression data. The network-level interaction among genes, which is key to understanding the molecular perturbations in cancer, has been rarely considered during the clustering process. The motivation of our work is to develop a method that effectively incorporates molecular interaction networks into the clustering process to improve cancer subtype identification.Results: We have developed a new clustering algorithm for cancer subtype identification, called \" network-assisted co-clustering for the identification of cancer subtypes\" (NCIS). NCIS combines gene network information to simultaneously group samples and genes into biologically meaningful clusters. Prior to clustering, we assign weights to genes based on their impact in the network. Then a new weighted co-clustering algorithm based on a semi-nonnegative matrix tri-factorization is applied. We evaluated the effectiveness of NCIS on simulated datasets as well as large-scale Breast Cancer and Glioblastoma Multiforme patient samples from The Cancer Genome Atlas (TCGA) project. NCIS was shown to better separate the patient samples into clinically distinct subtypes and achieve higher accuracy on the simulated datasets to tolerate noise, as compared to consensus hierarchical clustering.Conclusions: The weighted co-clustering approach in NCIS provides a unique solution to incorporate gene network information into the clustering process. Our tool will be useful to comprehensively identify cancer subtypes that would otherwise be obscured by cancer heterogeneity, using high-throughput and high-dimensional gene expression data. © 2014 Liu et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Gu Q."
                    },
                    {
                        "name": "Han J."
                    },
                    {
                        "name": "Hou J.P."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Ma J."
                    }
                ],
                "citationCount": 60,
                "date": "2014-02-04T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A network-assisted co-clustering algorithm to discover cancer subtypes based on gene expression"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cancer",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}
