{
    "additionDate": "2019-11-14T18:34:47Z",
    "biotoolsCURIE": "biotools:ALOHA",
    "biotoolsID": "ALOHA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "bianjiang@ufl.edu",
            "name": "Jiang Bian",
            "typeEntity": "Person"
        }
    ],
    "description": "> MEDIUM CONFIDENCE! | > HOMEPAGE MISSING! | developing an interactive graph-based visualization for dietary supplement knowledge graph through user-centered design | BACKGROUND:Dietary supplements (DSs) are widely used. However, consumers know little about the safety and efficacy of DSs. There is a growing interest in accessing health information online; however, health information, especially online information on DSs, is scattered with varying levels of quality. In our previous work, we prototyped a web application, ALOHA, with interactive graph-based visualization to facilitate consumers' browsing of the integrated DIetary Supplement Knowledge base (iDISK) curated from scientific resources, following an iterative user-centered design (UCD) process. METHODS:Following UCD principles, we carried out two design iterations to enrich the functionalities of ALOHA and enhance its usability",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31391091",
    "lastUpdate": "2020-12-02T12:41:46Z",
    "name": "ALOHA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12911-019-0857-1",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Dietary supplements (DSs) are widely used. However, consumers know little about the safety and efficacy of DSs. There is a growing interest in accessing health information online; however, health information, especially online information on DSs, is scattered with varying levels of quality. In our previous work, we prototyped a web application, ALOHA, with interactive graph-based visualization to facilitate consumers' browsing of the integrated DIetary Supplement Knowledge base (iDISK) curated from scientific resources, following an iterative user-centered design (UCD) process. Methods: Following UCD principles, we carried out two design iterations to enrich the functionalities of ALOHA and enhance its usability. For each iteration, we conducted a usability assessment and design session with a focus group of 8-10 participants and evaluated the usability with a modified System Usability Scale (SUS). Through thematic analysis, we summarized the identified usability issues and conducted a heuristic evaluation to map them to the Gerhardt-Powals' cognitive engineering principles. We derived suggested improvements from each of the usability assessment session and enhanced ALOHA accordingly in the next design iteration. Results: The SUS score in the second design iteration decreased to 52.2 ± 11.0 from 63.75 ± 7.2 in our original work, possibly due to the high number of new functionalities we introduced. By refining existing functionalities to make the user interface simpler, the SUS score increased to 64.4 ± 7.2 in the third design iteration. All participants agreed that such an application is urgently needed to address the gaps in how DS information is currently organized and consumed online. Moreover, most participants thought that the graph-based visualization in ALOHA is a creative and visually appealing format to obtain health information. Conclusions: In this study, we improved a novel interactive visualization platform, ALOHA, for the general public to obtain DS-related information through two UCD design iterations. The lessons learned from the two design iterations could serve as a guide to further enhance ALOHA and the development of other knowledge graph-based applications. Our study also showed that graph-based interactive visualization is a novel and acceptable approach to end-users who are interested in seeking online health information of various domains.",
                "authors": [
                    {
                        "name": "Alpert J."
                    },
                    {
                        "name": "Bian J."
                    },
                    {
                        "name": "Guo Y."
                    },
                    {
                        "name": "He X."
                    },
                    {
                        "name": "He Z."
                    },
                    {
                        "name": "Huo J."
                    },
                    {
                        "name": "Prosperi M."
                    },
                    {
                        "name": "Rizvi R."
                    },
                    {
                        "name": "Vasilakes J."
                    },
                    {
                        "name": "Yang X."
                    },
                    {
                        "name": "Zhang R."
                    }
                ],
                "citationCount": 8,
                "date": "2019-08-08T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "ALOHA: Developing an interactive graph-based visualization for dietary supplement knowledge graph through user-centered design"
            },
            "pmcid": "PMC6686235",
            "pmid": "31391091"
        }
    ],
    "validated": 1
}
