{
    "additionDate": "2017-12-18T00:08:51Z",
    "biotoolsCURIE": "biotools:mmappr",
    "biotoolsID": "mmappr",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://yost.genetics.utah.edu/"
        }
    ],
    "description": "An analysis pipeline for mapping mutations using RNA-seq. It works without parental strain information, without the requirement of a pre-existing snp map of the organism, and without erroneous assumptions that recombination occurs at the same frequency across the genome.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Mapping",
                    "uri": "http://edamontology.org/operation_2429"
                }
            ]
        }
    ],
    "homepage": "http://yost.genetics.utah.edu/software.php",
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mmappr-0-83-mutation-mapping-analysis-pipeline-pooled-rna-seq.html"
        }
    ],
    "name": "MMAPPR",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1101/gr.146936.112",
            "metadata": {
                "abstract": "Forward genetic screens in model organisms are vital for identifying novel genes essential for developmental or disease processes. One drawback of these screens is the labor-intensive and sometimes inconclusive process of mapping the causative mutation. To leverage high-throughput techniques to improve this mapping process, we have developed a Mutation Mapping Analysis Pipeline for Pooled RNA-seq (MMAPPR) that works without parental strain information or requiring a preexisting SNP map of the organism, and adapts to differential recombination frequencies across the genome. MMAPPR accommodates the considerable amount of noise in RNA-seq data sets, calculates allelic frequency by Euclidean distance followed by Loess regression analysis, identifies the region where the mutation lies, and generates a list of putative coding region mutations in the linked genomic segment. MMAPPR can exploit RNA-seq data sets from isolated tissues or whole organisms that are used for gene expression and transcriptome analysis in novel mutants. We tested MMAPPR on two known mutant lines in zebrafish, nkx2.5 and tbx1, and used it to map two novel ENU-induced cardiovascular mutants, with mutations found in the ctr9 and cds2 genes. MMAPPR can be directly applied to other model organisms, such as Drosophila and Caenorhabditis elegans, that are amenable to both forward genetic screens and pooled RNA-seq experiments. Thus, MMAPPR is a rapid, cost-efficient, and highly automated pipeline, available to perform mutant mapping in any organism with a well-assembled genome. © 2013, Published by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Hill J.T."
                    },
                    {
                        "name": "Demarest B.L."
                    },
                    {
                        "name": "Bisgrove B.W."
                    },
                    {
                        "name": "Gorsi B."
                    },
                    {
                        "name": "Su Y.-C."
                    },
                    {
                        "name": "Yost H.J."
                    }
                ],
                "citationCount": 110,
                "date": "2013-04-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "MMAPPR: Mutation Mapping Analysis Pipeline for Pooled RNA-seq"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1,
    "version": [
        "0.83"
    ]
}