{
    "additionDate": "2020-01-14T19:45:26Z",
    "biotoolsCURIE": "biotools:iSyTE",
    "biotoolsID": "iSyTE",
    "confidence_flag": "tool",
    "description": "MS/MS in silico subtraction-based proteomic profiling as an approach to facilitate disease gene discovery.\n\nA free resource for expression-based gene discovery in the eye",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Spectral counting",
                    "uri": "http://edamontology.org/operation_3637"
                },
                {
                    "term": "Differential protein expression analysis",
                    "uri": "http://edamontology.org/operation_3741"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Protein identification",
                    "uri": "http://edamontology.org/operation_3767"
                }
            ]
        }
    ],
    "homepage": "https://research.bioinformatics.udel.edu/iSyTE/",
    "lastUpdate": "2020-12-14T13:43:26Z",
    "name": "iSyTE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1007/S00439-019-02095-5",
            "metadata": {
                "abstract": "© 2019, Springer-Verlag GmbH Germany, part of Springer Nature.While the bioinformatics resource-tool iSyTE (integrated Systems Tool for Eye gene discovery) effectively identifies human cataract-associated genes, it is currently based on just transcriptome data, and thus, it is necessary to include protein-level information to gain greater confidence in gene prioritization. Here, we expand iSyTE through development of a novel proteome-based resource on the lens and demonstrate its utility in cataract gene discovery. We applied high-throughput tandem mass spectrometry (MS/MS) to generate a global protein expression profile of mouse lens at embryonic day (E)14.5, which identified 2371 lens-expressed proteins. A major challenge of high-throughput expression profiling is identification of high-priority candidates among the thousands of expressed proteins. To address this problem, we generated new MS/MS proteome data on mouse whole embryonic body (WB). WB proteome was then used as a reference dataset for performing “in silico WB-subtraction” comparative analysis with the lens proteome, which effectively identified 422 proteins with lens-enriched expression at ≥ 2.5 average spectral counts, ≥ 2.0 fold enrichment (FDR < 0.01) cut-off. These top 20% candidates represent a rich pool of high-priority proteins in the lens including known human cataract-linked genes and many new potential regulators of lens development and homeostasis. This rich information is made publicly accessible through iSyTE (https://research.bioinformatics.udel.edu/iSyTE/), which enables user-friendly visualization of promising candidates, thus making iSyTE a comprehensive tool for cataract gene discovery.",
                "authors": [
                    {
                        "name": "Aryal S."
                    },
                    {
                        "name": "Anand D."
                    },
                    {
                        "name": "Hernandez F.G."
                    },
                    {
                        "name": "Weatherbee B.A.T."
                    },
                    {
                        "name": "Huang H."
                    },
                    {
                        "name": "Reddy A.P."
                    },
                    {
                        "name": "Wilmarth P.A."
                    },
                    {
                        "name": "David L.L."
                    },
                    {
                        "name": "Lachke S.A."
                    }
                ],
                "citationCount": 5,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Human Genetics",
                "title": "MS/MS in silico subtraction-based proteomic profiling as an approach to facilitate disease gene discovery: application to lens development and cataract"
            },
            "pmid": "31797049"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}