{
    "accessibility": "Open access",
    "additionDate": "2019-05-10T08:50:16Z",
    "biotoolsCURIE": "biotools:treatable-id",
    "biotoolsID": "treatable-id",
    "cost": "Free of charge",
    "credit": [
        {
            "typeEntity": "Project",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.treatable-id.org/contact/contact.php"
        }
    ],
    "description": "Interactive tool for the clinician and scientist presenting identified 81 inborn errors of metabolism which are causally related to Intellectual Disability and amenable to therapy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://treatable-id.org/page94/intro.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://treatable-id.org",
    "lastUpdate": "2020-06-16T10:55:23Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "treatable-id",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/1750-1172-7-47",
            "metadata": {
                "abstract": "Background: Intellectual disability (ID) is a devastating and frequent condition, affecting 2-3% of the population worldwide. Early recognition of treatable underlying conditions drastically improves health outcomes and decreases burdens to patients, families and society. Our systematic literature review identified 81 such inborn errors of metabolism, which present with ID as a prominent feature and are amenable to causal therapy. The WebAPP translates this knowledge of rare diseases into a diagnostic tool and information portal. Methods & results: Freely available as a WebAPP via www.treatable-id.org and end 2012 via the APP store, this diagnostic tool is designed for all specialists evaluating children with global delay / ID and laboratory scientists. Information on the 81 diseases is presented in different ways with search functions: 15 biochemical categories, neurologic and non-neurologic signs & symptoms, diagnostic investigations (metabolic screening tests in blood and urine identify 65% of all IEM), therapies & effects on primary (IQ/developmental quotient) and secondary outcomes, and available evidence For each rare condition a disease page serves as an information portal with online access to specific genetics, biochemistry, phenotype, diagnostic tests and therapeutic options. As new knowledge and evidence is gained from expert input and PubMed searches this tool will be continually updated. The WebAPP is an integral part of a protocol prioritizing treatability in the work-up of every child with global delay / ID. A 3-year funded study will enable an evaluation of its effectiveness. Conclusions: For rare diseases, a field for which financial and scientific resources are particularly scarce, knowledge translation challenges are abundant. With this WebAPP technology is capitalized to raise awareness for rare treatable diseases and their common presenting clinical feature of ID, with the potential to improve health outcomes. This innovative digital tool is designed to motivate health care providers to search actively for treatable causes of ID, and support an evidence-based approach to rare metabolic diseases. In our current omics world with continuous information flow, the effective synthesis of data into accessible, clinical knowledge has become ever more essential to bridge the gap between research and care. © 2012 van Karnebeek et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Van Karnebeek C.D.M."
                    },
                    {
                        "name": "Houben R.F.A."
                    },
                    {
                        "name": "Lafek M."
                    },
                    {
                        "name": "Giannasi W."
                    },
                    {
                        "name": "Stockler S."
                    }
                ],
                "citationCount": 29,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "The treatable intellectual disability APP www.treatable-id.org: A digital tool to enhance diagnosis & care for rare diseases"
            },
            "pmcid": "PMC3458980",
            "pmid": "22824307",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        }
    ],
    "validated": 1
}