{
    "accessibility": "Open access",
    "additionDate": "2019-05-10T08:50:16Z",
    "biotoolsCURIE": "biotools:treatable-id",
    "biotoolsID": "treatable-id",
    "collectionID": [
        "Rare Disease"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "email": "clara.vankarnebeek@radboudumc.nl",
            "name": "Clara D. M. van Karnebeek",
            "orcidid": "https://orcid.org/0000-0002-2648-8337",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "treatable-ID is an interactive tool for the clinician and scientist presenting identified 81 inborn errors of metabolism which are causally related to Intellectual Disability and amenable to therapy.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://treatable-id.org/page94/intro.html"
        }
    ],
    "editPermission": {
        "authors": [
            "Kigaard"
        ],
        "type": "group"
    },
    "homepage": "http://treatable-id.org",
    "lastUpdate": "2022-01-17T12:23:06.201568Z",
    "license": "Other",
    "maturity": "Mature",
    "name": "treatable-ID",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "Ruta",
    "publication": [
        {
            "doi": "10.1186/S13023-021-01727-2",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The Treatable ID App was created in 2012 as digital tool to improve early recognition and intervention for treatable inherited metabolic disorders (IMDs) presenting with global developmental delay and intellectual disability (collectively ‘treatable IDs’). Our aim is to update the 2012 review on treatable IDs and App to capture the advances made in the identification of new IMDs along with increased pathophysiological insights catalyzing therapeutic development and implementation. Methods: Two independent reviewers queried PubMed, OMIM and Orphanet databases to reassess all previously included disorders and therapies and to identify all reports on Treatable IDs published between 2012 and 2021. These were included if listed in the International Classification of IMDs (ICIMD) and presenting with ID as a major feature, and if published evidence for a therapeutic intervention improving ID primary and/or secondary outcomes is available. Data on clinical symptoms, diagnostic testing, treatment strategies, effects on outcomes, and evidence levels were extracted and evaluated by the reviewers and external experts. The generated knowledge was translated into a diagnostic algorithm and updated version of the App with novel features. Results: Our review identified 116 treatable IDs (139 genes), of which 44 newly identified, belonging to 17 ICIMD categories. The most frequent therapeutic interventions were nutritional, pharmacological and vitamin and trace element supplementation. Evidence level varied from 1 to 3 (trials, cohort studies, case–control studies) for 19% and 4–5 (case-report, expert opinion) for 81% of treatments. Reported effects included improvement of clinical deterioration in 62%, neurological manifestations in 47% and development in 37%. Conclusion: The number of treatable IDs identified by our literature review increased by more than one-third in eight years. Although there has been much attention to gene-based and enzyme replacement therapy, the majority of effective treatments are nutritional, which are relatively affordable, widely available and (often) surprisingly effective. We present a diagnostic algorithm (adjustable to local resources and expertise) and the updated App to facilitate a swift and accurate workup, prioritizing treatable IDs. Our digital tool is freely available as Native and Web App (www.treatable-id.org) with several novel features. Our Treatable ID endeavor contributes to the Treatabolome and International Rare Diseases Research Consortium goals, enabling clinicians to deliver rapid evidence-based interventions to our rare disease patients.",
                "authors": [
                    {
                        "name": "Hoytema van Konijnenburg E.M.M."
                    },
                    {
                        "name": "Wortmann S.B."
                    },
                    {
                        "name": "Koelewijn M.J."
                    },
                    {
                        "name": "Tseng L.A."
                    },
                    {
                        "name": "Houben R."
                    },
                    {
                        "name": "Stockler-Ipsiroglu S."
                    },
                    {
                        "name": "Ferreira C.R."
                    },
                    {
                        "name": "van Karnebeek C.D.M."
                    }
                ],
                "citationCount": 4,
                "date": "2021-12-01T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "Treatable inherited metabolic disorders causing intellectual disability: 2021 review and digital app"
            },
            "pmcid": "PMC8042729",
            "pmid": "33845862",
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1186/1750-1172-7-47",
            "metadata": {
                "abstract": "Background: Intellectual disability (ID) is a devastating and frequent condition, affecting 2-3% of the population worldwide. Early recognition of treatable underlying conditions drastically improves health outcomes and decreases burdens to patients, families and society. Our systematic literature review identified 81 such inborn errors of metabolism, which present with ID as a prominent feature and are amenable to causal therapy. The WebAPP translates this knowledge of rare diseases into a diagnostic tool and information portal. Methods & results: Freely available as a WebAPP via www.treatable-id.org and end 2012 via the APP store, this diagnostic tool is designed for all specialists evaluating children with global delay / ID and laboratory scientists. Information on the 81 diseases is presented in different ways with search functions: 15 biochemical categories, neurologic and non-neurologic signs & symptoms, diagnostic investigations (metabolic screening tests in blood and urine identify 65% of all IEM), therapies & effects on primary (IQ/developmental quotient) and secondary outcomes, and available evidence For each rare condition a disease page serves as an information portal with online access to specific genetics, biochemistry, phenotype, diagnostic tests and therapeutic options. As new knowledge and evidence is gained from expert input and PubMed searches this tool will be continually updated. The WebAPP is an integral part of a protocol prioritizing treatability in the work-up of every child with global delay / ID. A 3-year funded study will enable an evaluation of its effectiveness. Conclusions: For rare diseases, a field for which financial and scientific resources are particularly scarce, knowledge translation challenges are abundant. With this WebAPP technology is capitalized to raise awareness for rare treatable diseases and their common presenting clinical feature of ID, with the potential to improve health outcomes. This innovative digital tool is designed to motivate health care providers to search actively for treatable causes of ID, and support an evidence-based approach to rare metabolic diseases. In our current omics world with continuous information flow, the effective synthesis of data into accessible, clinical knowledge has become ever more essential to bridge the gap between research and care. © 2012 van Karnebeek et al.; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Van Karnebeek C.D.M."
                    },
                    {
                        "name": "Houben R.F.A."
                    },
                    {
                        "name": "Lafek M."
                    },
                    {
                        "name": "Giannasi W."
                    },
                    {
                        "name": "Stockler S."
                    }
                ],
                "citationCount": 29,
                "date": "2012-10-01T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "The treatable intellectual disability APP www.treatable-id.org: A digital tool to enhance diagnosis & care for rare diseases"
            },
            "pmcid": "PMC3458980",
            "pmid": "22824307",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Dermatology",
            "uri": "http://edamontology.org/topic_3404"
        }
    ],
    "validated": 1
}