{
    "accessibility": "Open access",
    "additionDate": "2022-09-02T07:31:38.262435Z",
    "biotoolsCURIE": "biotools:bioautoml",
    "biotoolsID": "bioautoml",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "rpbonidia@gmail.com",
            "name": "Robson P Bonidia",
            "typeEntity": "Person"
        },
        {
            "email": "ulisses.rocha@ufz.de",
            "name": "Ulisses N da Rocha",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated feature engineering and metalearning to predict noncoding RNAs in bacteria.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bonidia.github.io/BioAutoML/"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Bonidia/BioAutoML",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-02T07:31:38.265082Z",
    "license": "Not licensed",
    "name": "BioAutoML",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/BIB/BBAC218",
            "metadata": {
                "abstract": "© The Author(s) 2022. Published by Oxford University Press.Recent technological advances have led to an exponential expansion of biological sequence data and extraction of meaningful information through Machine Learning (ML) algorithms. This knowledge has improved the understanding of mechanisms related to several fatal diseases, e.g. Cancer and coronavirus disease 2019, helping to develop innovative solutions, such as CRISPR-based gene editing, coronavirus vaccine and precision medicine. These advances benefit our society and economy, directly impacting people's lives in various areas, such as health care, drug discovery, forensic analysis and food processing. Nevertheless, ML-based approaches to biological data require representative, quantitative and informative features. Many ML algorithms can handle only numerical data, and therefore sequences need to be translated into a numerical feature vector. This process, known as feature extraction, is a fundamental step for developing high-quality ML-based models in bioinformatics, by allowing the feature engineering stage, with design and selection of suitable features. Feature engineering, ML algorithm selection and hyperparameter tuning are often manual and time-consuming processes, requiring extensive domain knowledge. To deal with this problem, we present a new package: BioAutoML. BioAutoML automatically runs an end-to-end ML pipeline, extracting numerical and informative features from biological sequence databases, using the MathFeature package, and automating the feature selection, ML algorithm(s) recommendation and tuning of the selected algorithm(s) hyperparameters, using Automated ML (AutoML). BioAutoML has two components, divided into four modules: (1) automated feature engineering (feature extraction and selection modules) and (2) Metalearning (algorithm recommendation and hyper-parameter tuning modules). We experimentally evaluate BioAutoML in two different scenarios: (i) prediction of the three main classes of noncoding RNAs (ncRNAs) and (ii) prediction of the eight categories of ncRNAs in bacteria, including housekeeping and regulatory types. To assess BioAutoML predictive performance, it is experimentally compared with two other AutoML tools (RECIPE and TPOT). According to the experimental results, BioAutoML can accelerate new studies, reducing the cost of feature engineering processing and either keeping or improving predictive performance. BioAutoML is freely available at https://github.com/Bonidia/BioAutoML.",
                "authors": [
                    {
                        "name": "Bonidia R.P."
                    },
                    {
                        "name": "Sanches D.S."
                    },
                    {
                        "name": "Santos A.P.A."
                    },
                    {
                        "name": "Stadler P.F."
                    },
                    {
                        "name": "da Rocha U.N."
                    },
                    {
                        "name": "de Almeida B.L.S."
                    },
                    {
                        "name": "de Carvalho A.C.P.L.F."
                    }
                ],
                "date": "2022-07-18T00:00:00Z",
                "journal": "Briefings in bioinformatics",
                "title": "BioAutoML: automated feature engineering and metalearning to predict noncoding RNAs in bacteria"
            },
            "pmcid": "PMC9294424",
            "pmid": "35753697"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
