{
    "accessibility": "Open access",
    "additionDate": "2024-02-01T16:17:09.041683Z",
    "biotoolsCURIE": "biotools:deeppic",
    "biotoolsID": "deeppic",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "zmzhang@csu.edu.cn",
            "name": "Zhimin Zhang",
            "typeEntity": "Person"
        },
        {
            "name": "Miao Tian",
            "typeEntity": "Person"
        },
        {
            "name": "Yuxuan Liao",
            "typeEntity": "Person"
        }
    ],
    "description": "Approach for pure ion chromatogram construction from liquid chromatography-mass spectrometry data using deep learning.\nExtract PICs from raw data files directly and automatically. The DeepPIC method has already been integrated into the KPIC2 framework. The combination can provide the entire pipeline from raw data to discriminant models for metabolomic datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yuxuanliao/DeepPIC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-02-01T16:17:09.044521Z",
    "license": "BSD-3-Clause",
    "name": "DeepPIC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.CHROMA.2023.464172",
            "metadata": {
                "abstract": "Feature extraction is the most fundamental step when analyzing liquid chromatography-mass spectrometry (LC-MS) datasets. However, traditional methods require optimal parameter selections and re-optimization for different datasets, thus hindering efficient and objective large-scale data analysis. Pure ion chromatogram (PIC) is widely used because it avoids the peak splitting problem of the extracted ion chromatogram (EIC) and regions of interest (ROIs). Here, we developed a deep learning-based pure ion chromatogram method (DeepPIC) to find PICs using a customized U-Net from centroid mode data of LC-MS directly and automatically. A model was trained, validated, and tested on the Arabidopsis thaliana dataset with 200 input-label pairs. DeepPIC was integrated into KPIC2. The combination enables the entire processing pipeline from raw data to discriminant models for metabolomics datasets. The KPIC2 with DeepPIC was compared against other competing methods (XCMS, FeatureFinderMetabo, and peakonly) on the MM48, simulated MM48, and quantitative datasets. These comparisons showed that DeepPIC outperforms XCMS, FeatureFinderMetabo, and peakonly in recall rates and correlation with sample concentrations. Five datasets of different instruments and samples were used to evaluate the quality of PICs and the universal applicability of DeepPIC, and 95.12% of the found PICs could precisely match their manually labeled PICs. Therefore, KPIC2+DeepPIC is an automatic, practical, and off-the-shelf method to extract features from raw data directly, exceeding traditional methods with careful parameter tuning. It is publicly available at https://github.com/yuxuanliao/DeepPIC.",
                "authors": [
                    {
                        "name": "Chen Y."
                    },
                    {
                        "name": "Jiang Y."
                    },
                    {
                        "name": "Liao Y."
                    },
                    {
                        "name": "Lu H."
                    },
                    {
                        "name": "Tian M."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhang Z."
                    }
                ],
                "citationCount": 1,
                "date": "2023-08-30T00:00:00Z",
                "journal": "Journal of Chromatography A",
                "title": "Highly automatic and universal approach for pure ion chromatogram construction from liquid chromatography-mass spectrometry data using deep learning"
            },
            "pmid": "37392637"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
