{
    "additionDate": "2018-07-22T08:56:25Z",
    "biotoolsCURIE": "biotools:taxmapper",
    "biotoolsID": "taxmapper",
    "credit": [
        {
            "email": "daniela.beisser@uni-due.de",
            "name": "Daniela Beisser",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis tool for a reliable mapping to a provided microeukaryotic reference database and part of a comprehensive Snakemake workflow. It is used to assign taxonomic information to each NGS read by mapping to the database and filtering low quality assignments.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://bitbucket.org/dbeisser/taxmapper"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/dbeisser/taxmapper",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "name": "TaxMapper",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s12864-017-4168-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: High-throughput sequencing (HTS) technologies are increasingly applied to analyse complex microbial ecosystems by mRNA sequencing of whole communities, also known as metatranscriptome sequencing. This approach is at the moment largely limited to prokaryotic communities and communities of few eukaryotic species with sequenced genomes. For eukaryotes the analysis is hindered mainly by a low and fragmented coverage of the reference databases to infer the community composition, but also by lack of automated workflows for the task. Results: From the databases of the National Center for Biotechnology Information and Marine Microbial Eukaryote Transcriptome Sequencing Project, 142 references were selected in such a way that the taxa represent the main lineages within each of the seven supergroups of eukaryotes and possess predominantly complete transcriptomes or genomes. From these references, we created an annotated microeukaryotic reference database. We developed a tool called TaxMapper for a reliably mapping of sequencing reads against this database and filtering of unreliable assignments. For filtering, a classifier was trained and tested on each of the following: sequences of taxa in the database, sequences of taxa related to those in the database, and random sequences. Additionally, TaxMapper is part of a metatranscriptomic Snakemake workflow developed to perform quality assessment, functional and taxonomic annotation and (multivariate) statistical analysis including environmental data. The workflow is provided and described in detail to empower researchers to apply it for metatranscriptome analysis of any environmental sample. Conclusions: TaxMapper shows superior performance compared to standard approaches, resulting in a higher number of true positive taxonomic assignments. Both the TaxMapper tool and the workflow are available as open-source code at Bitbucket under the MIT license: https://bitbucket.org/dbeisser/taxmapper and as a Bioconda package: https://bioconda.github.io/recipes/taxmapper/README.html.",
                "authors": [
                    {
                        "name": "Beisser D."
                    },
                    {
                        "name": "Boenigk J."
                    },
                    {
                        "name": "Graupner N."
                    },
                    {
                        "name": "Grossmann L."
                    },
                    {
                        "name": "Rahmann S."
                    },
                    {
                        "name": "Timm H."
                    }
                ],
                "citationCount": 3,
                "date": "2017-10-16T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "TaxMapper: An analysis tool, reference database and workflow for metatranscriptome analysis of eukaryotic microorganisms"
            },
            "pmcid": "PMC5644092",
            "pmid": "29037173"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "NGS",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Taxonomy",
            "uri": "http://edamontology.org/topic_0637"
        }
    ],
    "validated": 1
}
