{
    "accessibility": "Open access",
    "additionDate": "2023-11-07T10:23:01.013983Z",
    "biotoolsCURIE": "biotools:brcadx",
    "biotoolsID": "brcadx",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "apalania@scbt.sastra.edu",
            "name": "Ashok Palaniappan",
            "typeEntity": "Person"
        },
        {
            "name": "Sangeetha Muthamilselvan",
            "typeEntity": "Person"
        }
    ],
    "description": "Precise identification of breast cancer from expression data using a minimal set of features.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component analysis",
                    "uri": "http://edamontology.org/operation_3960"
                }
            ]
        }
    ],
    "homepage": "https://apalania.shinyapps.io/brcadx/",
    "lastUpdate": "2023-11-07T10:23:01.016668Z",
    "name": "BrcaDx",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fbinf.2023.1103493",
            "metadata": {
                "abstract": "Background: Breast cancer is the foremost cancer in worldwide incidence, surpassing lung cancer notwithstanding the gender bias. One in four cancer cases among women are attributable to cancers of the breast, which are also the leading cause of death in women. Reliable options for early detection of breast cancer are needed. Methods: Using public-domain datasets, we screened transcriptomic profiles of breast cancer samples, and identified progression-significant linear and ordinal model genes using stage-informed models. We then applied a sequence of machine learning techniques, namely, feature selection, principal components analysis, and k-means clustering, to train a learner to discriminate “cancer” from “normal” based on expression levels of identified biomarkers. Results: Our computational pipeline yielded an optimal set of nine biomarker features for training the learner, namely, NEK2, PKMYT1, MMP11, CPA1, COL10A1, HSD17B13, CA4, MYOC, and LYVE1. Validation of the learned model on an independent test dataset yielded a performance of 99.5% accuracy. Blind validation on an out-of-domain external dataset yielded a balanced accuracy of 95.5%, demonstrating that the model has effectively reduced the dimensionality of the problem, and learnt the solution. The model was rebuilt using the full dataset, and then deployed as a web app for non-profit purposes at: https://apalania.shinyapps.io/brcadx/. To our knowledge, this is the best-performing freely available tool for the high-confidence diagnosis of breast cancer, and represents a promising aid to medical diagnosis.",
                "authors": [
                    {
                        "name": "Muthamilselvan S."
                    },
                    {
                        "name": "Palaniappan A."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Bioinformatics",
                "title": "BrcaDx: precise identification of breast cancer from expression data using a minimal set of features"
            },
            "pmcid": "PMC10242386",
            "pmid": "37287543"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
