{
    "additionDate": "2020-01-14T08:59:11Z",
    "biotoolsCURIE": "biotools:RNAdt",
    "biotoolsID": "RNAdt",
    "confidence_flag": "tool",
    "description": "An online tutorial and data portal for the RNA structurome era.\n\nThis is an animated dialog which is useful for displaying.\n\nTimeline of HTS-associated RNA structure probing methods",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA secondary structure alignment",
                    "uri": "http://edamontology.org/operation_0502"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://www.zhounan.org/rnadt",
    "lastUpdate": "2020-12-14T08:08:37Z",
    "name": "RNAdt",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.BIOSYSTEMS.2019.104065",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.RNA is not only a passive transporter of genetic information, but also a pivotal player in all domains of life. RNA can regulate gene expression because of its involvement in transcription, mRNA modification and processing, and translation. RNA also possesses other intricate functions such as catalysis, ligand sensing, interaction with biomolecules, response to environment stresses, and information storage. The primary structure of RNA is single stranded, but it always folds into complex secondary and tertiary structures owing to base pairing and effects from the cellular environment. The importance of structure has been increasingly recognized in understanding the myriad functions of RNA. After decades of development, there is a wide range of RNA structure probing techniques. The marriage between structure probing and high-throughput sequencing (HTS) especially enables the measurement of RNA structure on a transcriptomic scale, advancing the advent of the RNA structurome era. Dozens of HTS-associated RNA structure probing methods have been published, so it is urgent to provide a user-friendly and easy-to-use resource for users who are perplexed by selecting the most suitable method for their experiments. Motivated by this demand, we collected currently available HTS-associated RNA structure probing methods and then developed RNAdt (freely accessible at http://www.zhounan.org/rnadt). RNAdt can be used as a web-based tutorial to learn fundamental knowledge of HTS-associated RNA structure probing methods. RNAdt can also be used as a data portal to access HTS data sets from previous RNA structurome studies. At the end of this work, we also provided perspectives on future development of RNA structure probing methods. Our study is expected to facilitate RNA structure probing and ultimately elucidate the connection between RNA structure and biological functions.",
                "authors": [
                    {
                        "name": "Bao J."
                    },
                    {
                        "name": "Zhou N."
                    }
                ],
                "date": "2020-03-01T00:00:00Z",
                "journal": "BioSystems",
                "title": "RNAdt: An online tutorial and data portal for the RNA structurome era"
            },
            "pmid": "31669269"
        }
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
