{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T09:24:57Z",
    "biotoolsCURIE": "biotools:TPOT",
    "biotoolsID": "TPOT",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "jhmoore@upenn.edu",
            "name": "Jason H Moore",
            "orcidid": "https://orcid.org/0000-0002-5015-1099"
        },
        {
            "name": "Jari O Laurikka",
            "orcidid": "https://orcid.org/0000-0001-7253-6048"
        },
        {
            "name": "Weixuan Fu",
            "orcidid": "https://orcid.org/0000-0002-6434-5468"
        },
        {
            "name": "Trang T Le",
            "orcidid": "https://orcid.org/0000-0003-3737-6565"
        }
    ],
    "description": "TPOT stands for Tree-based Pipeline Optimization Tool. Consider TPOT your Data Science Assistant. TPOT is a Python Automated Machine Learning tool that optimizes machine learning pipelines using genetic programming.",
    "documentation": [
        {
            "type": [
                "General",
                "User manual"
            ],
            "url": "http://epistasislab.github.io/tpot/"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/EpistasisLab/tpot/releases/tag/v0.11.7"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EpistasisLab/tpot",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-01-21T02:22:18.024108Z",
    "license": "LGPL-3.0",
    "name": "TPOT",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ796",
            "metadata": {
                "abstract": "© The Author(s) 2019.Motivation: Selecting the optimal machine learning (ML) model for a given dataset is often challenging. Automated ML (AutoML) has emerged as a powerful tool for enabling the automatic selection of ML methods and parameter settings for the prediction of biomedical endpoints. Here, we apply the tree-based pipeline optimization tool (TPOT) to predict angiographic diagnoses of coronary artery disease (CAD). With TPOT, ML models are represented as expression trees and optimal pipelines discovered using a stochastic search method called genetic programing. We provide some guidelines for TPOT-based ML pipeline selection and optimization-based on various clinical phenotypes and high-throughput metabolic profiles in the Angiography and Genes Study (ANGES). Results: We analyzed nuclear magnetic resonance-derived lipoprotein and metabolite profiles in the ANGES cohort with a goal to identify the role of non-obstructive CAD patients in CAD diagnostics. We performed a comparative analysis of TPOT-generated ML pipelines with selected ML classifiers, optimized with a grid search approach, applied to two phenotypic CAD profiles. As a result, TPOT-generated ML pipelines that outperformed grid search optimized models across multiple performance metrics including balanced accuracy and area under the precision-recall curve. With the selected models, we demonstrated that the phenotypic profile that distinguishes non-obstructive CAD patients from no CAD patients is associated with higher precision, suggesting a discrepancy in the underlying processes between these phenotypes.",
                "authors": [
                    {
                        "name": "Orlenko A."
                    },
                    {
                        "name": "Kofink D."
                    },
                    {
                        "name": "Lyytikainen L.-P."
                    },
                    {
                        "name": "Nikus K."
                    },
                    {
                        "name": "Mishra P."
                    },
                    {
                        "name": "Kuukasjarvi P."
                    },
                    {
                        "name": "Karhunen P.J."
                    },
                    {
                        "name": "Kahonen M."
                    },
                    {
                        "name": "Laurikka J.O."
                    },
                    {
                        "name": "Lehtimaki T."
                    },
                    {
                        "name": "Asselbergs F.W."
                    },
                    {
                        "name": "Moore J.H."
                    }
                ],
                "citationCount": 12,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Model selection for metabolomics: Predicting diagnosis of coronary artery disease using automated machine learning"
            },
            "pmcid": "PMC7703753",
            "pmid": "31702773"
        },
        {
            "doi": "10.1007/S00330-021-08228-7",
            "metadata": {
                "abstract": "© 2021, European Society of Radiology.Objectives: To investigate the feasibility of automatic machine learning (autoML) based on native T1 mapping to predict late gadolinium enhancement (LGE) status in hypertrophic cardiomyopathy (HCM). Methods: Ninety-one HCM patients and 44 healthy controls who underwent cardiovascular MRI were enrolled. The native T1 maps of HCM patients were classified as LGE (+) or LGE (-) based on location-matched LGE images. An autoML pipeline was implemented using the tree-based pipeline optimization tool (TPOT) for 3 binary classifications: LGE (+) and LGE (-), LGE (-) and control, and HCM and control. TPOT modeling was repeated 10 times to obtain the optimal model for each classification. The diagnostic performance of the best models by slice and by case was evaluated using sensitivity, specificity, accuracy, and microaveraged area under the curve (AUC). Results: Ten prediction models were generated by TPOT for each of the 3 binary classifications. The diagnostic accuracy obtained with the best pipeline in detecting LGE status in the testing cohort of HCM patients was 0.80 by slice and 0.79 by case. In addition, the TPOT model also showed discriminability between LGE (-) patients and control (accuracy: 0.77 by slice; 0.78 by case) and for all HCM patients and controls (accuracy: 0.88 for both). Conclusions: Native T1 map analysis based on autoML correlates with LGE (+) or (-) status. The TPOT machine learning algorithm could be a promising method for predicting myocardial fibrosis, as reflected by the presence of LGE in HCM patients without the need for late contrast-enhanced MRI sequences. Key Points: • The tree-based pipeline optimization tool (TPOT) is a machine learning algorithm that could help predict late gadolinium enhancement (LGE) status in patients with hypertrophic cardiomyopathy. • The TPOT could serve as an adjuvant method to detect LGE by using information from native T1 maps, thus avoiding the need for contrast agent. • The TPOT also detects native T1 map alterations in LGE-negative patients with hypertrophic cardiomyopathy.",
                "authors": [
                    {
                        "name": "Peng W.-L."
                    },
                    {
                        "name": "Zhang T.-J."
                    },
                    {
                        "name": "Shi K."
                    },
                    {
                        "name": "Li H.-X."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Xia D."
                    },
                    {
                        "name": "Xia C.-C."
                    },
                    {
                        "name": "Li Z.-L."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "European Radiology",
                "title": "Automatic machine learning based on native T1 mapping can identify myocardial fibrosis in patients with hypertrophic cardiomyopathy"
            },
            "pmid": "34477909"
        },
        {
            "doi": "10.1093/bioinformatics/btz470",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Automated machine learning (AutoML) systems are helpful data science assistants designed to scan data for novel features, select appropriate supervised learning models and optimize their parameters. For this purpose, Tree-based Pipeline Optimization Tool (TPOT) was developed using strongly typed genetic programing (GP) to recommend an optimized analysis pipeline for the data scientist's prediction problem. However, like other AutoML systems, TPOT may reach computational resource limits when working on big data such as whole-genome expression data. Results: We introduce two new features implemented in TPOT that helps increase the system's scalability: Feature Set Selector (FSS) and Template. FSS provides the option to specify subsets of the features as separate datasets, assuming the signals come from one or more of these specific data subsets. FSS increases TPOT's efficiency in application on big data by slicing the entire dataset into smaller sets of features and allowing GP to select the best subset in the final pipeline. Template enforces type constraints with strongly typed GP and enables the incorporation of FSS at the beginning of each pipeline. Consequently, FSS and Template help reduce TPOT computation time and may provide more interpretable results. Our simulations show TPOT-FSS significantly outperforms a tuned XGBoost model and standard TPOT implementation. We apply TPOT-FSS to real RNA-Seq data from a study of major depressive disorder. Independent of the previous study that identified significant association with depression severity of two modules, TPOT-FSS corroborates that one of the modules is largely predictive of the clinical diagnosis of each individual.",
                "authors": [
                    {
                        "name": "Le T.T."
                    },
                    {
                        "name": "Fu W."
                    },
                    {
                        "name": "Moore J.H."
                    }
                ],
                "citationCount": 68,
                "date": "2020-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Scaling tree-based automated machine learning to biomedical big data with a feature set selector"
            },
            "pmcid": "PMC6956793",
            "pmid": "31165141"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Membrane and lipoproteins",
            "uri": "http://edamontology.org/topic_0820"
        }
    ],
    "validated": 1
}