{
    "additionDate": "2019-11-14T19:33:11Z",
    "biotoolsCURIE": "biotools:MCS2",
    "biotoolsID": "MCS2",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leonid@sfu.ca",
            "name": "Leonid Chindelevitch",
            "typeEntity": "Person"
        }
    ],
    "description": "Minimal coordinated supports for fast enumeration of minimal cut sets in metabolic networks | Codes and data of competitive methods for finding minimal cut sets of a metabolic network | Files for the work on metabolic networks with Leonid, Tamon, Cedric, Reza, Hooman, and Nafiseh | You need to have licensed MATLAB before running the scripts | There are implemenations of four approaches for enumerating MCSs here. You can run either of them by running its script followed by model name followed by target reaction followed by 1 or 0 which indicates prior network reduction. -1 stands for all reactions",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                }
            ]
        }
    ],
    "homepage": "https://github.com/RezaMash/MCS",
    "language": [
        "Java",
        "MATLAB",
        "C++"
    ],
    "lastUpdate": "2020-12-23T08:10:21Z",
    "license": "GPL-3.0",
    "name": "MCS2",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ393",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Constraint-based modeling of metabolic networks helps researchers gain insight into the metabolic processes of many organisms, both prokaryotic and eukaryotic. Minimal cut sets (MCSs) are minimal sets of reactions whose inhibition blocks a target reaction in a metabolic network. Most approaches for finding the MCSs in constrained-based models require, either as an intermediate step or as a byproduct of the calculation, the computation of the set of elementary flux modes (EFMs), a convex basis for the valid flux vectors in the network. Recently, Ballerstein et al. proposed a method for computing the MCSs of a network without first computing its EFMs, by creating a dual network whose EFMs are a superset of the MCSs of the original network. However, their dual network is always larger than the original network and depends on the target reaction. Here we propose the construction of a different dual network, which is typically smaller than the original network and is independent of the target reaction, for the same purpose. We prove the correctness of our approach, minimal coordinated support (MCS2), and describe how it can be modified to compute the few smallest MCSs for a given target reaction. Results: We compare MCS2 to the method of Ballerstein et al. and two other existing methods. We show that MCS2 succeeds in calculating the full set of MCSs in many models where other approaches cannot finish within a reasonable amount of time. Thus, in addition to its theoretical novelty, our approach provides a practical advantage over existing methods.",
                "authors": [
                    {
                        "name": "Miraskarshahi R."
                    },
                    {
                        "name": "Zabeti H."
                    },
                    {
                        "name": "Stephen T."
                    },
                    {
                        "name": "Chindelevitch L."
                    }
                ],
                "citationCount": 2,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MCS2: Minimal coordinated supports for fast enumeration of minimal cut sets in metabolic networks"
            },
            "pmcid": "PMC6612898",
            "pmid": "31510702"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ],
    "validated": 1
}