{
    "accessibility": "Open access",
    "additionDate": "2022-08-17T22:32:21.530327Z",
    "biotoolsCURIE": "biotools:reslt",
    "biotoolsID": "reslt",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jiaya Jia"
        },
        {
            "name": "Jiequan Cui"
        },
        {
            "name": "Shu Liu"
        },
        {
            "name": "Zhisheng Zhong"
        },
        {
            "name": "Zhuotao Tian"
        }
    ],
    "description": "Residual Learning for Long-tailed Recognition.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jiequancui/ResLT",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-08-17T22:32:21.533038Z",
    "license": "MIT",
    "name": "ResLT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TPAMI.2022.3174892",
            "metadata": {
                "abstract": "IEEEDeep learning algorithms face great challenges with long-tailed data distribution which, however, is quite a common case in real-world scenarios. Previous methods tackle the problem from either the aspect of input space (re-sampling classes with different frequencies) or loss space (re-weighting classes with different weights), suffering from heavy over-fitting to tail classes or hard optimization during training. To alleviate these issues, we propose a more fundamental perspective for long-tailed recognition, i.e., from the aspect of parameter space, and aims to preserve specific capacity for classes with low frequencies. From this perspective, the trivial solution utilizes different branches for the head, medium, tail classes respectively, and then sums their outputs as the final results is not feasible. Instead, we design the effective residual fusion mechanism -- with one main branch optimized to recognize images from all classes, another two residual branches are gradually fused and optimized to enhance images from medium+tail classes and tail classes respectively. Then the branches are aggregated into final results by additive shortcuts. We test our method on several benchmarks, i.e., long-tailed version of CIFAR-10, CIFAR-100, Places, ImageNet, and iNaturalist 2018. Experimental results manifest the effectiveness of our method. Our code is available at https://github.com/jiequancui/ResLT.",
                "authors": [
                    {
                        "name": "Cui J."
                    },
                    {
                        "name": "Jia J."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Tian Z."
                    },
                    {
                        "name": "Zhong Z."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
                "title": "ResLT: Residual Learning for Long-tailed Recognition"
            },
            "pmid": "35560104"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ],
    "validated": 1
}
