{
    "accessibility": "Open access",
    "additionDate": "2022-09-07T22:13:30.033108Z",
    "biotoolsCURIE": "biotools:kgev",
    "biotoolsID": "kgev",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wangk@chop.edu",
            "name": "Kai Wang",
            "orcidid": "https://orcid.org/0000-0002-5585-982X",
            "typeEntity": "Person"
        },
        {
            "email": "zhouy6@chop.edu",
            "name": "Yunyun Zhou",
            "typeEntity": "Person"
        },
        {
            "name": "David Xu"
        },
        {
            "name": "Jacqueline Peng"
        },
        {
            "name": "Ryan Lee"
        },
        {
            "name": "Siwei Xu"
        }
    ],
    "description": "Expediting knowledge acquisition by a web framework for Knowledge Graph Exploration and Visualization (KGEV).",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/u/genomicslab/kgev-backend"
        },
        {
            "type": "Container file",
            "url": "https://hub.docker.com/u/genomicslab/kgev-frontend"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Relation extraction",
                    "uri": "http://edamontology.org/operation_3625"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/WGLab/kgev-neo4j",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-07T22:13:30.035985Z",
    "license": "Not licensed",
    "name": "KGEV",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/S12911-022-01848-Z",
            "metadata": {
                "abstract": "© 2022, The Author(s).Background: Knowledges graphs (KGs) serve as a convenient framework for structuring knowledge. A number of computational methods have been developed to generate KGs from biomedical literature and use them for downstream tasks such as link prediction and question answering. However, there is a lack of computational tools or web frameworks to support the exploration and visualization of the KG themselves, which would facilitate interactive knowledge discovery and formulation of novel biological hypotheses. Method: We developed a web framework for Knowledge Graph Exploration and Visualization (KGEV), to construct and visualize KGs in five stages: triple extraction, triple filtration, metadata preparation, knowledge integration, and graph database preparation. The application has convenient user interface tools, such as node and edge search and filtering, data source filtering, neighborhood retrieval, and shortest path calculation, that work by querying a backend graph database. Unlike other KGs, our framework allows fast retrieval of relevant texts supporting the relationships in the KG, thus allowing human reviewers to judge the reliability of the knowledge extracted. Results: We demonstrated a case study of using the KGEV framework to perform research on COVID-19. The COVID-19 pandemic resulted in an explosion of relevant literature, making it challenging to make full use of the vast and heterogenous sources of information. We generated a COVID-19 KG with heterogenous information, including literature information from the CORD-19 dataset, as well as other existing knowledge from eight data sources. We showed the utility of KGEV in three intuitive case studies to explore and query knowledge on COVID-19. A demo of this web application can be accessed at http://covid19nlp.wglab.org. Finally, we also demonstrated a turn-key adaption of the KGEV framework to study clinical phenotypic presentation of human diseases by Human Phenotype Ontology (HPO), illustrating the versatility of the framework. Conclusion: In an era of literature explosion, the KGEV framework can be applied to many emerging diseases to support structured navigation of the vast amount of newly published biomedical literature and other existing biological knowledge in various databases. It can be also used as a general-purpose tool to explore and query gene-phenotype-disease-drug relationships interactively.",
                "authors": [
                    {
                        "name": "Lee R."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Wang K."
                    },
                    {
                        "name": "Xu D."
                    },
                    {
                        "name": "Xu S."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "Expediting knowledge acquisition by a web framework for Knowledge Graph Exploration and Visualization (KGEV): case studies on COVID-19 and Human Phenotype Ontology"
            },
            "pmcid": "PMC9161770",
            "pmid": "35655307"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Data mining",
            "uri": "http://edamontology.org/topic_3473"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        }
    ]
}
