{
    "name": "Gen3D", 
    "description": "Application designed to determine three-dimensional genome and chromosome models. It uses chromosomal contact data to construct three-dimensional conformations.", 
    "homepage": "http://sourceforge.net/projects/gen3d/", 
    "biotoolsID": "gen3d", 
    "biotoolsCURIE": "biotools:gen3d", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3208", 
                    "term": "Genome visualisation"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_0092", 
            "term": "Data visualisation"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_3053", 
            "term": "Genetics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/gen3d-3d-genome-and-chromosome-structural-model-construction.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://sourceforge.net/projects/gen3d/", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "26493399", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Iterative reconstruction of three-dimensional models of human chromosomes from chromosomal contact data", 
                "abstract": "© 2015 Nowotny et al. Background: The entire collection of genetic information resides within the chromosomes, which themselves reside within almost every cell nucleus of eukaryotic organisms. Each individual chromosome is found to have its own preferred three-dimensional (3D) structure independent of the other chromosomes. The structure of each chromosome plays vital roles in controlling certain genome operations, including gene interaction and gene regulation. As a result, knowing the structure of chromosomes assists in the understanding of how the genome functions. Fortunately, the 3D structure of chromosomes proves possible to construct through computational methods via contact data recorded from the chromosome. We developed a unique computational approach based on optimization procedures known as adaptation, simulated annealing, and genetic algorithm to construct 3D models of human chromosomes, using chromosomal contact data. Results: Our models were evaluated using a percentage-based scoring function. Analysis of the scores of the final 3D models demonstrated their effective construction from our computational approach. Specifically, the models resulting from our approach yielded an average score of 80.41 %, with a high of 91 %, across models for all chromosomes of a normal human B-cell. Comparisons made with other methods affirmed the effectiveness of our strategy. Particularly, juxtaposition with models generated through the publicly available method Markov chain Monte Carlo 5C (MCMC5C) illustrated the outperformance of our approach, as seen through a higher average score for all chromosomes. Our methodology was further validated using two consistency checking techniques known as convergence testing and robustness checking, which both proved successful. Conclusions: The pursuit of constructing accurate 3D chromosomal structures is fueled by the benefits revealed by the findings as well as any possible future areas of study that arise. This motivation has led to the development of our computational methodology. The implementation of our approach proved effective in constructing 3D chromosome models and proved consistent with, and more effective than, some other methods thereby achieving our goal of creating a tool to help advance certain research efforts. The source code, test data, test results, and documentation of our method, Gen3D, are available at our sourceforge site at: http://sourceforge.net/projects/gen3d/.", 
                "date": "2015-10-23T00:00:00Z", 
                "citationCount": 4, 
                "authors": [
                    {
                        "name": "Nowotny J."
                    }, 
                    {
                        "name": "Ahmed S."
                    }, 
                    {
                        "name": "Xu L."
                    }, 
                    {
                        "name": "Oluwadare O."
                    }, 
                    {
                        "name": "Chen H."
                    }, 
                    {
                        "name": "Hensley N."
                    }, 
                    {
                        "name": "Trieu T."
                    }, 
                    {
                        "name": "Cao R."
                    }, 
                    {
                        "name": "Cheng J."
                    }
                ], 
                "journal": "BMC Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "chengji@missouri.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:44:59Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}