{"credit":[{"email":"aschaffe@helix.nih.gov","name":"Alejandro A Schäffer","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/aaschaffer/vecscreen_plus_taxonomy"}],"function":[{"operation":[{"term":"Sequencing quality control","uri":"http://edamontology.org/operation_3218"}]}],"labels":{"language":["Perl"],"operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Taxonomy","uri":"http://edamontology.org/topic_0637"},{"term":"Data quality management","uri":"http://edamontology.org/topic_3572"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Data acquisition","uri":"http://edamontology.org/topic_3077"}]},"publication":[{"abstract":"© Published by Oxford University Press 2017. Motivation Nucleic acid sequences in public databases should not contain vector contamination, but many sequences in GenBank do (or did) contain vectors. The National Center for Biotechnology Information uses the program VecScreen to screen submitted sequences for contamination. Additional tools are needed to distinguish true-positive (contamination) from false-positive (not contamination) VecScreen matches. Results A principal reason for false-positive VecScreen matches is that the sequence and the matching vector subsequence originate from closely related or identical organisms (for example, both originate in Escherichia coli). We collected information on the taxonomy of sources of vector segments in the UniVec database used by VecScreen. We used that information in two overlapping software pipelines for retrospective analysis of contamination in GenBank and for prospective analysis of contamination in new sequence submissions. Using the retrospective pipeline, we identified and corrected over 8000 contaminated sequences in the nonredundant nucleotide database. The prospective analysis pipeline has been in production use since April 2017 to evaluate some new GenBank submissions.","authors":["Schaffer A.A.","Nawrocki E.P.","Choi Y.","Kitts P.A.","Karsch-Mizrachi I.","McVeigh R."],"cit_count":1,"doi":"10.1093/bioinformatics/btx669","journal":"Bioinformatics","title":"VecScreen-plus-taxonomy: Imposing a tax(onomy) increase on vector contamination screening","year":"2018-03-01"}],"summary":{"biotoolsCURIE":"biotools:vecscreen_plus_taxonomy","biotoolsID":"vecscreen_plus_taxonomy","description":"Run vecscreen and interpret and annotate output matches taking taxonomy into account.","homepage":"https://github.com/aaschaffer/vecscreen_plus_taxonomy","name":"VecScreen_plus_taxonomy"}}