{
    "additionDate": "2021-01-18T11:47:04Z",
    "biotoolsCURIE": "biotools:pager-cov",
    "biotoolsID": "pager-cov",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jakechen@uab.edu",
            "name": "Jake Y Chen",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive collection of pathways, annotated gene-lists and gene signatures for coronavirus disease studies.\n\nA Pathways, Annotated-lists and Gene signatures Electronic Repository Related to Coronavirus Related Diseases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://discovery.informatics.uab.edu/PAGER-CoV/",
    "lastUpdate": "2021-03-15T14:37:33Z",
    "name": "PAGER-CoV",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA1094",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited.PAGER-CoV (http://discovery.informatics.uab.edu/PAGER-CoV/) is a new web-based database that can help biomedical researchers interpret coronavirus-related functional genomic study results in the context of curated knowledge of host viral infection, inflammatory response, organ damage, and tissue repair. The new database consists of 11 835 PAGs (Pathways, Annotated gene-lists, or Gene signatures) from 33 public data sources. Through the web user interface, users can search by a query gene or a query term and retrieve significantly matched PAGs with all the curated information. Users can navigate from a PAG of interest to other related PAGs through either shared PAG-to-PAG co-membership relationships or PAG-to-PAG regulatory relationships, totaling 19 996 993. Users can also retrieve enriched PAGs from an input list of COVID-19 functional study result genes, customize the search data sources, and export all results for subsequent offline data analysis. In a case study, we performed a gene set enrichment analysis (GSEA) of a COVID-19 RNA-seq data set from the Gene Expression Omnibus database. Compared with the results using the standard PAGER database, PAGER-CoV allows for more sensitive matching of known immune-related gene signatures. We expect PAGER-CoV to be invaluable for biomedical researchers to find molecular biology mechanisms and tailored therapeutics to treat COVID-19 patients.",
                "authors": [
                    {
                        "name": "Yue Z."
                    },
                    {
                        "name": "Zhang E."
                    },
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Khurana S."
                    },
                    {
                        "name": "Batra N."
                    },
                    {
                        "name": "Dang S.D.H."
                    },
                    {
                        "name": "Cimino J.J."
                    },
                    {
                        "name": "Chen J.Y."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PAGER-CoV: A comprehensive collection of pathways, annotated gene-lists and gene signatures for coronavirus disease studies"
            },
            "pmid": "33245774"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Experimental design and studies",
            "uri": "http://edamontology.org/topic_3678"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}