{
    "accessibility": [],
    "additionDate": "2017-08-03T18:49:19Z",
    "biotoolsCURIE": "biotools:metainter",
    "biotoolsID": "metainter",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": null,
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://metainter.meb.uni-bonn.de/Contact.html"
        }
    ],
    "description": "Tool to perform meta-analysis of summary statistics obtained from a series of related studies. The special feature of it is the ability to meta-analyze the results of multiple linear and logistic regression models, broadly used in genome-wide association studies (GWAS).",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://metainter.meb.uni-bonn.de/METAINTER_Manual.html#Abschnitt3_2"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://metainter.meb.uni-bonn.de/",
    "homepage_status": 0,
    "language": [
        "C++",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/metainter-20140505-meta-analysis-for-genome-wide-interaction-analysis.html"
        }
    ],
    "maturity": null,
    "name": "METAINTER",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "© The Author 2014. Published by Oxford University Press. All rights reserved. Motivation: Meta-Analysis of summary statistics is an essential approach to guarantee the success of genome-wide association studies (GWAS). Application of the fixed or random effects model to single-marker association tests is a standard practice. More complex methods of meta-Analysis involving multiple parameters have not been used frequently, a gap that could be explained by the lack of a respective meta-Analysis pipeline. Meta-Analysis based on combining p-values can be applied to any association test. However, to be powerful, meta-Analysis methods for high-dimensional models should incorporate additional information such as study-specific properties of parameter estimates, their effect directions, standard errors and covariance structure. Results: We modified 'method for the synthesis of linear regression slopes' recently proposed in the educational sciences to the case of multiple logistic regression, and implemented it in a meta-Analysis tool called METAINTER. The software handles models with an arbitrary number of parameters, andcan directly be applied to analyze the results of single-SNP tests, global haplotype tests, tests for and under gene-gene or gene-environment interaction. Via simulations for two-single nucleotide polymorphisms (SNP) models we have shown that the proposed meta-Analysis method has correct type I error rate. Moreover, power estimates come close to that of the joint analysis of the entire sample. We conducted a real data analysis of six GWAS of type 2 diabetes, available from dbGaP (http://www.ncbi.nlm.nih.gov/gap). For each study, a genome-wide interaction analysis of all SNP pairs was performed by logistic regression tests. The results were then metaanalyzed with METAINTER.",
                "authors": [
                    {
                        "name": "Vaitsiakhovich T."
                    },
                    {
                        "name": "Drichel D."
                    },
                    {
                        "name": "Herold C."
                    },
                    {
                        "name": "Lacour A."
                    },
                    {
                        "name": "Becker T."
                    }
                ],
                "citationCount": 2,
                "date": "2015-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "METAINTER: Meta-Analysis of multiple regression models in genome-wide association studies"
            },
            "note": null,
            "pmcid": null,
            "pmid": "25252781",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        }
    ],
    "validated": 1,
    "version": []
}