{
    "additionDate": "2021-01-18T07:29:06Z",
    "biotoolsCURIE": "biotools:xpressyourself",
    "biotoolsID": "xpressyourself",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jordan.berg@biochem.utah.edu",
            "name": "Jordan A. Berg",
            "orcidid": "https://orcid.org/0000-0002-5096-0558",
            "typeEntity": "Person"
        },
        {
            "email": "rutter@biochem.utah.edu",
            "name": "Jared Rutter",
            "typeEntity": "Person"
        }
    ],
    "description": "Enhancing, standardizing, and automating ribosome profiling computational analyses yields improved insight into data.\n\nAn alignment and analysis pipeline for Ribosome Profiling and RNA-seq data.\n\nrna-seq pipeline genomics profiling riboseq ribosome.\n\nA toolkit for navigating and analyzing gene expression datasets.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://github.com/XPRESSyourself",
    "lastUpdate": "2021-03-18T11:38:58Z",
    "license": "GPL-3.0",
    "name": "XPRESSyourself",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1007625",
            "metadata": {
                "abstract": "Copyright: © 2020 Berg et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Ribosome profiling, an application of nucleic acid sequencing for monitoring ribosome activity, has revolutionized our understanding of protein translation dynamics. This technique has been available for a decade, yet the current state and standardization of publicly available computational tools for these data is bleak. We introduce XPRESSyourself, an analytical toolkit that eliminates barriers and bottlenecks associated with this specialized data type by filling gaps in the computational toolset for both experts and non-experts of ribosome profiling. XPRESSyourself automates and standardizes analysis procedures, decreasing time-to-discovery and increasing reproducibility. This toolkit acts as a reference implementation of current best practices in ribosome profiling analysis. We demonstrate this toolkit’s performance on publicly available ribosome profiling data by rapidly identifying hypothetical mechanisms related to neurodegenerative phenotypes and neuroprotective mechanisms of the small-molecule ISRIB during acute cellular stress. XPRESSyourself brings robust, rapid analysis of ribosome-profiling data to a broad and ever-expanding audience and will lead to more reproducible and accessible measurements of translation regulation. XPRESSyourself software is perpetually open-source under the GPL-3.0 license and is hosted at https://github.com/XPRESSyourself, where users can access additional documentation and report software issues.",
                "authors": [
                    {
                        "name": "Berg J.A."
                    },
                    {
                        "name": "Belyeu J.R."
                    },
                    {
                        "name": "Morgan J.T."
                    },
                    {
                        "name": "Ouyang Y."
                    },
                    {
                        "name": "Bott A.J."
                    },
                    {
                        "name": "Quinlan A.R."
                    },
                    {
                        "name": "Gertz J."
                    },
                    {
                        "name": "Rutter J."
                    }
                ],
                "citationCount": 2,
                "date": "2020-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Xpressyourself: Enhancing, standardizing, and automating ribosome profiling computational analyses yields improved insight into data"
            },
            "pmcid": "PMC7015430",
            "pmid": "32004313"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ]
}