{
    "additionDate": "2020-01-14T19:55:03Z",
    "biotoolsCURIE": "biotools:SigUNet",
    "biotoolsID": "SigUNet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "darby@mail.ncku.edu.tw",
            "name": "Darby Tien-Hao Chang",
            "typeEntity": "Person"
        }
    ],
    "description": "signal peptide recognition based on semantic segmentation.\n\nA signal peptide predictor based on deep learning.\n\nFor CPU: pip3 install -r requirement.cpu.txt.\n\nFor GPU (suggest): pip3 install -r requirement.gpu.txt",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein signal peptide detection",
                    "uri": "http://edamontology.org/operation_0418"
                },
                {
                    "term": "Pathway or network comparison",
                    "uri": "http://edamontology.org/operation_0277"
                },
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                }
            ]
        }
    ],
    "homepage": "https://github.com/mbilab/SigUNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-20T14:37:13Z",
    "name": "SigUNet",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3245-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Signal peptides play an important role in protein sorting, which is the mechanism whereby proteins are transported to their destination. Recognition of signal peptides is an important first step in determining the active locations and functions of proteins. Many computational methods have been proposed to facilitate signal peptide recognition. In recent years, the development of deep learning methods has seen significant advances in many research fields. However, most existing models for signal peptide recognition use one-hidden-layer neural networks or hidden Markov models, which are relatively simple in comparison with the deep neural networks that are used in other fields. Results: This study proposes a convolutional neural network without fully connected layers, which is an important network improvement in computer vision. The proposed network is more complex in comparison with current signal peptide predictors. The experimental results show that the proposed network outperforms current signal peptide predictors on eukaryotic data. This study also demonstrates how model reduction and data augmentation helps the proposed network to predict bacterial data. Conclusions: The study makes three contributions to this subject: (a) an accurate signal peptide recognizer is developed, (b) the potential to leverage advanced networks from other fields is demonstrated and (c) important modifications are proposed while adopting complex networks on signal peptide recognition.",
                "authors": [
                    {
                        "name": "Wu J.-M."
                    },
                    {
                        "name": "Liu Y.-C."
                    },
                    {
                        "name": "Chang D.T.-H."
                    }
                ],
                "citationCount": 4,
                "date": "2019-12-20T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "SigUNet: Signal peptide recognition based on semantic segmentation"
            },
            "pmcid": "PMC6923836",
            "pmid": "31861981"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Protein sites, features and motifs",
            "uri": "http://edamontology.org/topic_3510"
        },
        {
            "term": "Protein targeting and localisation",
            "uri": "http://edamontology.org/topic_0140"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        }
    ],
    "validated": 1
}