{
    "additionDate": "2019-11-14T18:09:36Z",
    "biotoolsCURIE": "biotools:SimpleDSFviewer",
    "biotoolsID": "SimpleDSFviewer",
    "confidence_flag": "high",
    "description": "A tool to analyze and view differential scanning fluorimetry data for characterizing protein thermal stability and interactions | Differential scanning fluorimetry (DSF) is a widely used thermal shift assay for measuring protein stability and protein-ligand interactions that are simple, cheap, and amenable to high throughput. However, data analysis remains a challenge, requiring improved methods. Here, the program SimpleDSFviewer, a user-friendly interface, is described to help the researchers who apply DSF technique in their studies. SimpleDSFviewer integrates melting curve (MC) normalization, smoothing, and melting temperature (Tm) analysis and directly previews analyzed data, providing an efficient analysis tool for DSF. SimpleDSFviewer is developed in Matlab, and it is freely available for all users to use in Matlab workspace or with Matlab Runtime. It is easy to use and an efficient tool for researchers to preview and analyze their data in a very short time",
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/hscsun/SimpleDSFviewer-5.0.git",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2019-11-14T18:09:36Z",
    "name": "SimpleDSFviewer",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1002/PRO.3703",
            "metadata": {
                "abstract": "© 2019 The Protein SocietyDifferential scanning fluorimetry (DSF) is a widely used thermal shift assay for measuring protein stability and protein–ligand interactions that are simple, cheap, and amenable to high throughput. However, data analysis remains a challenge, requiring improved methods. Here, the program SimpleDSFviewer, a user-friendly interface, is described to help the researchers who apply DSF technique in their studies. SimpleDSFviewer integrates melting curve (MC) normalization, smoothing, and melting temperature (Tm) analysis and directly previews analyzed data, providing an efficient analysis tool for DSF. SimpleDSFviewer is developed in Matlab, and it is freely available for all users to use in Matlab workspace or with Matlab Runtime. It is easy to use and an efficient tool for researchers to preview and analyze their data in a very short time.",
                "authors": [
                    {
                        "name": "Sun C."
                    },
                    {
                        "name": "Li Y."
                    },
                    {
                        "name": "Yates E.A."
                    },
                    {
                        "name": "Fernig D.G."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Protein Science",
                "title": "SimpleDSFviewer: A tool to analyze and view differential scanning fluorimetry data for characterizing protein thermal stability and interactions"
            },
            "pmid": "31394001"
        }
    ],
    "topic": [
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}