{
    "name": "OSSE", 
    "description": "Open Source Registry System for Rare Diseases (OSSE) - software for the creation of patient registries. Necessary interoperability between different registries is supported from the start and allows to federate those registries on a national and international level.", 
    "homepage": "https://www.osse-register.de/en/", 
    "biotoolsID": "Open_Source_Registry_System_for_Rare_Diseases_OSSE", 
    "biotoolsCURIE": "biotools:Open_Source_Registry_System_for_Rare_Diseases_OSSE", 
    "version": [
        "1.4"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2422", 
                    "term": "Data retrieval"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3325", 
            "term": "Rare diseases"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [], 
    "license": "CC-BY-4.0", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "https://bitbucket.org/medinfo_mainz/samply.edc.osse/downloads/", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }, 
        {
            "url": "https://www.osse-register.de/en/downloads/", 
            "type": "Downloads page", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "https://download.osse-register.de/Getting_started_v1_2.pdf", 
            "type": "Manual", 
            "note": null
        }, 
        {
            "url": "https://bitbucket.org/medinfo_mainz/samply.edc.osse/wiki/Home", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1007/s00103-017-2536-7", 
            "pmid": "28289778", 
            "pmcid": null, 
            "type": "Primary", 
            "version": "1.4", 
            "metadata": {
                "title": "Registries for rare diseases: OSSE – An open-source framework for technical implementation Register für seltene Erkrankungen: OSSE – ein Open-Source-Framework für die technische Umsetzung", 
                "abstract": "© 2017, Springer-Verlag Berlin Heidelberg. Meager amounts of data stored locally, a small number of experts, and a broad spectrum of technological solutions incompatible with each other characterize the landscape of registries for rare diseases in Germany. Hence, the free software Open Source Registry for Rare Diseases (OSSE) was created to unify and streamline the process of establishing specific rare disease patient registries. The data to be collected is specified based on metadata descriptions within the registry framework’s so-called metadata repository (MDR), which was developed according to the ISO/IEC 11179 standard. The use of a central MDR allows for sharing the same data elements across any number of registries, thus providing a technical prerequisite for making data comparable and mergeable between registries and promoting interoperability. With OSSE, the foundation is laid to operate linked patient registries while respecting strong data protection regulations. Using the federated search feature, data for clinical studies can be identified across registries. Data integrity, however, remains intact since no actual data leaves the premises without the owner’s consent. Additionally, registry solutions other than OSSE can participate via the OSSE bridgehead, which acts as a translator between OSSE registry networks and non-OSSE registries. The pseudonymization service Mainzelliste adds further data protection. Currently, more than 10 installations are under construction in clinical environments (including university hospitals in Frankfurt, Hamburg, Freiburg and Münster). The feedback given by the users will influence further development of OSSE. As an example, the installation process of the registry for undiagnosed patients at University Hospital Frankfurt is described in more detail.", 
                "date": "2017-05-01T00:00:00Z", 
                "citationCount": 0, 
                "authors": [
                    {
                        "name": "Storf H."
                    }, 
                    {
                        "name": "Schaaf J."
                    }, 
                    {
                        "name": "Kadioglu D."
                    }, 
                    {
                        "name": "Gobel J."
                    }, 
                    {
                        "name": "Wagner T.O.F."
                    }, 
                    {
                        "name": "Uckert F."
                    }
                ], 
                "journal": "Bundesgesundheitsblatt - Gesundheitsforschung - Gesundheitsschutz"
            }
        }
    ], 
    "credit": [
        {
            "name": "Holger Storf", 
            "email": "info@osse-register.de", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "Ruta", 
    "additionDate": "2019-05-10T07:29:18Z", 
    "lastUpdate": "2019-06-16T20:10:29Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}