{
    "additionDate": "2019-11-14T19:50:08Z",
    "biotoolsCURIE": "biotools:IMPLEMENTATIONGPA",
    "biotoolsID": "IMPLEMENTATIONGPA",
    "confidence_flag": "high",
    "credit": [
        {
            "name": "André Hennig",
            "typeEntity": "Person"
        },
        {
            "email": "kay.nieselt@uni-tuebingen.de",
            "name": "Kay Nieselt",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'GPA' (bio.tools/gpa), 'progressiveMauve' | Efficient merging of genome profile alignments | André Hennig authored Jul 17, 2019",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence profile alignment",
                    "uri": "http://edamontology.org/operation_0300"
                },
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                },
                {
                    "term": "Genome alignment",
                    "uri": "http://edamontology.org/operation_3182"
                }
            ]
        }
    ],
    "homepage": "https://lambda.informatik.uni-tuebingen.de/gitlab/ahennig/GPA",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-11-14T19:50:08Z",
    "name": "IMPLEMENTATION:GPA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ377",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: Whole-genome alignment (WGA) methods show insufficient scalability toward the generation of large-scale WGAs. Profile alignment-based approaches revolutionized the fields of multiple sequence alignment construction methods by significantly reducing computational complexity and runtime. However, WGAs need to consider genomic rearrangements between genomes, which make the profile-based extension of several whole-genomes challenging. Currently, none of the available methods offer the possibility to align or extend WGA profiles. Results: Here, we present genome profile alignment, an approach that aligns the profiles of WGAs and that is capable of producing large-scale WGAs many times faster than conventional methods. Our concept relies on already available whole-genome aligners, which are used to compute several smaller sets of aligned genomes that are combined to a full WGA with a divide and conquer approach. To align or extend WGA profiles, we make use of the SuperGenome data structure, which features a bidirectional mapping between individual sequence and alignment coordinates. This data structure is used to efficiently transfer different coordinate systems into a common one based on the principles of profiles alignments. The approach allows the computation of a WGA where alignments are subsequently merged along a guide tree. The current implementation uses progressiveMauve and offers the possibility for parallel computation of independent genome alignments. Our results based on various bacterial datasets up to several hundred genomes show that we can reduce the runtime from months to hours with a quality that is negligibly worse than the WGA computed with the conventional progressiveMauve tool.",
                "authors": [
                    {
                        "name": "Hennig A."
                    },
                    {
                        "name": "Nieselt K."
                    }
                ],
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Efficient merging of genome profile alignments"
            },
            "pmcid": "PMC6612806",
            "pmid": "31510683"
        }
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}