{"credit":[{"email":"qij@fudan.edu.cn","name":"Ji Qi","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"zhfq@mail.biols.ac.cn","name":"Fangqing Zhao","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://ingap.sourceforge.net/"}],"function":[{"operation":[{"term":"ID mapping","uri":"http://edamontology.org/operation_3282"},{"term":"Mapping","uri":"http://edamontology.org/operation_2429"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Mapping","uri":"http://edamontology.org/topic_0102"},{"term":"DNA structural variation","uri":"http://edamontology.org/topic_3175"},{"term":"Genetic variation","uri":"http://edamontology.org/topic_0199"},{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"DNA","uri":"http://edamontology.org/topic_0654"}]},"publication":[{"abstract":"Mining genetic variation from personal genomes is a crucial step towards investigating the relationship between genotype and phenotype. However, compared to the detection of SNPs and small indels, characterizing large and particularly complex structural variation is much more difficult and less intuitive. In this article, we present a new scheme (inGAP-sv) to detect and visualize structural variation from paired-end mapping data. Under this scheme, abnormally mapped read pairs are clustered based on the location of a gap signature. Several important features, including local depth of coverage, mapping quality and associated tandem repeat, are used to evaluate the quality of predicted structural variation. Compared with other approaches, it can detect many more large insertions and complex variants with lower false discovery rate. Moreover, inGAP-sv, written in Java programming language, provides a user-friendly interface and can be performed in multiple operating systems. It can be freely accessed at http://ingap.sourceforge.net/. © 2011 The Author(s).","authors":["Qi J.","Zhao F."],"cit_count":48,"journal":"Nucleic Acids Research","pmid":"21715388","title":"InGAP-sv: A novel scheme to identify and visualize structural variation from paired end mapping data","year":"2011-07-01"}],"summary":{"biotoolsCURIE":"biotools:ingap-sv","biotoolsID":"ingap-sv","description":"inGAP-sv is a web server to identify and visualize structural variation from paired end mapping data. Several important features including local depth of coverage, mapping quality and associated tandem repeats are used to evaluate the quality of the predicted structural variation.","homepage":"http://ingap.sourceforge.net","name":"inGAP-sv"}}