
{
    "credit": [
        {
            "email": "jiangning.song@monash.edu",
            "name": "Jiangning Song",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "trevor.lithgow@monash.edu",
            "name": "Trevor Lithgow",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://bastion6.erc.monash.edu/help.jsp"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Cell biology",
                "uri": "http://edamontology.org/topic_2229"
            },
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Microbiology",
                "uri": "http://edamontology.org/topic_3301"
            },
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author(s) 2018. Published by Oxford University Press. All rights reserved.Motivation: Many Gram-negative bacteria use type VI secretion systems (T6SS) to export effector proteins into adjacent target cells. These secreted effectors (T6SEs) play vital roles in the competitive survival in bacterial populations, as well as pathogenesis of bacteria. Although various computational analyses have been previously applied to identify effectors secreted by certain bacterial species, there is no universal method available to accurately predict T6SS effector proteins from the growing tide of bacterial genome sequence data. Results: We extracted a wide range of features from T6SE protein sequences and comprehensively analyzed the prediction performance of these features through unsupervised and supervised learning. By integrating these features, we subsequently developed a two-layer SVM-based ensemble model with fine-grain optimized parameters, to identify potential T6SEs. We further validated the predictive model using an independent dataset, which showed that the proposed model achieved an impressive performance in terms of ACC (0.943), F-value (0.946), MCC (0.892) and AUC (0.976). To demonstrate applicability, we employed this method to correctly identify two very recently validated T6SE proteins, which represent challenging prediction targets because they significantly differed from previously known T6SEs in terms of their sequence similarity and cellular function. Furthermore, a genome-wide prediction across 12 bacterial species, involving in total 54 212 protein sequences, was carried out to distinguish 94 putative T6SE candidates. We envisage both this information and our publicly accessible web server will facilitate future discoveries of novel T6SEs.",
            "authors": [
                "Jiaweiwang J.",
                "Yang B.",
                "Leier A.",
                "Marquez-Lago T.T.",
                "Hayashida M.",
                "Rocker A.",
                "Zhang Y.",
                "Akutsu T.",
                "Chou K.-C.",
                "Strugnell R.A.",
                "Song J.",
                "Lithgow T."
            ],
            "cit_count": 12,
            "doi": "10.1093/bioinformatics/bty155",
            "journal": "Bioinformatics",
            "title": "Bastion6: A bioinformatics approach for accurate prediction of type VI secreted effectors",
            "year": "2018-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bastion6",
        "biotoolsID": "bastion6",
        "description": "Bioinformatics approach for accurate prediction of type VI secreted effectors.",
        "homepage": "http://bastion6.erc.monash.edu/",
        "name": "Bastion6"
    }
}