{
    "additionDate": "2018-10-14T20:08:07Z",
    "biotoolsCURIE": "biotools:spotpy",
    "biotoolsID": "spotpy",
    "credit": [
        {
            "email": "tobias.houska@umwelt.uni-giessen.de",
            "name": "Tobias Houska",
            "orcidid": "http://orcid.org/0000-0001-7780-2376",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "SPOTPY (Statistical Parameter Optimization Tool) is an open source python package containing a comprehensive set of methods typically used to calibrate, analyze and optimize parameters for a wide range of ecological models.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://fb09-pasig.umwelt.uni-giessen.de/spotpy/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Optimisation and refinement",
                    "uri": "http://edamontology.org/operation_2425"
                }
            ]
        }
    ],
    "homepage": "https://pypi.org/project/spotpy/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2019-01-13T00:21:59Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/thouska/spotpy"
        },
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/thouska/spotpy/issues"
        }
    ],
    "name": "SPOTPY",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0145180",
            "metadata": {
                "abstract": "© 2015 Houska et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The choice for specific parameter estimation methods is often more dependent on its availability than its performance. We developed SPOTPY (Statistical Parameter Optimization Tool), an open source python package containing a comprehensive set of methods typically used to calibrate, analyze and optimize parameters for a wide range of ecological models. SPOTPY currently contains eight widely used algorithms, 11 objective functions, and can sample from eight parameter distributions. SPOTPY has a model-independent structure and can be run in parallel from the workstation to large computation clusters using the Message Passing Interface (MPI). We tested SPOTPY in five different case studies to parameterize the Rosenbrock, Griewank and Ackley functions, a one-dimensional physically based soil moisture routine, where we searched for parameters of the van Genuchten-Mualem function and a calibration of a biogeochemistry model with different objective functions. The case studies reveal that the implemented SPOTPY methods can be used for any model with just a minimal amount of code for maximal power of parameter optimization. They further show the benefit of having one package at hand that includes number of well performing parameter search methods, since not every case study can be solved sufficiently with every algorithm or every objective function.",
                "authors": [
                    {
                        "name": "Houska T."
                    },
                    {
                        "name": "Kraft P."
                    },
                    {
                        "name": "Chamorro-Chavez A."
                    },
                    {
                        "name": "Breuer L."
                    }
                ],
                "citationCount": 44,
                "date": "2015-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "SPOTting model parameters using a ready-made python package"
            },
            "pmcid": "PMC4682995",
            "pmid": "26680783",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Ecology",
            "uri": "http://edamontology.org/topic_0610"
        },
        {
            "term": "Applied mathematics",
            "uri": "http://edamontology.org/topic_3569"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}