{
    "additionDate": "2023-01-28T13:24:29.911740Z",
    "biotoolsCURIE": "biotools:flowuti",
    "biotoolsID": "flowuti",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "gmartin-ibis@us.es",
            "name": "Guillermo Martín-Gutiérrez ,",
            "typeEntity": "Person"
        }
    ],
    "description": "An interactive web-application for optimizing the use of flow cytometry as a screening tool in urinary tract infections.",
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/GuillermoMG-HUVR/Microbiology-applications/tree/FlowUTI/FlowUTI"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://covidiario.shinyapps.io/flowuti/",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:07:23.536582Z",
    "license": "Not licensed",
    "name": "FlowUTI",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/journal.pone.0277340",
            "metadata": {
                "abstract": "Due to the high prevalence of patients attending with urinary tract infection (UTI) symptoms, the use of flow-cytometry as a rapid screening tool to avoid unnecessary cultures is becoming a widely used system in clinical practice. However, the recommended cut-points applied in flow-cytometry systems differ substantially among authors, making it difficult to obtain reliable conclusions. Here, we present FlowUTI, a shiny web-application created to establish optimal cut-off values in flow-cytometry for different UTI markers, such as bacterial or leukocyte counts, in urine from patients with UTI symptoms. This application provides a user-friendly graphical interface to perform robust statistical analysis without a specific training. Two datasets are analyzed in this manuscript: one composed of 204 urine samples from neonates and infants (≤3 months old) attended in the emergency department with suspected UTI; and the second dataset including 1174 urines samples from an elderly population attended at the primary care level. The source code is available on GitHub (https://github.com/GuillermoMG-HUVR/Microbiology-applications/tree/FlowUTI/FlowUTI). The web application can be executed locally from the R console. Alternatively, it can be freely accessed at https://covidiario.shinyapps.io/flowuti/. FlowUTI provides an easy-to-use environment for evaluating the efficiency of the urinary screening process with flow-cytometry, reducing the computational burden associated with this kind of analysis.",
                "authors": [
                    {
                        "name": "Lepe J.A."
                    },
                    {
                        "name": "Martin-Gutierrez G."
                    },
                    {
                        "name": "Martin-Perez C."
                    },
                    {
                        "name": "Sanchez-Cantalejo E."
                    },
                    {
                        "name": "Toledo H."
                    }
                ],
                "citationCount": 3,
                "date": "2022-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "FlowUTI: An interactive web-application for optimizing the use of flow cytometry as a screening tool in urinary tract infections"
            },
            "pmcid": "PMC9642874",
            "pmid": "36346782"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Cytometry",
            "uri": "http://edamontology.org/topic_3934"
        },
        {
            "term": "Geriatric medicine",
            "uri": "http://edamontology.org/topic_3399"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ]
}
