{
    "additionDate": "2018-07-14T08:44:06Z",
    "biotoolsCURIE": "biotools:cnvcaller",
    "biotoolsID": "cnvcaller",
    "credit": [
        {
            "email": "yu.jiang@nwafu.edu.cn",
            "name": "Yu Jiang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Program for detecting the integrated copy number veriation regions (CNVRs) using population sequencing data. The high-confidence CNVRs are discovered and refined by both individual and population criteria. The result is a VCF format genotype file which can be used in GWAS/QLT research.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://animal.nwsuaf.edu.cn/code/index.php/main/loadByGet?address%5b%5d=main/html/software.php&id=home"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Copy number estimation",
                    "uri": "http://edamontology.org/operation_3233"
                },
                {
                    "term": "Genetic variation analysis",
                    "uri": "http://edamontology.org/operation_3197"
                }
            ]
        }
    ],
    "homepage": "http://animal.nwsuaf.edu.cn/code/index.php/main/loadByGet?address%5b%5d=main/html/software.php&id=home",
    "language": [
        "Perl",
        "Python"
    ],
    "lastUpdate": "2018-12-11T17:10:14Z",
    "license": "GPL-3.0",
    "name": "CNVcaller",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/gix115",
            "metadata": {
                "abstract": "© The Author(s) 2017. Background: The increasing amount of sequencing data available for a wide variety of species can be theoretically used for detecting copy number variations (CNVs) at the population level. However, the growing sample sizes and the divergent complexity of nonhuman genomes challenge the efficiency and robustness of current human-oriented CNV detection methods. Results: Here, we present CNVcaller, a read-depth method for discovering CNVs in population sequencing data. The computational speed of CNVcaller was 1-2 orders of magnitude faster than CNVnator and Genome STRiP for complex genomes with thousands of unmapped scaffolds. CNV detection of 232 goats required only 1.4 days on a single compute node. Additionally, the Mendelian consistency of sheep trios indicated that CNVcaller mitigated the influence of high proportions of gaps and misassembled duplications in the nonhuman reference genome assembly. Furthermore, multiple evaluations using real sheep and human data indicated that CNVcaller achieved the best accuracy and sensitivity for detecting duplications. Conclusions: The fast generalized detection algorithms included in CNVcaller overcome prior computational barriers for detecting CNVs in large-scale sequencing data with complex genomic structures. Therefore, CNVcaller promotes population genetic analyses of functional CNVs in more species.",
                "authors": [
                    {
                        "name": "Wang X."
                    },
                    {
                        "name": "Zheng Z."
                    },
                    {
                        "name": "Cai Y."
                    },
                    {
                        "name": "Chen T."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Fu W."
                    },
                    {
                        "name": "Jiang Y."
                    }
                ],
                "citationCount": 3,
                "date": "2017-12-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "CNVcaller: Highly efficient and widely applicable software for detecting copy number variations in large populations"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA structural variation",
            "uri": "http://edamontology.org/topic_3175"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        }
    ],
    "validated": 1
}