{
    "additionDate": "2024-05-24T10:54:16.654826Z",
    "biotoolsCURIE": "biotools:agimpute",
    "biotoolsID": "agimpute",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xqpeng@csu.edu.cn",
            "name": "Xiaoqing Peng",
            "orcidid": "https://orcid.org/0000-0002-4099-5183",
            "typeEntity": "Person"
        },
        {
            "email": "xszhu@csu.edu.cn",
            "name": "Xiaoshu Zhu",
            "orcidid": "https://orcid.org/0000-0002-7696-9112",
            "typeEntity": "Person"
        }
    ],
    "description": "Imputation of scRNA-seq data based on a hybrid GAN with dropouts identification.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Imputation",
                    "uri": "http://edamontology.org/operation_3557"
                }
            ]
        }
    ],
    "homepage": "https://github.com/xszhu-lab/AGImpute",
    "lastUpdate": "2024-05-24T10:54:16.657592Z",
    "name": "AGImpute",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btae068",
            "metadata": {
                "abstract": "Motivation: Dropout events bring challenges in analyzing single-cell RNA sequencing data as they introduce noise and distort the true distributions of gene expression profiles. Recent studies focus on estimating dropout probability and imputing dropout events by leveraging information from similar cells or genes. However, the number of dropout events differs in different cells, due to the complex factors, such as different sequencing protocols, cell types, and batch effects. The dropout event differences are not fully considered in assessing the similarities between cells and genes, which compromises the reliability of downstream analysis. Results: This work proposes a hybrid Generative Adversarial Network with dropouts identification to impute single-cell RNA sequencing data, named AGImpute. First, the numbers of dropout events in different cells in scRNA-seq data are differentially estimated by using a dynamic threshold estimation strategy. Next, the identified dropout events are imputed by a hybrid deep learning model, combining Autoencoder with a Generative Adversarial Network. To validate the efficiency of the AGImpute, it is compared with seven state-of-the-art dropout imputation methods on two simulated datasets and seven real single-cell RNA sequencing datasets. The results show that AGImpute imputes the least number of dropout events than other methods. Moreover, AGImpute enhances the performance of downstream analysis, including clustering performance, identifying cell-specific marker genes, and inferring trajectory in the time-course dataset.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Meng S."
                    },
                    {
                        "name": "Peng X."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "date": "2024-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AGImpute: imputation of scRNA-seq data based on a hybrid GAN with dropouts identification"
            },
            "pmcid": "PMC10877090",
            "pmid": "38317025"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
