{
    "accessibility": "Open access",
    "additionDate": "2023-12-01T15:34:49.539742Z",
    "biotoolsCURIE": "biotools:pathwayko",
    "biotoolsID": "pathwayko",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Allenai94@icloud.com",
            "name": "Hannan Ai",
            "typeEntity": "Person"
        },
        {
            "name": "Yuncan Ai",
            "typeEntity": "Person"
        }
    ],
    "description": "An integrated platform for deciphering the systems-level signaling pathways.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Pathway visualisation",
                    "uri": "http://edamontology.org/operation_3926"
                }
            ]
        }
    ],
    "homepage": "https://github.com/allenaigit/pathwayko",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:29:27.662725Z",
    "license": "CC-BY-NC-ND-4.0",
    "name": "PathwayKO",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3389/fimmu.2023.1103392",
            "metadata": {
                "abstract": "Systems characterization of immune landscapes in health, disease and clinical intervention cases is a priority in modern medicine. High-throughput transcriptomes accumulated from gene-knockout (KO) experiments are crucial for deciphering target KO signaling pathways that are impaired by KO genes at the systems-level. There is a demand for integrative platforms. This article describes the PathwayKO platform, which has integrated state-of-the-art methods of pathway enrichment analysis, statistics analysis, and visualizing analysis to conduct cutting-edge integrative pathway analysis in a pipeline fashion and decipher target KO signaling pathways at the systems-level. We focus on describing the methodology, principles and application features of PathwayKO. First, we demonstrate that the PathwayKO platform can be utilized to comprehensively analyze real-world mouse KO transcriptomes (GSE22873 and GSE24327), which reveal systemic mechanisms underlying the innate immune responses triggered by non-infectious extensive hepatectomy (2 hours after 85% liver resection surgery) and infectious CASP-model sepsis (12 hours after CASP-model surgery). Strikingly, our results indicate that both cases hit the same core set of 21 KO MyD88-associated signaling pathways, including the Toll-like receptor signaling pathway, the NFκB signaling pathway, the MAPK signaling pathway, and the PD-L1 expression and PD-1 checkpoint pathway in cancer, alongside the pathways of bacterial, viral and parasitic infections. These findings suggest common fundamental mechanisms between these immune responses and offer informative cues that warrant future experimental validation. Such mechanisms in mice may serve as models for humans and ultimately guide formulating the research paradigms and composite strategies to reduce the high mortality rates of patients in intensive care units who have undergone successful traumatic surgical treatments. Second, we demonstrate that the PathwayKO platform model-based assessments can effectively evaluate the performance difference of pathway analysis methods when benchmarked with a collection of proper transcriptomes. Together, such advances in methods for deciphering biological insights at the systems-level may benefit the fields of bioinformatics, systems immunology and beyond.",
                "authors": [
                    {
                        "name": "Ai H."
                    },
                    {
                        "name": "Ai Y."
                    },
                    {
                        "name": "Meng F."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Frontiers in Immunology",
                "title": "PathwayKO: An integrated platform for deciphering the systems-level signaling pathways"
            },
            "pmcid": "PMC10080220",
            "pmid": "37033947"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Immunology",
            "uri": "http://edamontology.org/topic_0804"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
