{
    "additionDate": "2021-01-18T12:34:38Z",
    "biotoolsCURIE": "biotools:rosbreed",
    "biotoolsID": "rosbreed",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "iezzoni@msu.edu",
            "name": "Amy F. Iezzoni",
            "typeEntity": "Person"
        }
    ],
    "description": "bridging the chasm between discovery and application to enable DNA-informed breeding in rosaceous crops.\n\nRosaceae Nemesis: Cherry Powdery Mildew.\n\nCherry powdery mildew is a major problem in sweet cherry growing regions in the U.S. Pacific Northwest (PNW), but much less so in the eastern part of the country.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "DNA testing",
                    "uri": "http://edamontology.org/operation_3920"
                }
            ]
        }
    ],
    "homepage": "http://www.rosbreed.org",
    "lastUpdate": "2021-02-08T12:59:12Z",
    "name": "RosBREED",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1038/S41438-020-00398-7",
            "metadata": {
                "abstract": "© 2020, The Author(s).The Rosaceae crop family (including almond, apple, apricot, blackberry, peach, pear, plum, raspberry, rose, strawberry, sweet cherry, and sour cherry) provides vital contributions to human well-being and is economically significant across the U.S. In 2003, industry stakeholder initiatives prioritized the utilization of genomics, genetics, and breeding to develop new cultivars exhibiting both disease resistance and superior horticultural quality. However, rosaceous crop breeders lacked certain knowledge and tools to fully implement DNA-informed breeding—a “chasm” existed between existing genomics and genetic information and the application of this knowledge in breeding. The RosBREED project (“Ros” signifying a Rosaceae genomics, genetics, and breeding community initiative, and “BREED”, indicating the core focus on breeding programs), addressed this challenge through a comprehensive and coordinated 10-year effort funded by the USDA-NIFA Specialty Crop Research Initiative. RosBREED was designed to enable the routine application of modern genomics and genetics technologies in U.S. rosaceous crop breeding programs, thereby enhancing their efficiency and effectiveness in delivering cultivars with producer-required disease resistances and market-essential horticultural quality. This review presents a synopsis of the approach, deliverables, and impacts of RosBREED, highlighting synergistic global collaborations and future needs. Enabling technologies and tools developed are described, including genome-wide scanning platforms and DNA diagnostic tests. Examples of DNA-informed breeding use by project participants are presented for all breeding stages, including pre-breeding for disease resistance, parental and seedling selection, and elite selection advancement. The chasm is now bridged, accelerating rosaceous crop genetic improvement.",
                "authors": [
                    {
                        "name": "Iezzoni A.F."
                    },
                    {
                        "name": "McFerson J."
                    },
                    {
                        "name": "Luby J."
                    },
                    {
                        "name": "Gasic K."
                    },
                    {
                        "name": "Whitaker V."
                    },
                    {
                        "name": "Bassil N."
                    },
                    {
                        "name": "Yue C."
                    },
                    {
                        "name": "Gallardo K."
                    },
                    {
                        "name": "McCracken V."
                    },
                    {
                        "name": "Coe M."
                    },
                    {
                        "name": "Hardner C."
                    },
                    {
                        "name": "Zurn J.D."
                    },
                    {
                        "name": "Hokanson S."
                    },
                    {
                        "name": "van de Weg E."
                    },
                    {
                        "name": "Jung S."
                    },
                    {
                        "name": "Main D."
                    },
                    {
                        "name": "da Silva Linge C."
                    },
                    {
                        "name": "Vanderzande S."
                    },
                    {
                        "name": "Davis T.M."
                    },
                    {
                        "name": "Mahoney L.L."
                    },
                    {
                        "name": "Finn C."
                    },
                    {
                        "name": "Peace C."
                    }
                ],
                "citationCount": 6,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Horticulture Research",
                "title": "RosBREED: bridging the chasm between discovery and application to enable DNA-informed breeding in rosaceous crops"
            },
            "pmcid": "PMC7603521",
            "pmid": "33328430"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}