{"credit":[{"email":"zhangz@csu.edu.cn","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"https://github.com/zhangzhen/sprites"}],"function":[{"operation":[{"term":"Sequence analysis","uri":"http://edamontology.org/operation_2403"},{"term":"Gene prediction","uri":"http://edamontology.org/operation_2454"},{"term":"Genetic variation analysis","uri":"http://edamontology.org/operation_3197"}]}],"labels":{"language":["C++"],"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"DNA","uri":"http://edamontology.org/topic_0654"},{"term":"Sequencing","uri":"http://edamontology.org/topic_3168"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/sprites-deletion-finder-through-re-aligning-the-whole-soft-clipping-read.html"}],"publication":[{"abstract":"© 2016 The Author 2016. Motivation: Advances of next generation sequencing technologies and availability of short read data enable the detection of structural variations (SVs). Deletions, an important type of SVs, have been suggested in association with genetic diseases. There are three types of deletions: blunt deletions, deletions with microhomologies and deletions with microsinsertions. The last two types are very common in the human genome, but they pose difficulty for the detection. Furthermore, finding deletions from sequencing data remains challenging. It is highly appealing to develop sensitive and accurate methods to detect deletions from sequencing data, especially deletions with microhomology and deletions with microinsertion. Results: We present a novel method called Sprites (SPlit Read re-alIgnment To dEtect Structural variants) which finds deletions from sequencing data. It aligns a whole soft-clipping read rather than its clipped part to the target sequence, a segment of the reference which is determined by spanning reads, in order to find the longest prefix or suffix of the read that has a match in the target sequence. This alignment aims to solve the problem of deletions with microhomologies and deletions with microinsertions. Using both simulated and real data we show that Sprites performs better on detecting deletions compared with other current methods in terms of F-score.","authors":["Zhang Z.","Wang J.","Luo J.","Ding X.","Zhong J.","Wang J.","Wu F.-X.","Pan Y."],"cit_count":9,"journal":"Bioinformatics","pmid":"26833342","title":"Sprites: Detection of deletions from sequencing data by re-aligning split reads","year":"2016-06-15"}],"summary":{"biotoolsCURIE":"biotools:sprites","biotoolsID":"sprites","description":"A sv caller that specializes in detecting deletion from low-coverage sequencing data. It works by identifying split reads from alignments based on soft-clipping information.","homepage":"https://github.com/zhangzhen/sprites","name":"Sprites"}}