{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:26:06Z",
    "biotoolsCURIE": "biotools:OG",
    "biotoolsID": "OG",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "davide.heller@imls.uzh.ch",
            "name": "Davide Heller",
            "orcidid": "https://orcid.org/0000-0001-7734-9102",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Consistency pipeline for hierarchies of orthologous groups (OGs) based on subsampling and tree reconciliation.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/meringlab/og_consistency_pipeline/blob/master/README.md"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://github.com/meringlab/og_consistency_pipeline/releases"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation (consensus)",
                    "uri": "http://edamontology.org/operation_0555"
                },
                {
                    "term": "Phylogenetic tree reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                },
                {
                    "term": "Phylogenetic species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                }
            ]
        }
    ],
    "homepage": "https://github.com/meringlab/og_consistency_pipeline",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/meringlab/og_consistency_pipeline/issues"
        }
    ],
    "maturity": "Mature",
    "name": "OG",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2828-Z",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: An orthologous group (OG) comprises a set of orthologous and paralogous genes that share a last common ancestor (LCA). OGs are defined with respect to a chosen taxonomic level, which delimits the position of the LCA in time to a specified speciation event. A hierarchy of OGs expands on this notion, connecting more general OGs, distant in time, to more recent, fine-grained OGs, thereby spanning multiple levels of the tree of life. Large scale inference of OG hierarchies with independently computed taxonomic levels can suffer from inconsistencies between successive levels, such as the position in time of a duplication event. This can be due to confounding genetic signal or algorithmic limitations. Importantly, inconsistencies limit the potential use of OGs for functional annotation and third-party applications. Results: Here we present a new methodology to ensure hierarchical consistency of OGs across taxonomic levels. To resolve an inconsistency, we subsample the protein space of the OG members and perform gene tree-species tree reconciliation for each sampling. Differently from previous approaches, by subsampling the protein space, we avoid the notoriously difficult task of accurately building and reconciling very large phylogenies. We implement the method into a high-throughput pipeline and apply it to the eggNOG database. We use independent protein domain definitions to validate its performance. Conclusion: The presented consistency pipeline shows that, contrary to previous limitations, tree reconciliation can be a useful instrument for the construction of OG hierarchies. The key lies in the combination of sampling smaller trees and aggregating their reconciliations for robustness. Results show comparable or greater performance to previous pipelines. The code is available on Github at: https://github.com/meringlab/og-consistency-pipeline.",
                "authors": [
                    {
                        "name": "Heller D."
                    },
                    {
                        "name": "Szklarczyk D."
                    },
                    {
                        "name": "Mering C.V."
                    }
                ],
                "date": "2019-05-06T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Tree reconciliation combined with subsampling improves large scale inference of orthologous group hierarchies"
            },
            "pmcid": "PMC6501302",
            "pmid": "31060495",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        }
    ]
}