{
    "additionDate": "2021-01-18T07:34:45Z",
    "biotoolsCURIE": "biotools:visbicluster",
    "biotoolsID": "visbicluster",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rodri@usal.es",
            "name": "Rodrigo SantamaríA",
            "typeEntity": "Person"
        }
    ],
    "description": "A Matrix-Based Bicluster Visualization of Expression Data.\n\nVisBicluster is an interactive, web based visualization technique designed to analyze biclusters generated from gene expression data. VisBicluster visualizes both, bicluster intersections and their properties, and the elements (genes and conditions as a heatmap )of each intersection or each bicluster.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://vis.usal.es/~visusal/visbicluster",
    "language": [
        "JavaScript"
    ],
    "lastUpdate": "2021-03-13T14:38:36Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/Haithem198717/VisBicluster"
        }
    ],
    "name": "VisBicluster",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1089/CMB.2019.0385",
            "metadata": {
                "abstract": "© Copyright 2020, Mary Ann Liebert, Inc., publishers 2020.One of the main methods to analyze gene expression data is biclustering, a nonsupervised technique, which consists of selection subgroups of genes that co-expressed under subgroups of experimental conditions. A large number of biclustering algorithms have been developed to classify gene expression data. These algorithms can give as output a large number of overlapped biclusters, whose visualization still requires deeper studies. We present VisBicluster, a web-based interactive visualization tool for displaying biclustering results. The developed visualization technique consists of laying out the generated biclusters in a two-dimensional matrix where each bicluster is represented as a column and each overlap between a set of biclusters is represented as a row. A search interface for the user is developed to query the matrix of bicluster intersection and visualize the results matching the queries. Our tool supports many interactive features such as sorting, zooming, and details-on-demand. We proved the usefulness of VisBicluster with biclustering results from real and synthetic datasets. Besides, we performed a user study with 14 participants to illustrate the clarity and simplicity of overlap representation with our tool.",
                "authors": [
                    {
                        "name": "Aouabed H."
                    },
                    {
                        "name": "Santamaria R."
                    },
                    {
                        "name": "Elloumi M."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "Journal of Computational Biology",
                "title": "VisBicluster: A Matrix-Based Bicluster Visualization of Expression Data"
            },
            "pmid": "32031874"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        }
    ]
}