
{
    "credit": [
        {
            "email": "support.bioinftools@mpimp-golm.mpg.de",
            "name": "Liam Childs",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinformatics.mpimp-golm.mpg.de/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://grapple.mpimp-golm.mpg.de/documentation.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Functional clustering",
                    "uri": "http://edamontology.org/operation_3459"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Nucleic acid sites, features and motifs",
                "uri": "http://edamontology.org/topic_3511"
            },
            {
                "term": "Functional, regulatory and non-coding RNA",
                "uri": "http://edamontology.org/topic_0659"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/grapple-graph-property-based-predictor-likelihood-estimator.html"
        }
    ],
    "publication": [
        {
            "abstract": "The study of non-coding RNA genes has received increased attention in recent years fuelled by accumulating evidence that larger portions of genomes than previously acknowledged are transcribed into RNA molecules of mostly unknown function, as well as the discovery of novel non-coding RNA types and functional RNA elements. Here, we demonstrate that specific properties of graphs that represent the predicted RNA secondary structure reflect functional information. We introduce a computational algorithm and an associated web-based tool (GraPPLE) for classifying non-coding RNA molecules as functional and, furthermore, into Rfam families based on their graph properties. Unlike sequence-similarity-based methods and covariance models, GraPPLE is demonstrated to be more robust with regard to increasing sequence divergence, and when combined with existing methods, leads to a significant improvement of prediction accuracy. Furthermore, graph properties identified as most informative are shown to provide an understanding as to what particular structural features render RNA molecules functional. Thus, GraPPLE may offer a valuable computational filtering tool to identify potentially interesting RNA molecules among large candidate datasets. © 2009 The Author(s).",
            "authors": [
                "Childs L.",
                "Nikoloski Z.",
                "May P.",
                "Walther D."
            ],
            "cit_count": 23,
            "journal": "Nucleic Acids Research",
            "pmid": "19339518",
            "title": "Identification and classification of ncRNA molecules using graph properties",
            "year": "2009-06-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:grapple",
        "biotoolsID": "grapple",
        "description": "Graphs are abstract representations of relationships between entities. Through a set of instructions, they are able to convert relationships into nodes and edges. This tool (originally: The RNA sorting hat) leverages the information available from graph properties and the predictive power of support vector machines (SVMs) to classify potential RNA sequences as functional/non-functional and into 1 of 46 Rfam families. In short, GraPPLE predicts the potential function of an ncRNA sequence.",
        "homepage": "http://grapple.mpimp-golm.mpg.de/",
        "name": "GraPPLE"
    }
}