{
    "additionDate": "2020-01-14T19:30:04Z",
    "biotoolsCURIE": "biotools:HKPocket",
    "biotoolsID": "HKPocket",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "yjzhaowh@mail.ccnu.edu.cn",
            "name": "Yunjie Zhao",
            "typeEntity": "Person"
        }
    ],
    "description": "Human kinase pocket database for drug design.\n\nBACKGROUND:The kinase pocket structural information is important for drug discovery targeting cancer or other diseases. Although some kinase sequence, structure or drug databases have been developed, the databases cannot be directly used in the kinase drug study. Therefore, a comprehensive database of human kinase protein pockets is urgently needed to be developed. RESULTS:Here, we have developed HKPocket, a comprehensive Human Kinase Pocket database. This database provides sequence, structure, hydrophilic-hydrophobic, critical interactions, and druggability information including 1717 pockets from 255 kinases. We further divided these pockets into 91 pocket clusters using structural and position features in each kinase group. The pocket structural information would be useful for preliminary drug screening",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Protein structure validation",
                    "uri": "http://edamontology.org/operation_0321"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://zhaoserver.com.cn/HKPocket/HKPocket.html",
    "lastUpdate": "2020-12-10T09:09:14Z",
    "name": "HKPocket",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3254-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The kinase pocket structural information is important for drug discovery targeting cancer or other diseases. Although some kinase sequence, structure or drug databases have been developed, the databases cannot be directly used in the kinase drug study. Therefore, a comprehensive database of human kinase protein pockets is urgently needed to be developed. Results: Here, we have developed HKPocket, a comprehensive Human Kinase Pocket database. This database provides sequence, structure, hydrophilic-hydrophobic, critical interactions, and druggability information including 1717 pockets from 255 kinases. We further divided these pockets into 91 pocket clusters using structural and position features in each kinase group. The pocket structural information would be useful for preliminary drug screening. Then, the potential drugs can be further selected and optimized by analyzing the sequence conservation, critical interactions, and hydrophobicity of identified drug pockets. HKPocket also provides online visualization and pse files of all identified pockets. Conclusion: The HKPocket database would be helpful for drug screening and optimization. Besides, drugs targeting the non-catalytic pockets would cause fewer side effects.",
                "authors": [
                    {
                        "name": "Jia Y."
                    },
                    {
                        "name": "Liu H."
                    },
                    {
                        "name": "Qiu J."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "citationCount": 5,
                "date": "2019-11-29T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HKPocket: Human kinase pocket database for drug design"
            },
            "pmcid": "PMC6884818",
            "pmid": "31783725"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Drug development",
            "uri": "http://edamontology.org/topic_3373"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
