{
    "accessibility": "Open access",
    "additionDate": "2021-05-28T07:30:49.682891",
    "biotoolsCURIE": "biotools:phonemes",
    "biotoolsID": "phonemes",
    "cost": "Free of charge",
    "description": "PHONEMeS (PHOsphorylation NEtworks for Mass Spectrometry) is a method to model signalling networks based on untargeted phosphoproteomics mass spectrometry data and kinase/phosphatase-substrate interactions.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "PTM site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                }
            ]
        }
    ],
    "homepage": "https://github.com/saezlab/PHONEMeS",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-05-28T07:30:49.683848Z",
    "name": "PHONEMeS",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.0C00958",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Post-translational modifications of proteins play an important role in the regulation of cellular processes. The mass spectrometry analysis of proteome modifications offers huge potential for the study of how protein inhibitors affect the phosphosignaling mechanisms inside the cells. We have recently proposed PHONEMeS, a method that uses high-content shotgun phosphoproteomic data to build logical network models of signal perturbation flow. However, in its original implementation, PHONEMeS was computationally demanding and was only used to model signaling in a perturbation context. We have reformulated PHONEMeS as an Integer Linear Program (ILP) that is orders of magnitude more efficient than the original one. We have also expanded the scenarios that can be analyzed. PHONEMeS can model data upon perturbation on not only a known target but also deregulated pathways upstream and downstream of any set of deregulated kinases. Finally, PHONEMeS can now analyze data sets with multiple time points, which helps us to obtain better insight into the dynamics of the propagation of signals. We illustrate the value of the new approach on various data sets of medical relevance, where we shed light on signaling mechanisms and drug modes of action.",
                "authors": [
                    {
                        "name": "Gjerga E."
                    },
                    {
                        "name": "Dugourd A."
                    },
                    {
                        "name": "Tobalina L."
                    },
                    {
                        "name": "Sousa A."
                    },
                    {
                        "name": "Saez-Rodriguez J."
                    }
                ],
                "date": "2021-04-02T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "PHONEMeS: Efficient Modeling of Signaling Networks Derived from Large-Scale Mass Spectrometry Data"
            },
            "pmid": "33682416"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Protein modifications",
            "uri": "http://edamontology.org/topic_0601"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ]
}