{
    "accessibility": "Open access",
    "additionDate": "2020-01-14T09:27:39Z",
    "biotoolsCURIE": "biotools:eContour",
    "biotoolsID": "eContour",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "efgillespie@ucsd.edu",
            "name": "Erin F. Gillespie",
            "typeEntity": "Person"
        }
    ],
    "description": "A novel, open-access web-based interactive contouring resource that aims to facilitate point-of-care decision support that is based on available evidence-based radiation treatment guidelines.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://econtour.org",
    "language": [
        "JavaScript",
        "Python"
    ],
    "lastUpdate": "2021-01-14T19:14:35Z",
    "name": "eContour",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1200/CCI.19.00041",
            "metadata": {
                "abstract": "Copyright © 2020 American Society of Clinical Oncology.Purpose: Variation in contouring quality by radiation oncologists is common and can have significant clinical consequences. Image-based guidelines can improve contour accuracy but are underused. We sought to develop a free, online, easily accessible contouring resource that allows users to scroll through cases with 3-dimensional images and access relevant evidence-based contouring information. Materials and Methods: eContour (http://econtour.org) was developed using modern Web technologies, primarily HTML5, Python, and JavaScript, to display JPEGs generated from DICOM files from real patient cases. The viewer has standard tools for image manipulation as well as toggling of contours and overlayed images and radiation dose distributions. Brief written content references published guidelines for contour delineation. Mixpanel software was used to collect Web page usage statistics. Results: In the first 3 years of operation (March 8, 2016 to March 7, 2019), a total of 13,391 users from 128 countries registered on the Web site, including 2,358 physicians from the United States. High-frequency users were more likely to be physicians (P < .001) and from the United States (P < .001). In one 6-month period, there were 68,642 individual case page views, with head-and-neck the most commonly viewed disease site (32%). Users who accessed a head-and-neck case were more likely to be high-frequency users, and 67% of repeat users accessed the same case more than once. Conclusion: The large, diverse user base and steady growth in Web site traffic over the first 3 years of eContour demonstrate its strong potential to address the unmet need for dissemination and use of evidence-based contouring information at the point of care.",
                "authors": [
                    {
                        "name": "Sherer M.V."
                    },
                    {
                        "name": "Lin D."
                    },
                    {
                        "name": "Puri K."
                    },
                    {
                        "name": "Panjwani N."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Murphy J.D."
                    },
                    {
                        "name": "Gillespie E.F."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-01T00:00:00Z",
                "journal": "JCO Clinical Cancer Informatics",
                "title": "Development and usage of econtour, a novel, three-dimensional, image-based web site to facilitate access to contouring guidelines at the point of care"
            },
            "pmcid": "PMC6882522",
            "pmid": "31756136"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        }
    ],
    "validated": 1
}