{
    "accessibility": "Open access",
    "additionDate": "2021-11-08T18:53:21.242600Z",
    "biotoolsCURIE": "biotools:gp2s",
    "biotoolsID": "gp2s",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dorota Wypych"
        },
        {
            "name": "Dorota Wypych"
        }
    ],
    "description": "Information Management System for CryoEM Experiments.\n\ngP2S (for Genentech’s Protein to Structure) is a user-friendly web-based laboratory information management system (LIMS) that facilitates accurate record-keeping for cryo-EM labs and multi-user, multi-project facilities.",
    "download": [
        {
            "type": "Container file",
            "url": "https://hub.docker.com/r/arohou/gp2s"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/arohou/gP2S",
    "language": [
        "Java",
        "JavaScript"
    ],
    "lastUpdate": "2021-11-08T18:53:21.245336Z",
    "license": "Apache-2.0",
    "name": "gP2S",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.3791/62377",
            "metadata": {
                "abstract": "© 2021 JoVE Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License.Cryogenic electron microscopy (cryoEM) has become an integral part of many drug-discovery projects because crystallography of the protein target is not always achievable and cryoEM provides an alternative means to support structure-based ligand design. When dealing with a large number of distinct projects, and within each project a potentially large number of ligand-protein co-structures, accurate record keeping rapidly becomes challenging. Many experimental parameters are tuned for each target, including at the sample preparation, grid preparation, and microscopy stages. Therefore, accurate record keeping can be crucially important to enable long-term reproducibility, and to facilitate efficient teamwork, especially when steps of the cryoEM workflow are performed by different operators. To help deal with this challenge, we developed a web-based information management system for cryoEM, called gP2S. The application keeps track of each experiment, from sample to final atomic model, in the context of projects, a list of which is maintained in the application, or externally in a separate system. User-defined controlled vocabularies of consumables, equipment, protocols and software help describe each step of the cryoEM workflow in a structured manner. gP2S is widely configurable and, depending on the team's needs, may exist as a standalone product or be a part of a broader ecosystem of scientific applications, integrating via REST APIs with project management tools, applications tracking the production of proteins or of small molecules ligands, or applications automating data collection and storage. Users can register details of each grid and microscopy session including key experimental metadata and parameter values, and the lineage of each experimental artifact (sample, grid, microscopy session, map, etc.) is recorded. gP2S serves as a cryoEM experimental workflow organizer that enables accurate record keeping for teams, and is available under an open-source license.",
                "authors": [
                    {
                        "name": "Golebiowski F.M."
                    },
                    {
                        "name": "Kierecki D."
                    },
                    {
                        "name": "Rohou A."
                    },
                    {
                        "name": "Wypych D."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "Journal of Visualized Experiments",
                "title": "Gp2s, an information management system for cryoem experiments"
            },
            "pmid": "34180891"
        }
    ],
    "toolType": [
        "Workbench"
    ],
    "topic": [
        {
            "term": "Biochemistry",
            "uri": "http://edamontology.org/topic_3292"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "Electron microscopy",
            "uri": "http://edamontology.org/topic_0611"
        },
        {
            "term": "Laboratory information management",
            "uri": "http://edamontology.org/topic_0607"
        },
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        }
    ]
}
