{
    "additionDate": "2021-02-18T11:22:18Z",
    "biotoolsCURIE": "biotools:dark_proteome_database",
    "biotoolsID": "dark_proteome_database",
    "credit": [
        {
            "email": "p3rdigao@laseeb.org",
            "name": "Nelson Perdigão",
            "orcidid": "https://orcid.org/0000-0001-8600-1650",
            "typeEntity": "Person",
            "typeRole": [
                "Developer"
            ],
            "url": "http://darkproteome.ws"
        }
    ],
    "description": "Mapping Darkness in the Protein Universe",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://darkproteome.ws/",
    "language": [
        "PHP",
        "JavaScript"
    ],
    "lastUpdate": "2021-02-18T12:13:58Z",
    "link": [
        {
            "type": [
                "Service"
            ],
            "url": "http://darkproteome.ws"
        }
    ],
    "maturity": "Mature",
    "name": "Dark Proteome Database",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "p3rdigao",
    "publication": [
        {
            "doi": "10.1073/pnas.1508380112",
            "metadata": {
                "abstract": "We surveyed the \"dark\" proteome-that is, regions of proteins never observed by experimental structure determination and inaccessible to homology modeling. For 546,000 Swiss-Prot proteins, we found that 44-54% of the proteome in eukaryotes and viruses was dark, compared with only ∼14% in archaea and bacteria. Surprisingly, most of the dark proteome could not be accounted for by conventional explanations, such as intrinsic disorder or transmembrane regions. Nearly half of the dark proteome comprised dark proteins, in which the entire sequence lacked similarity to any known structure. Dark proteins fulfill a wide variety of functions, but a subset showed distinct and largely unexpected features, such as association with secretion, specific tissues, the endoplasmic reticulum, disulfide bonding, and proteolytic cleavage. Dark proteins also had short sequence length, low evolutionary reuse, and few known interactions with other proteins. These results suggest new research directions in structural and computational biology.",
                "authors": [
                    {
                        "name": "Perdigao N."
                    },
                    {
                        "name": "Heinrich J."
                    },
                    {
                        "name": "Stolte C."
                    },
                    {
                        "name": "Sabir K.S."
                    },
                    {
                        "name": "Buckley M.J."
                    },
                    {
                        "name": "Tabor B."
                    },
                    {
                        "name": "Signal B."
                    },
                    {
                        "name": "Gloss B.S."
                    },
                    {
                        "name": "Hammang C.J."
                    },
                    {
                        "name": "Rost B."
                    },
                    {
                        "name": "Schafferhans A."
                    },
                    {
                        "name": "O'donoghue S.I."
                    }
                ],
                "citationCount": 66,
                "date": "2015-12-29T00:00:00Z",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "title": "Unexpected features of the dark proteome"
            },
            "pmcid": "PMC4702990",
            "pmid": "26578815",
            "type": [
                "Method"
            ],
            "version": "1.0"
        },
        {
            "doi": "10.1186/s13040-017-0144-6",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Recently we surveyed the dark-proteome, i.e., regions of proteins never observed by experimental structure determination and inaccessible to homology modelling. Surprisingly, we found that most of the dark proteome could not be accounted for by conventional explanations (e.g., intrinsic disorder, transmembrane domains, and compositional bias), and that nearly half of the dark proteome comprised dark proteins, in which the entire sequence lacked similarity to any known structure. In this paper we will present the Dark Proteome Database (DPD) and associated web services that provide access to updated information about the dark proteome. Results: We assembled DPD from several external web resources (primarily Aquaria and Swiss-Prot) and stored it in a relational database currently containing ~10 million entries and occupying ~2 GBytes of disk space. This database comprises two key tables: one giving information on the darkness of each protein, and a second table that breaks each protein into dark and non-dark regions. In addition, a second version of the database is created using also information from the Protein Model Portal (PMP) to determine darkness. To provide access to DPD, a web server has been implemented giving access to all underlying data, as well as providing access to functional analyses derived from these data. Conclusions: Availability of this database and its web service will help focus future structural and computational biology efforts to study the dark proteome, thus providing a basis for understanding a wide variety of biological functions that currently remain unknown. Availability and implementation: DPD is available at http://darkproteome.ws. The complete database is also available upon request. Data use is permitted via the Creative Commons Attribution-NonCommercial International license (http://creativecommons. org/licenses/by-nc/4.0/).",
                "authors": [
                    {
                        "name": "Perdigao N."
                    },
                    {
                        "name": "Rosa A.C."
                    },
                    {
                        "name": "O'Donoghue S.I."
                    }
                ],
                "citationCount": 10,
                "date": "2017-07-20T00:00:00Z",
                "journal": "BioData Mining",
                "title": "The Dark Proteome Database"
            },
            "pmcid": "PMC5520327",
            "pmid": "28736578",
            "type": [
                "Method"
            ],
            "version": "1.1"
        },
        {
            "doi": "10.3390/ht8020008",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.The dark proteome, as we define it, is the part of the proteome where 3D structure has not been observed either by homology modeling or by experimental characterization in the protein universe. From the 550.116 proteins available in Swiss-Prot (as of July 2016), 43.2% of the eukarya universe and 49.2% of the virus universe are part of the dark proteome. In bacteria and archaea, the percentage of the dark proteome presence is significantly less, at 12.6% and 13.3% respectively. In this work, we present a necessary step to complete the dark proteome picture by introducing the map of the dark proteome in the human and in other model organisms of special importance to mankind. The most significant result is that around 40% to 50% of the proteome of these organisms are still in the dark, where the higher percentages belong to higher eukaryotes (mouse and human organisms). Due to the amount of darkness present in the human organism being more than 50%, deeper studies were made, including the identification of ‘dark' genes that are responsible for the production of so-called dark proteins, as well as the identification of the ‘dark' tissues where dark proteins are over represented, namely, the heart, cervical mucosa, and natural killer cells. This is a step forward in the direction of gaining a deeper knowledge of the human dark proteome.",
                "authors": [
                    {
                        "name": "Perdigao N."
                    },
                    {
                        "name": "Rosa A."
                    }
                ],
                "citationCount": 3,
                "date": "2019-06-01T00:00:00Z",
                "journal": "High-Throughput",
                "title": "Dark proteome database: Studies on dark proteins"
            },
            "pmcid": "PMC6630768",
            "pmid": "30934744",
            "type": [
                "Benchmarking study"
            ],
            "version": "1.1"
        },
        {
            "doi": "10.3390/ht9030015",
            "metadata": {
                "abstract": "© 2020 by the authors. Licensee MDPI, Basel, Switzerland.There is a misconception that intrinsic disorder in proteins is equivalent to darkness. The present study aims to establish, in the scope of the Swiss-Prot and Dark Proteome databases, the relationship between disorder and darkness. Three distinct predictors were used to calculate the disorder of Swiss-Prot proteins. The analysis of the results obtained with the used predictors and visualization paradigms resulted in the same conclusion that was reached before: disorder is mostly unrelated to darkness.",
                "authors": [
                    {
                        "name": "Perdigao N."
                    },
                    {
                        "name": "Pina P.M.C."
                    },
                    {
                        "name": "Rocha C."
                    },
                    {
                        "name": "Tavares J.M.R.S."
                    },
                    {
                        "name": "Rosa A."
                    }
                ],
                "date": "2020-09-01T00:00:00Z",
                "journal": "High-Throughput",
                "title": "Dark proteome database: Studies on disorder"
            },
            "pmcid": "PMC7563470",
            "pmid": "32629790",
            "type": [
                "Benchmarking study"
            ],
            "version": "1.1"
        }
    ],
    "relation": [
        {
            "biotoolsID": "uniprotkb",
            "type": "uses"
        },
        {
            "biotoolsID": "pdb",
            "type": "uses"
        },
        {
            "biotoolsID": "string",
            "type": "uses"
        },
        {
            "biotoolsID": "aquaria",
            "type": "uses"
        },
        {
            "biotoolsID": "predictprotein",
            "type": "uses"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        },
        {
            "term": "Sequence sites, features and motifs",
            "uri": "http://edamontology.org/topic_0160"
        },
        {
            "term": "Protein structure analysis",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "version": [
        "v1.1"
    ]
}