{
    "accessibility": "Open access",
    "additionDate": "2022-03-13T11:46:33.929136Z",
    "biotoolsCURIE": "biotools:stoat",
    "biotoolsID": "stoat",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "walter.jetz@yale.edu",
            "name": "Walter Jetz",
            "orcidid": "https://orcid.org/0000-0002-1971-7277",
            "typeEntity": "Person"
        },
        {
            "name": "Ajay Ranipeta"
        },
        {
            "name": "John Wilshire"
        },
        {
            "name": "Adam Wilson",
            "orcidid": "https://orcid.org/0000-0003-3362-7806"
        },
        {
            "name": "Richard Li",
            "orcidid": "https://orcid.org/0000-0003-3009-408X"
        }
    ],
    "description": "Welcome to Stoat, the environmental data annotation tool, a data fusion engine design to annotate biodiversity records with environmental remote sensing products. This tutorial provides a step-by-step guide to using the tools to explore, upload, manage, annotate, and download data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://mol.org/stoat",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-03-13T11:46:33.931638Z",
    "license": "Other",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/MapofLife/rstoat"
        }
    ],
    "name": "STOAT",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PBIO.3001460",
            "metadata": {
                "abstract": "© 2021 Public Library of Science. All rights reserved.A vast range of research applicaltion in biodiversit sciences requires integrating primary species, genetic, or ecosystem data with other environmental data. This integration requires a consideration of the spatial and temporal scale appropriate for the data and processes in question. But a versatile and scale flexible environmental annotation of biodiversity data remains constrained by technical hurdles. Existing tools have streamlined the intersection of occurrence records with gridded environmental data but have remained limited in their ability to address a range of spatial and temporal grains, especially for large datasets. We present the Spatiotemporal Observation Annotation Tool (STOAT), a cloud-based toolbox for flexible biodiversity-environment annotations. STOAT is optimized for large biodiversity datasets and allows user-specified spatial and temporal resolution and buffering in support of environmental characterizations that account for the uncertainty and scale of data and of relevant processes. The tool offers these services for a growing set of near global, remotely sensed, or modeled environmental data, including Landsat, MODIS, EarthEnv, and CHELSA. STOAT includes a user-friendly, web-based dashboard that provides tools for annotation task management and result visualization, linked to Map of Life, and a dedicated R package (rstoat) for programmatic access. We demonstrate STOAT functionality with several examples that illustrate phenological variation and spatial and temporal scale dependence of environmental characteristics of birds at a continental scale. We expect STOAT to facilitate broader exploration and assessment of the scale dependence of observations and processes in ecology.",
                "authors": [
                    {
                        "name": "Duong M."
                    },
                    {
                        "name": "Guralnick R."
                    },
                    {
                        "name": "Jetz W."
                    },
                    {
                        "name": "Li R."
                    },
                    {
                        "name": "Malczyk J."
                    },
                    {
                        "name": "Ranipeta A."
                    },
                    {
                        "name": "Wilshire J."
                    },
                    {
                        "name": "Wilson A."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "PLoS Biology",
                "title": "A cloud-based toolbox for the versatile environmental annotation of biodiversity data"
            },
            "pmcid": "PMC8629388",
            "pmid": "34780461"
        }
    ],
    "toolType": [
        "Library",
        "Web application"
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Environmental science",
            "uri": "http://edamontology.org/topic_3855"
        },
        {
            "term": "Evolutionary biology",
            "uri": "http://edamontology.org/topic_3299"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Zoology",
            "uri": "http://edamontology.org/topic_3500"
        }
    ],
    "validated": 1
}
