{
    "accessibility": "Open access",
    "additionDate": "2022-04-26T16:13:16.633038Z",
    "biotoolsCURIE": "biotools:kiu-net",
    "biotoolsID": "kiu-net",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Ilker Hacihaliloglu"
        },
        {
            "name": "Vishwanath A. Sindagi"
        },
        {
            "name": "Jeya Maria Jose Valanarasu",
            "orcidid": "https://orcid.org/0000-0001-6424-7529"
        },
        {
            "name": "Vishal M. Patel",
            "orcidid": "https://orcid.org/0000-0002-5239-692X"
        }
    ],
    "description": "Overcomplete Convolutional Architectures for Biomedical Image and Volumetric Segmentation.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/jeya-maria-jose/KiU-Net-pytorch",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-04-26T16:13:16.635680Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://sites.google.com/view/kiunet/kiu-net"
        }
    ],
    "name": "KiU-Net",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TMI.2021.3130469",
            "metadata": {
                "abstract": "© 1982-2012 IEEE.Most methods for medical image segmentation use U-Net or its variants as they have been successful in most of the applications. After a detailed analysis of these 'traditional' encoder-decoder based approaches, we observed that they perform poorly in detecting smaller structures and are unable to segment boundary regions precisely. This issue can be attributed to the increase in receptive field size as we go deeper into the encoder. The extra focus on learning high level features causes U-Net based approaches to learn less information about low-level features which are crucial for detecting small structures. To overcome this issue, we propose using an overcomplete convolutional architecture where we project the input image into a higher dimension such that we constrain the receptive field from increasing in the deep layers of the network. We design a new architecture for im- age segmentation- KiU-Net which has two branches: (1) an overcomplete convolutional network Kite-Net which learns to capture fine details and accurate edges of the input, and (2) U-Net which learns high level features. Furthermore, we also propose KiU-Net 3D which is a 3D convolutional architecture for volumetric segmentation. We perform a detailed study of KiU-Net by performing experiments on five different datasets covering various image modalities. We achieve a good performance with an additional benefit of fewer parameters and faster convergence. We also demonstrate that the extensions of KiU-Net based on residual blocks and dense blocks result in further performance improvements. Code: https://github.com/jeya-maria-jose/KiU-Net-pytorch",
                "authors": [
                    {
                        "name": "Hacihaliloglu I."
                    },
                    {
                        "name": "Patel V.M."
                    },
                    {
                        "name": "Sindagi V.A."
                    },
                    {
                        "name": "Valanarasu J.M.J."
                    }
                ],
                "citationCount": 1,
                "date": "2022-04-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "KiU-Net: Overcomplete Convolutional Architectures for Biomedical Image and Volumetric Segmentation"
            },
            "pmid": "34813472"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        }
    ],
    "validated": 1
}
