{
    "additionDate": "2017-05-16T12:28:34Z",
    "biotoolsCURIE": "biotools:cipres",
    "biotoolsID": "cipres",
    "credit": [
        {
            "email": "mmiller@sdsc.edu",
            "name": "Mark A. Miller",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://phylo-bugz.sdsc.edu/fogbugz/default.php?pg=pgPublicEdit"
        },
        {
            "email": "pfeiffer@sdsc.edu",
            "name": "Wayne Pfeiffer",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "terri@sdsc.edu",
            "name": "Terri Schwartz",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Project aims to develop a computational infrastructure for systematics. Other goals of the project include providing a central resource enabling computational systematics and education and training initiatives. The website also contains a substantial list of links to related software.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.phylo.org/http://www.phylo.org/index.php/portal/about/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                },
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Phylogenetic tree generation (parsimony methods)",
                    "uri": "http://edamontology.org/operation_0545"
                }
            ]
        }
    ],
    "homepage": "http://www.phylo.org/",
    "language": [
        "Java",
        "SQL"
    ],
    "lastUpdate": "2018-12-10T12:58:52Z",
    "name": "CIPRes",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "doi": "10.1109/GCE.2010.5676129",
            "metadata": {
                "abstract": "Understanding the evolutionary history of living organisms is a central problem in biology. Until recently the ability to infer evolutionary relationships was limited by the amount of DNA sequence data available, but new DNA sequencing technologies have largely removed this limitation. As a result, DNA sequence data are readily available or obtainable for a wide spectrum of organisms, thus creating an unprecedented opportunity to explore evolutionary relationships broadly and deeply across the Tree of Life. Unfortunately, the algorithms used to infer evolutionary relationships are NP-hard, so the dramatic increase in available DNA sequence data has created a commensurate increase in the need for access to powerful computational resources. Local laptop or desktop machines are no longer viable for analysis of the larger data sets available today, and progress in the field relies upon access to large, scalable high-performance computing resources. This paper describes development of the CIPRES Science Gateway, a web portal designed to provide researchers with transparent access to the fastest available community codes for inference of phylogenetic relationships, and implementation of these codes on scalable computational resources. Meeting the needs of the community has included developing infrastructure to provide access, working with the community to improve existing community codes, developing infrastructure to insure the portal is scalable to the entire systematics community, and adopting strategies that make the project sustainable by the community. The CIPRES Science Gateway has allowed more than 1800 unique users to run jobs that required 2.5 million Service Units since its release in December 2009. (A Service Unit is a CPU-hour at unit priority).",
                "authors": [
                    {
                        "name": "Miller M.A."
                    },
                    {
                        "name": "Pfeiffer W."
                    },
                    {
                        "name": "Schwartz T."
                    }
                ],
                "citationCount": 3208,
                "date": "2010-12-01T00:00:00Z",
                "journal": "2010 Gateway Computing Environments Workshop, GCE 2010",
                "title": "Creating the CIPRES Science Gateway for inference of large phylogenetic trees"
            }
        },
        {
            "doi": "10.4137/EBO.S21501",
            "metadata": {
                "abstract": "© the authors.The CIPRES Science Gateway is a community web application that provides public access to a set of parallel tree inference and multiple sequence alignment codes run on large computational resources. These resources are made available at no charge to users by the NSF Extreme Science and Engineering Discovery Environment (XSEDE) project. Here we describe the CIPRES RESTful application programmer interface (CRA), a web service that provides programmatic access to all resources and services currently offered by the CIPRES Science Gateway. Software developers can use the CRA to extend their web or desktop applications to include the ability to run MrBayes, BEAST, RAxML, MAFFT, and other computationally intensive algorithms on XSEDE. The CRA also makes it possible for individuals with modest scripting skills to access the same tools from the command line using curl, or through any scripting language. This report describes the CRA and its use in three web applications (Influenza Research Database – www.fludb. org, Virus Pathogen Resource – www.viprbrc.org, and MorphoBank – www.morphobank.org). The CRA is freely accessible to registered users at ht t ps:// cipresrest.sdsc.edu/cipresrest/v1; supporting documentation and registration tools are available at https://www.phylo.org/restusers.Z",
                "authors": [
                    {
                        "name": "Miller M.A."
                    },
                    {
                        "name": "Schwartz T."
                    },
                    {
                        "name": "Pickett B.E."
                    },
                    {
                        "name": "He S."
                    },
                    {
                        "name": "Klem E.B."
                    },
                    {
                        "name": "Scheuermann R.H."
                    },
                    {
                        "name": "Passarotti M."
                    },
                    {
                        "name": "Kaufman S."
                    },
                    {
                        "name": "Oleary M.A."
                    }
                ],
                "citationCount": 162,
                "date": "2015-01-24T00:00:00Z",
                "journal": "Evolutionary Bioinformatics",
                "title": "A RESTful API for access to phylogenetic tools via the CIPRES science gateway"
            },
            "pmcid": "PMC4362911",
            "pmid": "25861210"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        },
        {
            "term": "Database management",
            "uri": "http://edamontology.org/topic_3489"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        },
        {
            "term": "Computer science",
            "uri": "http://edamontology.org/topic_3316"
        }
    ],
    "validated": 1
}