{
    "additionDate": "2017-01-17T15:02:02Z",
    "biotoolsCURIE": "biotools:deconrnaseq",
    "biotoolsID": "deconrnaseq",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "tinggong@gmail.com",
            "name": "Ting Gong",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "R package for deconvolution of heterogeneous tissues based on mRNA-Seq data. It modeled expression levels from heterogeneous cell populations in mRNA-Seq as the weighted average of expression from different constituting cell types and predicted cell type proportions of single expression profiles.",
    "documentation": [
        {
            "type": "User manual",
            "url": "http://bioconductor.org/packages/release/bioc/html/DeconRNASeq.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/DeconRNASeq_1.16.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/DeconRNASeq.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": "GPL-2.0",
    "name": "DeconRNASeq",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btt090",
            "metadata": {
                "abstract": "For heterogeneous tissues, measurements of gene expression through mRNA-Seq data are confounded by relative proportions of cell types involved. In this note, we introduce an efficient pipeline: DeconRNASeq, an R package for deconvolution of heterogeneous tissues based on mRNA-Seq data. It adopts a globally optimized non-negative decomposition algorithm through quadratic programming for estimating the mixing proportions of distinctive tissue types in next-generation sequencing data. We demonstrated the feasibility and validity of DeconRNASeq across a range of mixing levels and sources using mRNA-Seq data mixed in silico at known concentrations. We validated our computational approach for various benchmark data, with high correlation between our predicted cell proportions and the real fractions of tissues. Our study provides a rigorous, quantitative and high-resolution tool as a prerequisite to use mRNA-Seq data. The modularity of package design allows an easy deployment of custom analytical pipelines for data from other high-throughput platforms. © 2013 The Author.",
                "authors": [
                    {
                        "name": "Gong T."
                    },
                    {
                        "name": "Szustakowski J.D."
                    }
                ],
                "citationCount": 46,
                "date": "2013-04-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "DeconRNASeq: A statistical framework for deconvolution of heterogeneous tissue samples based on mRNA-Seq data"
            },
            "type": "Primary"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1,
    "version": [
        "1.16.0"
    ]
}