{
    "additionDate": "2024-04-08T09:00:06.945782Z",
    "biotoolsCURIE": "biotools:scribbledom",
    "biotoolsID": "scribbledom",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mrahman@cse.buet.ac.bd",
            "name": "M Saifur Rahman",
            "orcidid": "https://orcid.org/0000-0002-9887-4456",
            "typeEntity": "Person"
        },
        {
            "email": "samee@bcm.edu",
            "name": "Md Abul Hassan Samee",
            "orcidid": "https://orcid.org/0000-0002-7472-1156",
            "typeEntity": "Person"
        }
    ],
    "description": "Using scribble-annotated histology images to identify domains in spatial transcriptomics data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/1alnoman/ScribbleDom/tree/1.0.0.3",
    "lastUpdate": "2024-11-24T14:05:08.569387Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://zenodo.org/badge/latestdoi/681572669"
        }
    ],
    "name": "ScribbleDom",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btad594",
            "metadata": {
                "abstract": "Motivation: Spatial domain identification is a very important problem in the field of spatial transcriptomics. The state-of-the-art solutions to this problem focus on unsupervised methods, as there is lack of data for a supervised learning formulation. The results obtained from these methods highlight significant opportunities for improvement. Results: In this article, we propose a potential avenue for enhancement through the development of a semi-supervised convolutional neural network based approach. Named “ScribbleDom”, our method leverages human expert’s input as a form of semi-supervision, thereby seamlessly combines the cognitive abilities of human experts with the computational power of machines. ScribbleDom incorporates a loss function that integrates two crucial components: similarity in gene expression profiles and adherence to the valuable input of a human annotator through scribbles on histology images, providing prior knowledge about spot labels. The spatial continuity of the tissue domains is taken into account by extracting information on the spot microenvironment through convolution filters of varying sizes, in the form of “Inception” blocks. By leveraging this semisupervised approach, ScribbleDom significantly improves the quality of spatial domains, yielding superior results both quantitatively and qualitatively. Our experiments on several benchmark datasets demonstrate the clear edge of ScribbleDom over state-of-the-art methods-between 1.82% to 169.38% improvements in adjusted Rand index for 9 of the 12 human dorsolateral prefrontal cortex samples, and 15.54% improvement in the melanoma cancer dataset. Notably, when the expert input is absent, ScribbleDom can still operate, in a fully unsupervised manner like the state-of-the-art methods, and produces results that remain competitive.",
                "authors": [
                    {
                        "name": "Abrar M.A."
                    },
                    {
                        "name": "Al Noman A."
                    },
                    {
                        "name": "Rahman M.N."
                    },
                    {
                        "name": "Rahman M.S."
                    },
                    {
                        "name": "Samee M.A.H."
                    },
                    {
                        "name": "Turza A.M."
                    }
                ],
                "citationCount": 4,
                "date": "2023-10-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ScribbleDom: Using scribble-annotated histology images to identify domains in spatial transcriptomics data"
            },
            "pmcid": "PMC10564617",
            "pmid": "37756699"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "MRI",
            "uri": "http://edamontology.org/topic_3444"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
