{
    "additionDate": "2018-10-20T14:42:02Z",
    "biotoolsCURIE": "biotools:freect_wfbp",
    "biotoolsID": "freect_wfbp",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://cvib.ucla.edu/freect/contact.html"
        }
    ],
    "description": "FreeCT_wFBP is a software package capable of reconstructing helical scans acquired with arbitrary pitch-values, and sampling techniques such as flying focal spots and a quarter-detector offset.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://cvib.ucla.edu/freect/documentation.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Statistical inference",
                    "uri": "http://edamontology.org/operation_3658"
                }
            ]
        }
    ],
    "homepage": "http://cvib.ucla.edu/freect/",
    "language": [
        "C"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-2.0",
    "name": "FreeCT_wFBP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1118/1.4941953",
            "metadata": {
                "abstract": "© 2016 American Association of Physicists in Medicine.Purpose: With growing interest in quantitative imaging, radiomics, and CAD using CT imaging, the need to explore the impacts of acquisition and reconstruction parameters has grown. This usually requires extensive access to the scanner on which the data were acquired and its workflow is not designed for large-scale reconstruction projects. Therefore, the authors have developed a freely available, open-source software package implementing a common reconstruction method, weighted filtered backprojection (wFBP), for helical fan-beam CT applications. Methods: FreeCT-wFBP is a low-dependency, GPU-based reconstruction program utilizing c for the host code and NVIDIA CUDA C for GPU code. The software is capable of reconstructing helical scans acquired with arbitrary pitch-values, and sampling techniques such as flying focal spots and a quarter-detector offset. In this work, the software has been described and evaluated for reconstruction speed, image quality, and accuracy. Speed was evaluated based on acquisitions of the ACR CT accreditation phantom under four different flying focal spot configurations. Image quality was assessed using the same phantom by evaluating CT number accuracy, uniformity, and contrast to noise ratio (CNR). Finally, reconstructed mass-attenuation coefficient accuracy was evaluated using a simulated scan of a FORBILD thorax phantom and comparing reconstructed values to the known phantom values. Results: The average reconstruction time evaluated under all flying focal spot configurations was found to be 17.4±1.0 s for a 512 row × 512 column × 32 slice volume. Reconstructions of the ACR phantom were found to meet all CT Accreditation Program criteria including CT number, CNR, and uniformity tests. Finally, reconstructed mass-attenuation coefficient values of water within the FORBILD thorax phantom agreed with original phantom values to within 0.0001 mm2/g (0.01%). Conclusions: FreeCT-wFBP is a fast, highly configurable reconstruction package for third-generation CT available under the GNU GPL. It shows good performance with both clinical and simulated data.",
                "authors": [
                    {
                        "name": "Hoffman J."
                    },
                    {
                        "name": "McNitt-Gray M."
                    },
                    {
                        "name": "Noo F."
                    },
                    {
                        "name": "Young S."
                    }
                ],
                "citationCount": 28,
                "date": "2016-03-01T00:00:00Z",
                "journal": "Medical Physics",
                "title": "Technical Note: FreeCT-wFBP: A robust, efficient, open-source implementation of weighted filtered backprojection for helical, fan-beam CT"
            },
            "pmcid": "PMC4769265",
            "pmid": "26936725",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
