{
    "additionDate": "2017-08-03T18:35:53Z",
    "biotoolsCURIE": "biotools:aptani",
    "biotoolsID": "aptani",
    "credit": [
        {
            "email": "silvio.bicciato@unimore.it",
            "name": "Silvio Bicciato",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://aptani.unimore.it/contacts.php"
        }
    ],
    "description": "Computational tool to identify target-specific aptamers from HT-SELEX data and secondary structure information.",
    "documentation": [
        {
            "type": "General",
            "url": "http://aptani.unimore.it/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid feature detection",
                    "uri": "http://edamontology.org/operation_0415"
                },
                {
                    "term": "RNA structure prediction",
                    "uri": "http://edamontology.org/operation_2441"
                }
            ]
        }
    ],
    "homepage": "http://aptani.unimore.it/",
    "lastUpdate": "2018-12-10T12:58:43Z",
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/aptani-select-aptamers-through-sequence-structure-motif-analysis-of-ht-selex-data.html"
        }
    ],
    "name": "APTANI",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© 2015 The Author 2015. Published by Oxford University Press. All rights reserved. Motivation: Aptamers are synthetic nucleic acid molecules that can bind biological targets in virtue of both their sequence and three-dimensional structure. Aptamers are selected using SELEX, Systematic Evolution of Ligands by EXponential enrichment, a technique that exploits aptamer-target binding affinity. The SELEX procedure, coupled with high-throughput sequencing (HT-SELEX), creates billions of random sequences capable of binding different epitopes on specific targets. Since this technique produces enormous amounts of data, computational analysis represents a critical step to screen and select the most biologically relevant sequences. Results: Here, we present APTANI, a computational tool to identify target-specific aptamers from HT-SELEX data and secondary structure information. APTANI builds on AptaMotif algorithm, originally implemented to analyze SELEX data; extends the applicability of AptaMotif to HT-SELEX data and introduces new functionalities, as the possibility to identify binding motifs, to cluster aptamer families or to compare output results from different HT-SELEX cycles. Tabular and graphical representations facilitate the downstream biological interpretation of results. Availability and implementation: APTANI is available at http://aptani.unimore.it. Contact: Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Caroli J."
                    },
                    {
                        "name": "Taccioli C."
                    },
                    {
                        "name": "De La Fuente A."
                    },
                    {
                        "name": "Serafini P."
                    },
                    {
                        "name": "Bicciato S."
                    }
                ],
                "citationCount": 19,
                "date": "2016-01-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "APTANI: A computational tool to select aptamers through sequence-structure motif analysis of HT-SELEX data"
            },
            "pmid": "26395772"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Nucleic acid structure analysis",
            "uri": "http://edamontology.org/topic_0097"
        },
        {
            "term": "Nucleic acid sites, features and motifs",
            "uri": "http://edamontology.org/topic_3511"
        }
    ],
    "validated": 1
}