{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2022-08-20T11:20:28.067872Z",
    "biotoolsCURIE": "biotools:dqtg-seq",
    "biotoolsID": "dqtg-seq",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "soyzhang@mail.hzau.edu.cn",
            "name": "Yuan-Ming Zhang",
            "typeEntity": "Person"
        }
    ],
    "description": "Bulked segregant analysis methods are used to identify various types of quantitative trait loci for complex traits via extreme phenotype individuals in bi-parental segregation populations (F2, backcross, doubled haploid and recombinant inbred line).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://cran.r-project.org/web/packages/dQTG.seq/index.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-08-20T11:20:28.071198Z",
    "license": "GPL-2.0",
    "name": "dQTG-seq",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.CSBJ.2022.05.009",
            "metadata": {
                "abstract": "© 2022 The Author(s)Although methodologies and software packages for bulked segregant analysis (BSA) are well established, it is difficult to detect extremely over-dominant and small-effect genes for quantitative traits in F2 population. To address this issue, we proposed a combinatorial strategy to identify all types of quantitative trait loci (QTLs) using extreme phenotype individuals in F2. To popularize this strategy, we developed an R software package dQTG.seq v1.0.1. It has some features not found in other BSA software packages: 1) new (dQTG-seq1 and dQTG-seq2) and existing (G', deltaSNP, Euclidean distance (ED), and SmoothLOD) methods are available to identify all types of QTLs in bi-parental segregation populations, one data file with two BSA and three QTL-mapping data formats was inputted, and two *.csv files and one figure were outputted; 2) main smoothing methods (AIC, Window size, and Block) have been incorporated into each of the above-mentioned methods; 3) the threshold value of LOD score for significant QTLs is determined by permutation experiments. To save running time, vroom function was used to read the dataset, and parallel operation was used to estimate parameters. In real data analyses, users should select a suitable initial value of window size, depending on the species, and appropriate smoothing methods to obtain the best result. dQTG-seq2 detects more known loci and genes for rice grain number per panicle than composite interval mapping (CIM) and inclusive CIM, especially extremely over-dominant and small-effect genes. A handbook for our software package (https://cran.r-project.org/web/packages/dQTG.seq/index.html) has been provided in the supplemental materials for the users' convenience.",
                "authors": [
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Pan Y.-F."
                    },
                    {
                        "name": "Wei L.-Q."
                    },
                    {
                        "name": "Zhang Y.-M."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "Computational and Structural Biotechnology Journal",
                "title": "dQTG.seq: A comprehensive R tool for detecting all types of QTLs using extreme phenotype individuals in bi-parental segregation populations"
            },
            "pmcid": "PMC9120062",
            "pmid": "35615028"
        },
        {
            "doi": "10.1016/J.XPLC.2022.100319",
            "metadata": {
                "abstract": "© 2022 The Author(s)Theoretical and applied studies demonstrate the difficulty of detecting extremely over-dominant and small-effect genes for quantitative traits via bulked segregant analysis (BSA) in an F2 population. To address this issue, we proposed an integrated strategy for mapping various types of quantitative trait loci (QTLs) for quantitative traits via a combination of BSA and whole-genome sequencing. In this strategy, the numbers of read counts of marker alleles in two extreme pools were used to predict the numbers of read counts of marker genotypes. These observed and predicted numbers were used to construct a new statistic, Gw, for detecting quantitative trait genes (QTGs), and the method was named dQTG-seq1. This method was significantly better than existing BSA methods. If the goal was to identify extremely over-dominant and small-effect genes, another reserved DNA/RNA sample from each extreme phenotype F2 plant was sequenced, and the observed numbers of marker alleles and genotypes were used to calculate Gw to detect QTGs; this method was named dQTG-seq2. In simulated and real rice dataset analyses, dQTG-seq2 could identify many more extremely over-dominant and small-effect genes than BSA and QTL mapping methods. dQTG-seq2 may be extended to other heterogeneous mapping populations. The significance threshold of Gw in this study was determined by permutation experiments. In addition, a handbook for the R software dQTG.seq, which is available at https://cran.r-project.org/web/packages/dQTG.seq/index.html, has been provided in the supplemental materials for the users’ convenience. This study provides a new strategy for identifying all types of QTLs for quantitative traits in an F2 population.",
                "authors": [
                    {
                        "name": "Li G."
                    },
                    {
                        "name": "Li P."
                    },
                    {
                        "name": "Liu J.-Y."
                    },
                    {
                        "name": "Zhang Y.-M."
                    },
                    {
                        "name": "Zhang Y.-W."
                    },
                    {
                        "name": "Zuo J.-F."
                    }
                ],
                "citationCount": 2,
                "date": "2022-05-09T00:00:00Z",
                "journal": "Plant Communications",
                "title": "A combinatorial strategy to identify various types of QTLs for quantitative traits using extreme phenotype individuals in an F2 population"
            },
            "pmcid": "PMC9251438",
            "pmid": "35576159"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ],
    "validated": 1
}
