{
    "additionDate": "2018-08-12T10:39:15Z",
    "biotoolsCURIE": "biotools:bpac",
    "biotoolsID": "bpac",
    "credit": [
        {
            "email": "jiang.qian@jhmi.edu",
            "name": "Jiang Qian",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Predict of transcription factor binding sites based on chromatin accessibility.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinfo.wilmer.jhu.edu/BPAC/FAQ.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Transcription factor binding site prediction",
                    "uri": "http://edamontology.org/operation_0445"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.wilmer.jhu.edu/BPAC/",
    "lastUpdate": "2024-11-25T14:28:24.874027Z",
    "name": "BPAC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "migle_sur",
    "publication": [
        {
            "doi": "10.1186/s12859-017-1769-7",
            "metadata": {
                "abstract": "Background: Computational prediction of transcription factor (TF) binding sites in different cell types is challenging. Recent technology development allows us to determine the genome-wide chromatin accessibility in various cellular and developmental contexts. The chromatin accessibility profiles provide useful information in prediction of TF binding events in various physiological conditions. Furthermore, ChIP-Seq analysis was used to determine genome-wide binding sites for a range of different TFs in multiple cell types. Integration of these two types of genomic information can improve the prediction of TF binding events. Results: We assessed to what extent a model built upon on other TFs and/or other cell types could be used to predict the binding sites of TFs of interest. A random forest model was built using a set of cell type-independent features such as specific sequences recognized by the TFs and evolutionary conservation, as well as cell type-specific features derived from chromatin accessibility data. Our analysis suggested that the models learned from other TFs and/or cell lines performed almost as well as the model learned from the target TF in the cell type of interest. Interestingly, models based on multiple TFs performed better than single-TF models. Finally, we proposed a universal model, BPAC, which was generated using ChIP-Seq data from multiple TFs in various cell types. Conclusion: Integrating chromatin accessibility information with sequence information improves prediction of TF binding.The prediction of TF binding is transferable across TFs and/or cell lines suggesting there are a set of universal \"rules\". A computational tool was developed to predict TF binding sites based on the universal \"rules\".",
                "authors": [
                    {
                        "name": "Blackshaw S."
                    },
                    {
                        "name": "Liu S."
                    },
                    {
                        "name": "Qian J."
                    },
                    {
                        "name": "Wan J."
                    },
                    {
                        "name": "Wang G."
                    },
                    {
                        "name": "Zibetti C."
                    }
                ],
                "citationCount": 14,
                "date": "2017-07-27T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Assessing the model transferability for prediction of transcription factor binding sites based on chromatin accessibility"
            },
            "pmcid": "PMC5530957",
            "pmid": "28750606",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
