{
    "additionDate": "2020-01-09T17:56:21Z",
    "biotoolsCURIE": "biotools:Cell_fishing",
    "biotoolsID": "Cell_fishing",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "edutp00@gmail.com",
            "name": "E. Tejera",
            "orcidid": "https://orcid.org/0000-0002-1377-0413",
            "typeEntity": "Person"
        }
    ],
    "description": "A similarity based approach and machine learning strategy for multiple cell lines-compound sensitivity prediction.\n\nThe prediction of cell-lines sensitivity to a given set of compounds is a very important factor in the optimization of in-vitro assays. To date, the most common prediction strategies are based upon machine learning or other quantitative structure-activity relationships (QSAR) based approaches. In the present research, we propose and discuss a straightforward strategy not based on any learning modelling but exclusively relying upon the chemical similarity of a query compound to reference compounds with annotated activity against cell lines. We also compare the performance of the proposed method to machine learning predictions on the same problem. A curated database of compounds-cell lines associations derived from ChemBL version 22 was created for algorithm construction and cross-validation.\n\n||| HOMEPAGE BROKEN!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://bioquimio.udla.edu.ec/cellfishing",
    "lastUpdate": "2020-01-09T17:56:21Z",
    "name": "Cell fishing",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0223276",
            "metadata": {
                "abstract": "© 2019 Tejera et al.The prediction of cell-lines sensitivity to a given set of compounds is a very important factor in the optimization of in-vitro assays. To date, the most common prediction strategies are based upon machine learning or other quantitative structure-activity relationships (QSAR) based approaches. In the present research, we propose and discuss a straightforward strategy not based on any learning modelling but exclusively relying upon the chemical similarity of a query compound to reference compounds with annotated activity against cell lines. We also compare the performance of the proposed method to machine learning predictions on the same problem. A curated database of compounds-cell lines associations derived from ChemBL version 22 was created for algorithm construction and cross-validation. Validation was done using 10-fold cross-validation and testing the models on new data obtained from ChemBL version 25. In terms of accuracy, both methods perform similarly with values around 0.65 across 750 cell lines in 10-fold cross-validation experiments. By combining both methods it is possible to achieve 66% of correct classification rate in more than 26000 newly reported interactions comprising 11000 new compounds. A Web Service implementing the described approaches (both similarity and machine learning based models) is freely available at: Http://bioquimio.udla.edu.ec/cellfishing.",
                "authors": [
                    {
                        "name": "Tejera E."
                    },
                    {
                        "name": "Carrera I."
                    },
                    {
                        "name": "Jimenes-Vargas K."
                    },
                    {
                        "name": "Armijos-Jaramillo V."
                    },
                    {
                        "name": "Sanchez-Rodriguez A."
                    },
                    {
                        "name": "Cruz-Monteagudo M."
                    },
                    {
                        "name": "Perez-Castillo Y."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Cell fishing: A similarity based approach and machine learning strategy for multiple cell lines-compound sensitivity prediction"
            },
            "pmcid": "PMC6779297",
            "pmid": "31589649"
        }
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        }
    ]
}