{
    "additionDate": "2017-03-24T14:34:16Z",
    "biotoolsCURIE": "biotools:primers4clades",
    "biotoolsID": "primers4clades",
    "credit": [
        {
            "email": "vinuesa@ccg.unam.mx",
            "name": "Pablo Vinuesa",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Primers4clades is a web server that uses phylogenetic trees to design primers to amplify novel sequences from across species using metagenomic DNA or from uncharacterized organisms. Beginning with a set of non-aligned protein coding genes, primers4clades aligns the sequences, computes a neighbor-joining tree and designs lineage specific primers for the user selected species or sequence clusters.",
    "documentation": [
        {
            "type": "General",
            "url": "http://maya.ccg.unam.mx/primers4clades/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Tree-based sequence alignment",
                    "uri": "http://edamontology.org/operation_0499"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Primer and probe design",
                    "uri": "http://edamontology.org/operation_2419"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://maya.ccg.unam.mx/primers4clades/",
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "primers4clades",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Primers4clades is an easy-to-use web server that implements a fully automatic PCR primer design pipeline for cross-species amplification of novel sequences from metagenomic DNA, or from uncharacterized organisms, belonging to user-specified phylogenetic clades or taxa. The server takes a set of non-aligned protein coding genes, with or without introns, aligns them and computes a neighbor-joining tree, which is displayed on screen for easy selection of species or sequence clusters to design lineage-specific PCR primers. Primers4clades implements an extended CODEHOP primer design strategy based on both DNA and protein multiple sequence alignments. It evaluates several thermodynamic properties of the oligonucleotide pairs, and computes the phylogenetic information content of the predicted amplicon sets from Shimodaira-Hasegawa-like branch support values of maximum likelihood phylogenies. A non-redundant set of primer formulations is returned, ranked according to their thermodynamic properties. An amplicon distribution map provides a convenient overview of the coverage of the target locus. Altogether these features greatly help the user in making an informed choice between alternative primer pair formulations. Primers4clades is available at two mirror sites: http://maya.ccg.unam.mx/ primers4clades/ and http://maya.ccg.unam.mx/primers4clades/ and http://floresta.eead.csic.es/primers4clades/. Three demo data sets and a comprehensive documentation/tutorial page are provided for easy testing of the server's capabilities and interface.",
                "authors": [
                    {
                        "name": "Contreras-Moreira B."
                    },
                    {
                        "name": "Sachman-Ruiz B."
                    },
                    {
                        "name": "Figueroa-Palacios I."
                    },
                    {
                        "name": "Vinuesa P."
                    }
                ],
                "citationCount": 21,
                "date": "2009-08-04T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "primers4clades: A web server that uses phylogenetic trees to design lineage-specific PCR primers for metagenomic and diversity studies"
            },
            "pmid": "19465390"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Phylogeny",
            "uri": "http://edamontology.org/topic_0084"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        }
    ],
    "validated": 1
}