{
    "additionDate": "2020-01-14T09:52:37Z",
    "biotoolsCURIE": "biotools:GE_LDA_Survival",
    "biotoolsID": "GE_LDA_Survival",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rgreiner@ualberta.ca",
            "name": "Russell Greiner",
            "typeEntity": "Person"
        }
    ],
    "description": "Gene expression based survival prediction for cancer patients.\n\nGene Expression based Survival Prediction for Cancer Patients – A Topic Modeling Approach.\n\nThis repository includes source code from the publication Gene Expression based Survival Prediction for Cancer Patients – A Topic Modeling Approach.\n\nYou can find the code for the MTLR algorithm here http://pssp.srv.ualberta.ca/home/about.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Expression data visualisation",
                    "uri": "http://edamontology.org/operation_0571"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/nitsanluke/GE-LDA-Survival",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-17T09:46:39Z",
    "link": [
        {
            "type": [
                "Helpdesk"
            ],
            "url": "http://pssp.srv.ualberta.ca/home/about"
        }
    ],
    "name": "GE LDA Survival",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0224446",
            "metadata": {
                "abstract": "© 2019 Kumar, Greiner. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.Cancer is one of the leading cause of death, worldwide. Many believe that genomic data will enable us to better predict the survival time of these patients, which will lead to better, more personalized treatment options and patient care. As standard survival prediction models have a hard time coping with the high-dimensionality of such gene expression data, many projects use some dimensionality reduction techniques to overcome this hurdle. We introduce a novel methodology, inspired by topic modeling from the natural language domain, to derive expressive features from the high-dimensional gene expression data. There, a document is represented as a mixture over a relatively small number of topics, where each topic corresponds to a distribution over the words; here, to accommodate the heterogeneity of a patient's cancer, we represent each patient (~ document) as a mixture over cancer-topics, where each cancer-topic is a mixture over gene expression values (~ words). This required some extensions to the standard LDA model-e.g., to accommodate the real-valued expression values-leading to our novel discretized Latent Dirichlet Allocation (dLDA) procedure. After using this dLDA to learn these cancer-topics, we can then express each patient as a distribution over a small number of cancer-topics, then use this low-dimensional \"distribution vector\" as input to a learning algorithm-here, we ran the recent survival prediction algorithm, MTLR, on this representation of the cancer dataset. We initially focus on the METABRIC dataset, which describes each of n = 1,981 breast cancer patients using the r = 49,576 gene expression values, from microarrays. Our results show that our approach (dLDA followed by MTLR) provides survival estimates that are more accurate than standard models, in terms of the standard Concordance measure. We then validate this \"dLDA +MTLR\" approach by running it on the n = 883 Pan-kidney (KIPAN) dataset, over r = 15,529 gene expression values-here using the mRNAseq modality-and find that it again achieves excellent results. In both cases, we also show that the resulting model is calibrated, using the recent \"D-calibrated\" measure. These successes, in two different cancer types and expression modalities, demonstrates the generality, and the effectiveness, of this approach. The dLDA+MTLR source code is available at https://github.com/nitsanluke/GELDA- Survival.",
                "authors": [
                    {
                        "name": "Kumar L."
                    },
                    {
                        "name": "Greiner R."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Gene expression based survival prediction for cancer patients-A topic modeling approach"
            },
            "pmcid": "PMC6857918",
            "pmid": "31730620"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Surgery",
            "uri": "http://edamontology.org/topic_3421"
        }
    ],
    "validated": 1
}