{
    "accessibility": "Open access",
    "additionDate": "2022-01-28T15:28:30.934047Z",
    "biotoolsCURIE": "biotools:big-map",
    "biotoolsID": "big-map",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "fischbach@fischbachgroup.org",
            "name": "Michael A. Fischbach",
            "orcidid": "https://orcid.org/0000-0003-3079-8247",
            "typeEntity": "Person"
        },
        {
            "email": "marnix.medema@wur.nl",
            "name": "Marnix H. Medema",
            "orcidid": "https://orcid.org/0000-0002-2191-2821",
            "typeEntity": "Person"
        }
    ],
    "description": "The Biosynthetic Gene cluster Meta’omics abundance Profiler (BiG-MAP). A command-line tool that it is able to profile the abundance and expression of a collection of gene clusters across metagenomic and metatranscriptomic data from any kind of biome, including human, plant, animal, marine, and soil microbiomes.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Functional clustering",
                    "uri": "http://edamontology.org/operation_3459"
                }
            ]
        }
    ],
    "homepage": "https://github.com/medema-group/BiG-MAP",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-01-28T15:28:30.936597Z",
    "license": "MIT",
    "name": "BiG-MAP",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1128/MSYSTEMS.00937-21",
            "metadata": {
                "abstract": "© 2021 Pascal Andreu et al.Microbial gene clusters encoding the biosynthesis of primary and secondary metabolites play key roles in shaping microbial ecosystems and driving microbiome-associated phenotypes. Although effective approaches exist to evaluate the metabolic potential of such bacteria through identification of these metabolic gene clusters in their genomes, no automated pipelines exist to profile the abundance and expression levels of such gene clusters in microbiome samples to generate hypotheses about their functional roles, and to find associations with phenotypes of interest. Here, we describe BiG-MAP, a bioinformatic tool to profile abundance and expression levels of gene clusters across metagenomic and metatranscriptomic data and evaluate their differential abundance and expression under different conditions. To illustrate its usefulness, we analyzed 96 metagenomic samples from healthy and caries-associated human oral microbiome samples and identified 252 gene clusters, including unreported ones, that were significantly more abundant in either phenotype. Among them, we found the muc operon, a gene cluster known to be associated with tooth decay. Additionally, we found a putative reuterin biosynthetic gene cluster from a Streptococcus strain to be enriched but not exclusively found in healthy samples; metabolomic data from the same samples showed masses with fragmentation patterns consistent with (poly)acrolein, which is known to spontaneously form from the products of the reuterin pathway and has been previously shown to inhibit pathogenic Streptococcus mutans strains. Thus, we show how BiG-MAP can be used to generate new hypotheses on potential drivers of microbiome-associated phenotypes and prioritize the experimental characterization of relevant gene clusters that may mediate them.",
                "authors": [
                    {
                        "name": "Andreu V.P."
                    },
                    {
                        "name": "Augustijn H.E."
                    },
                    {
                        "name": "van den Berg K."
                    },
                    {
                        "name": "van der Hooft J.J.J."
                    },
                    {
                        "name": "Fischbach M.A."
                    },
                    {
                        "name": "Medema M.H."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "mSystems",
                "title": "Big-map: An automated pipeline to profile metabolic gene cluster abundance and expression in microbiomes"
            },
            "pmcid": "PMC8547482",
            "pmid": "34581602"
        }
    ],
    "toolType": [
        "Workflow",
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Metatranscriptomics",
            "uri": "http://edamontology.org/topic_3941"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Metagenomics",
            "uri": "http://edamontology.org/topic_3174"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        }
    ]
}