{
    "additionDate": "2015-01-22T11:40:39Z",
    "biotoolsCURIE": "biotools:simbionet",
    "biotoolsID": "simbionet",
    "credit": [
        {
            "name": "ELIXIR-ITA-PADOVA",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "barbara.dicamillo@unipd.it",
            "name": "Barbara Di Camillo",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www.dei.unipd.it/~dicamill/"
        }
    ],
    "description": "Simulator of biological networks topology in which module structures of different type and size are replicated at different level of network organization and interconnected, so to obtain the desired (i.e. given as input) degree distribution, e.g. scale free, and a clustering coefficient constant with the number of nodes in the network, a typical characteristic of biological networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://www.medcomp.medicina.unipd.it/bioing/simbionet/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "note": "SimBioNeT is a simulator of biological networks topology in which module structures of different type and size are replicated at different level of network organization and interconnected, so to obtain the desired (i.e. given as input) degree distribution, e.g. scale free, and a clustering coefficient constant with the number of nodes in the network, a typical characteristic of biological networks.",
            "operation": [
                {
                    "term": "Network simulation",
                    "uri": "http://edamontology.org/operation_3562"
                }
            ]
        }
    ],
    "homepage": "http://www.medcomp.medicina.unipd.it/bioing/simbionet/",
    "homepage_status": 1,
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:50Z",
    "license": "GPL-2.0",
    "name": "SimBioNeT",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-ITA-PADOVA",
    "publication": [
        {
            "doi": "10.1109/TCBB.2011.116",
            "metadata": {
                "abstract": "Studying biological networks at topological level is a major issue in computational biology studies and simulation is often used in this context, either to assess reverse engineering algorithms or to investigate how topological properties depend on network parameters. In both contexts, it is desirable for a topology simulator to reproduce the current knowledge on biological networks, to be able to generate a number of networks with the same properties and to be flexible with respect to the possibility to mimic networks of different organisms. We propose a biological network topology simulator, SimBioNeT, in which module structures of different type and size are replicated at different level of network organization and interconnected, so to obtain the desired degree distribution, e.g., scale free, and a clustering coefficient constant with the number of nodes in the network, a typical characteristic of biological networks. Empirical assessment of the ability of the simulator to reproduce characteristic properties of biological network and comparison with E. coli and S. cerevisiae transcriptional networks demonstrates the effectiveness of our proposal. © 2012 IEEE.",
                "authors": [
                    {
                        "name": "Di Camillo B."
                    },
                    {
                        "name": "Falda M."
                    },
                    {
                        "name": "Toffolo G."
                    },
                    {
                        "name": "Cobelli C."
                    }
                ],
                "citationCount": 3,
                "date": "2012-02-06T00:00:00Z",
                "journal": "IEEE/ACM Transactions on Computational Biology and Bioinformatics",
                "title": "SimBioNeT: A simulator of biological network topology"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        }
    ],
    "validated": 1,
    "version": [
        "1.2"
    ]
}