{
    "additionDate": "2017-08-03T18:43:37Z",
    "biotoolsCURIE": "biotools:fluxviz",
    "biotoolsID": "fluxviz",
    "credit": [
        {
            "email": "matthias.koenig@charite.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Open-source Cytoscape plug-in for the visualization of flux distributions in molecular interaction networks.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://apps.cytoscape.org/apps/fluxviz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "http://apps.cytoscape.org/apps/fluxviz",
    "lastUpdate": "2018-12-10T12:58:45Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/fluxviz-0-14-cytoscape-plugin-flux-visualization.html"
        }
    ],
    "name": "FluxViz",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Methods like FBA and kinetic modeling are widely used to calculate fluxes in metabolic networks. For the analysis and understanding of simulation results and experimentally measured fluxes visualization software within the network context is indispensable. We present Flux Viz, an open-source Cytoscape plug-in for the visualization of flux distributions in molecular interaction networks. FluxViz supports (i) import of networks in a variety of formats (SBML, GML, XGMML, SIF, BioPAX, PSI-MI) (ii) import of flux distributions as CSV, Cytoscape attributes or VAL files (iii) limitation of views to flux carrying reactions (flux subnetwork) or network attributes like localization (iv) export of generated views (SVG, EPS, PDF, BMP, PNG). Though FluxViz was primarily developed as tool for the visualization of fluxes in metabolic networks and the analysis of simulation results from FASIMU, a flexible software for batch flux-balance computation in large metabolic networks, it is not limited to biochemical reaction networks and FBA but can be applied to the visualization of arbitrary fluxes in arbitrary graphs. The platform-independent program is an open-source project, freely available at http://sourceforge.net/projects/fluxvizplugin/ under GNU public license, including manual, tutorial and examples.",
                "authors": [
                    {
                        "name": "Konig M."
                    },
                    {
                        "name": "Holzhutter H.G."
                    }
                ],
                "citationCount": 17,
                "date": "2010-01-01T00:00:00Z",
                "journal": "Genome informatics. International Conference on Genome Informatics",
                "title": "Fluxviz - Cytoscape plug-in for visualization of flux distributions in networks."
            },
            "pmid": "22081592"
        }
    ],
    "toolType": [
        "Plug-in"
    ],
    "topic": [
        {
            "term": "Systems biology",
            "uri": "http://edamontology.org/topic_2259"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        }
    ],
    "validated": 1
}