{
    "additionDate": "2021-01-18T10:23:17Z",
    "biotoolsCURIE": "biotools:xylotron",
    "biotoolsID": "xylotron",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "pravindran@wisc.edu",
            "name": "Prabu Ravindran",
            "typeEntity": "Person"
        }
    ],
    "description": "Flexible, Open-Source, Image-Based Macroscopic Field Identification of Wood Products.\n\nForests, estimated to contain two thirds of the world's biodiversity, face existential threats due to illegal logging and land conversion. Efforts to combat illegal logging and to support sustainable value chains are hampered by a critical lack of affordable and scalable technologies for field-level inspection of wood and wood products. To meet this need we present the XyloTron, a complete, self-contained, multi-illumination, field-deployable, open-source platform for field imaging and identification of forest products at the macroscopic scale. The XyloTron platform integrates an imaging system built with off-the-shelf components, flexible illumination options with visible and UV light sources, software for camera control, and deep learning models for identification",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                }
            ]
        }
    ],
    "homepage": "https://github.com/fpl-xylotron",
    "lastUpdate": "2021-03-18T11:42:03Z",
    "name": "XyloTron",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.3389/FPLS.2020.01015",
            "metadata": {
                "abstract": "© Copyright © 2020 Ravindran, Thompson, Soares and Wiedenhoeft.Forests, estimated to contain two thirds of the world’s biodiversity, face existential threats due to illegal logging and land conversion. Efforts to combat illegal logging and to support sustainable value chains are hampered by a critical lack of affordable and scalable technologies for field-level inspection of wood and wood products. To meet this need we present the XyloTron, a complete, self-contained, multi-illumination, field-deployable, open-source platform for field imaging and identification of forest products at the macroscopic scale. The XyloTron platform integrates an imaging system built with off-the-shelf components, flexible illumination options with visible and UV light sources, software for camera control, and deep learning models for identification. We demonstrate the capabilities of the XyloTron platform with example applications for automatic wood and charcoal identification using visible light and human-mediated wood identification based on ultra-violet illumination and discuss applications in field imaging, metrology, and material characterization of other substrates.",
                "authors": [
                    {
                        "name": "Ravindran P."
                    },
                    {
                        "name": "Thompson B.J."
                    },
                    {
                        "name": "Soares R.K."
                    },
                    {
                        "name": "Wiedenhoeft A.C."
                    }
                ],
                "citationCount": 1,
                "date": "2020-07-10T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "The XyloTron: Flexible, Open-Source, Image-Based Macroscopic Field Identification of Wood Products"
            },
            "pmcid": "PMC7366520",
            "pmid": "32754178"
        }
    ],
    "topic": [
        {
            "term": "Biodiversity",
            "uri": "http://edamontology.org/topic_3050"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ]
}