{
    "additionDate": "2021-03-19T08:56:35Z",
    "biotoolsCURIE": "biotools:cenet-omnibus",
    "biotoolsID": "cenet-omnibus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "lgao@mail.xidian.edu.cn",
            "name": "Lin Gao",
            "orcidid": "https://orcid.org/0000-0001-6396-0787",
            "typeEntity": "Person"
        }
    ],
    "description": "CeNet Omnibus is an R/Shiny application to the construction and analysis of competing endogenous RNA network.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene expression profiling",
                    "uri": "http://edamontology.org/operation_0314"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                }
            ]
        }
    ],
    "homepage": "https://github.com/GaoLabXDU/CeNetOmnibus",
    "language": [
        "R",
        "JavaScript"
    ],
    "lastUpdate": "2021-04-22T14:21:45.257451Z",
    "license": "MIT",
    "name": "CeNet Omnibus",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-04012-Y",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: The competing endogenous RNA (ceRNA) regulation is a newly discovered post-transcriptional regulation mechanism and plays significant roles in physiological and pathological progress. CeRNA networks provide global views to help understand the regulation of ceRNAs. CeRNA networks have been widely used to detect survival biomarkers, select candidate regulators of disease genes, and predict long noncoding RNA functions. However, there is no software platform to provide overall functions from the construction to analysis of ceRNA networks. Results: To fill this gap, we introduce CeNet Omnibus, an R/Shiny application, which provides a unified framework for the construction and analysis of ceRNA network. CeNet Omnibus enables users to select multiple measurements, such as Pearson correlation coefficient (PCC), mutual information (MI), and liquid association (LA), to identify ceRNA pairs and construct ceRNA networks. Furthermore, CeNet Omnibus provides a one-stop solution to analyze the topological properties of ceRNA networks, detect modules, and perform gene enrichment analysis and survival analysis. CeNet Omnibus intends to cover comprehensiveness, high efficiency, high expandability, and user customizability, and it also offers a web-based user-friendly interface to users to obtain the output intuitionally. Conclusion: CeNet Omnibus is a comprehensive platform for the construction and analysis of ceRNA networks. It is highly customizable and outputs the results in intuitive and interactive. We expect that CeNet Omnibus will assist researchers to understand the property of ceRNA networks and associated biological phenomena. CeNet Omnibus is an R/Shiny application based on the Shiny framework developed by RStudio. The R package and detailed tutorial are available on our GitHub page with the URL https://github.com/GaoLabXDU/CeNetOmnibus.",
                "authors": [
                    {
                        "name": "Wen X."
                    },
                    {
                        "name": "Gao L."
                    },
                    {
                        "name": "Song T."
                    },
                    {
                        "name": "Jiang C."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CeNet Omnibus: an R/Shiny application to the construction and analysis of competing endogenous RNA network"
            },
            "pmcid": "PMC7890952",
            "pmid": "33602117"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        }
    ]
}