
{
    "credit": [
        {
            "name": "Sriganesh Srihari",
            "typeRoles": [
            ]
        },
        {
            "email": "s.srihari@uq.edu.au",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://sites.google.com/site/contourv2/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "Computational biology",
                "uri": "http://edamontology.org/topic_3307"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2014 Srihari et al.; licensee BioMed Central Ltd. Background: Differential expression analysis of (individual) genes is often used to study their roles in diseases. However, diseases such as cancer are a result of the combined effect of multiple genes. Gene products such as proteins seldom act in isolation, but instead constitute stable multi-protein complexes performing dedicated functions. Therefore, complexes aggregate the effect of individual genes (proteins) and can be used to gain a better understanding of cancer mechanisms. Here, we observe that complexes show considerable changes in their expression, in turn directed by the concerted action of transcription factors (TFs), across cancer conditions. We seek to gain novel insights into cancer mechanisms through a systematic analysis of complexes and their transcriptional regulation. Results: We integrated large-scale protein-interaction (PPI) and gene-expression datasets to identify complexes that exhibit significant changes in their expression across different conditions in cancer. We devised a log-linear model to relate these changes to the differential regulation of complexes by TFs. The application of our model on two case studies involving pancreatic and familial breast tumour conditions revealed: (i) complexes in core cellular processes, especially those responsible for maintaining genome stability and cell proliferation (e.g. DNA damage repair and cell cycle) show considerable changes in expression; (ii) these changes include decrease and countering increase for different sets of complexes indicative of compensatory mechanisms coming into play in tumours; and (iii) TFs work in cooperative and counteractive ways to regulate these mechanisms. Such aberrant complexes and their regulating TFs play vital roles in the initiation and progression of cancer. Conclusions: Complexes in core cellular processes display considerable decreases and countering increases in expression, strongly reflective of compensatory mechanisms in cancer. These changes are directed by the concerted action of cooperative and counteractive TFs. Our study highlights the roles of these complexes and TFs and presents several case studies of compensatory processes, thus providing novel insights into cancer mechanisms.",
            "authors": [
                "Srihari S.",
                "Madhamshettiwar P.B.",
                "Song S.",
                "Liu C.",
                "Simpson P.T.",
                "Khanna K.K.",
                "Ragan M.A."
            ],
            "cit_count": 4,
            "journal": "BMC Systems Biology",
            "pmid": "25521701",
            "title": "Complex-based analysis of dysregulated cellular processes in cancer",
            "year": "2014-12-08"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:contourv2",
        "biotoolsID": "contourv2",
        "description": "Protein complex-based analysis of dysregulated cellular processes in cancer.",
        "homepage": "https://sites.google.com/site/contourv2/",
        "name": "CONTOURv2",
        "version": [
            "V2"
        ]
    }
}