
{
    "credit": [
        {
            "name": "ELIXIR-ITA-SAPIENZA",
            "typeEntity": "Institute",
            "typeRoles": [
                "Provider"
            ]
        },
        {
            "email": "pierpaolo.olimpieri@gmail.com",
            "name": "Pier Paolo Olimpieri",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://circe.med.uniroma1.it/tabhu/help.php"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein sequence",
                        "uri": "http://edamontology.org/data_2976"
                    }
                }
            ],
            "note": "Tool for AntiBody Humanization",
            "operation": [
                {
                    "term": "Protein modelling",
                    "uri": "http://edamontology.org/operation_0477"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    }
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Protein properties",
                "uri": "http://edamontology.org/topic_0123"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Motivation: Antibodies or immunoglobulins are proteins of paramount importance in the immune system. They are extremely relevant as diagnostic, biotechnological and therapeutic tools. Their modular structure makes it easy to re-engineer them for specific purposes. Short of undergoing a trial and error process, these experiments, as well as others, need to rely on an understanding of the specific determinants of the antibody binding mode. Results: In this article, we present a method to identify, on the basis of the antibody sequence alone, which residues of an antibody directly interact with its cognate antigen. The method, based on the random forest automatic learning techniques, reaches a recall and specificity as high as 80% and is implemented as a free and easy-to-use server, named prediction of Antibody Contacts. We believe that it can be of great help in re-design experiments as well as a guide for molecular docking experiments. The results that we obtained also allowed us to dissect which features of the antibody sequence contribute most to the involvement of specific residues in binding to the antigen. © The Author 2013.",
            "authors": [
                "Olimpieri P.P.",
                "Chailyan A.",
                "Tramontano A.",
                "Marcatili P."
            ],
            "cit_count": 27,
            "doi": "10.1093/bioinformatics/btt369",
            "journal": "Bioinformatics",
            "title": "Prediction of site-specific interactions in antibody-antigen complexes: The proABC method and server",
            "type": "Primary",
            "year": "2013-09-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:tabhu",
        "biotoolsID": "tabhu",
        "description": "Web server for antibody humanisation specifically designed to help researcher in each step of a humanisation experiment. It provides tools to: Select the suitable humane template; Select the grafting region; Predict the non-human and humanised antibody paratope; Select the minimum set of back-mutations to retain the parental binding affinity; Build the three-dimensional humanised antibody model and check its structure.",
        "homepage": "http://www.biocomputing.it/tabhu",
        "name": "Tabhu",
        "version": [
            "1.0"
        ]
    }
}