
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://dmpi.duke.edu/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Linkage analysis",
                    "uri": "http://edamontology.org/operation_0283"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Disease",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Linkage",
                "uri": "http://edamontology.org/topic_0102"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/siblink-3-0-multipoint-linkage-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Genomic screens generally employ a single-locus strategy for linkage analysis, but this may have low power in the presence of epistasis. Ordered subsets analysis (OSA) is a method for conditional linkage analysis using continuous covariates. Methods: We used OSA to evaluate two-locus interactions in the simulated Genetic Analysis Workshop 14 dataset We used all nuclear families ascertained by Aiportu, Karangar, and Danacaa. Using the single-nucleotide polymorphism map, multipoint affected-sibling-pair (ASP) linkage analysis was performed on all 100 replicates for each chromosome using SIBLINK. OSA was used to examine linkage on each chromosome using LOD scores at each 3-cM location on every other chromosome as covariates. Two methods were used to identify positive results: one searching across the entire covariate chromosome, the other conditioning on location of known disease loci. Results: Single-locus linkage analysis revealed very high LOD scores for disease loci D1 through D4, with mean LOD scores over 100 replicates ranging from 4.0 to 7.8. Although OSA did not obscure this linkage evidence, it did not detect the simulated interactions between any of the locus pairs. We found inflated type I error rates using the first OSA method, highlighting the need to correct for multiple comparisons. Therefore, using \"null chromosome pairs\" without simulated disease loci, we calculated a corrected alpha-level. Conclusion: We were unable to detect two-locus interactions using OSA. This may have been due to lack of incorporation of phenotypic subgroups, or because linkage evidence as summarized by LOD scores performs poorly as an OSA covariate. We found inflated type I error rates, but were able to calculate a corrected alpha-level for future analyses employing this strategy to search for two-locus interactions.",
            "authors": [
                "Shah S.H.",
                "Schmidt M.A.",
                "Mei H.",
                "Scott W.K.",
                "Hauser E.R.",
                "Schmidt S."
            ],
            "cit_count": 5,
            "doi": "10.1186/1471-2156-6-S1-S148",
            "journal": "BMC Genetics",
            "title": "Searching for epistatic interactions in nuclear families using conditional linkage analysis",
            "type": "Primary",
            "year": "2005-12-30"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:siblink",
        "biotoolsID": "siblink",
        "description": "Perform multipoint linkage analysis based on estimated IBD sharing between affected sibpairs. IBD sharing is inferred from IBS status, given marker genotypes, frequencies, and locations. Resulting LOD scores are maximized across a grid of possible disease locations and IBD sharing vectors.",
        "homepage": "http://dmpi.duke.edu/siblink-v-30",
        "name": "SIBLINK",
        "version": [
            "3.0"
        ]
    }
}