{
    "accessibility": "Open access",
    "additionDate": "2022-05-23T11:24:17.232719Z",
    "biotoolsCURIE": "biotools:skyline_batch",
    "biotoolsID": "skyline_batch",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "brendanx@u.washington.edu",
            "name": "Brendan X. MacLean",
            "typeEntity": "Person"
        },
        {
            "name": "Alexandra N. Marsh",
            "orcidid": "https://orcid.org/0000-0003-2142-6978"
        },
        {
            "name": "Michael J. MacCoss",
            "orcidid": "https://orcid.org/0000-0003-1853-0256"
        }
    ],
    "description": "Skyline Batch is an application that automates a common Skyline workflow for batch processing Skyline documents. It interacts with Skyline through the command-line, allowing it to import data into a template document, export reports, and run R scripts on those reports without bringing up the Skyline user interface.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://skyline.gs.washington.edu/software/SkylineBatch/SkylineBatchDocumentation.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://skyline.ms/batch.url",
    "lastUpdate": "2022-05-23T11:24:17.235661Z",
    "name": "Skyline Batch",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.JPROTEOME.1C00749",
            "metadata": {
                "abstract": "© 2021 The Authors. Published by American Chemical SocietySkyline Batch is a newly developed Windows forms application that enables the easy and consistent reprocessing of data with Skyline. Skyline has made previous advances in this direction; however, none enable seamless automated reprocessing of local and remote files. Skyline keeps a log of all of the steps that were taken in the document; however, reproducing these steps takes time and allows room for human error. Skyline also has a command-line interface, enabling it to be run from a batch script, but using the program in this way requires expertise in editing these scripts. By formalizing the workflow of a highly used set of batch scripts into an intuitive and powerful user interface, Skyline Batch can reprocess data stored in remote repositories just by opening and running a Skyline Batch configuration file. When run, a Skyline Batch configuration downloads all necessary remote files and then runs a four-step Skyline workflow. By condensing the steps needed to reprocess the data into one file, Skyline Batch gives researchers the opportunity to publish their processing along with their data and other analysis files. These easily run configuration files will greatly increase the transparency and reproducibility of published work. Skyline Batch is freely available at https://skyline.ms/batch.url.",
                "authors": [
                    {
                        "name": "MacCoss M.J."
                    },
                    {
                        "name": "MacLean B.X."
                    },
                    {
                        "name": "Mani S.K."
                    },
                    {
                        "name": "Marsh A.N."
                    },
                    {
                        "name": "Sharma V."
                    },
                    {
                        "name": "Vitek O."
                    }
                ],
                "date": "2022-01-07T00:00:00Z",
                "journal": "Journal of Proteome Research",
                "title": "Skyline Batch: An Intuitive User Interface for Batch Processing with Skyline"
            },
            "pmcid": "PMC8749956",
            "pmid": "34919405"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ]
}
