{
    "additionDate": "2021-01-18T11:29:27Z",
    "biotoolsCURIE": "biotools:unmix-me",
    "biotoolsID": "unmix-me",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "intesx@rpi.edu",
            "name": "Xavier Intes",
            "orcidid": "https://orcid.org/0000-0001-5868-4845",
            "typeEntity": "Person"
        }
    ],
    "description": "UNMIX-ME (Unmix Multiple Emissions) spectral and lifetime fluorescence unmixing via deep learning.\nDeep Learning for Hyperspectral Fluorescence Lifetime Image (HFLI) Unmixing.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Rarefaction",
                    "uri": "http://edamontology.org/operation_3797"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jasontsmith2718/UNMIX-ME",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-03-09T18:17:10Z",
    "name": "UNMIX-ME",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1364/BOE.391992",
            "metadata": {
                "abstract": "© 2020 Optical Society of America.Hyperspectral fluorescence lifetime imaging allows for the simultaneous acquisition of spectrally resolved temporal fluorescence emission decays. In turn, the acquired rich multidimensional data set enables simultaneous imaging of multiple fluorescent species for a comprehensive molecular assessment of biotissues. However, to enable quantitative imaging, inherent spectral overlap between the considered fluorescent probes and potential bleed-through must be considered. Such a task is performed via either spectral or lifetime unmixing, typically independently. Herein, we present \"UNMIX-ME\"(unmix multiple emissions), a deep learning-based fluorescence unmixing routine, capable of quantitative fluorophore unmixing by simultaneously using both spectral and temporal signatures. UNMIX-ME was trained and validated using an in silico framework replicating the data acquisition process of a compressive hyperspectral fluorescent lifetime imaging platform (HMFLI). It was benchmarked against a conventional LSQ method for tri and quadri-exponential simulated samples. Last, UNMIX-ME's potential was assessed for NIR FRET in vitro and in vivo preclinical applications.",
                "authors": [
                    {
                        "name": "Smith J.T."
                    },
                    {
                        "name": "Ochoa M."
                    },
                    {
                        "name": "Intes X."
                    }
                ],
                "citationCount": 8,
                "date": "2020-07-01T00:00:00Z",
                "journal": "Biomedical Optics Express",
                "title": "UNMIX-ME: Spectral and lifetime fluorescence unmixing via deep learning"
            },
            "pmcid": "PMC7510912",
            "pmid": "33014571"
        }
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Data acquisition",
            "uri": "http://edamontology.org/topic_3077"
        }
    ]
}