{"credit":[{"email":"juanf@bsc.es","typeEntity":"Person","typeRoles":["Primary contact"],"url":"https://life.bsc.es/pid/pydock/get_pydock.html"}],"documentation":[{"url":"https://life.bsc.es/pid/pydock/doc/"}],"download":[{"type":"Binaries","url":"https://life.bsc.es/pid/pydock/get_pydock.html"}],"function":[{"input":[{"data":{"term":"Protein complex","uri":"http://edamontology.org/data_2877"},"format":[{"term":"PDB","uri":"http://edamontology.org/format_1476"}]}],"operation":[{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}],"output":[{"data":{"term":"Protein complex","uri":"http://edamontology.org/data_2877"},"format":[{"term":"PDB","uri":"http://edamontology.org/format_1476"}]}]}],"labels":{"cost":"Free of charge (with restrictions)","language":["Python"],"license":"Proprietary","maturity":"Mature","operatingSystem":["Linux"],"toolType":["Command-line tool"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"}]},"publication":[{"abstract":"The accurate scoring of rigid-body docking orientations represents one of the major difficulties in protein-protein docking prediction. Other challenges are the development of faster and more efficient sampling methods and the introduction of receptor and ligand flexibility during simulations. Overall, good discrimination of near-native docking poses from the very early stages of rigid-body protein docking is essential step before applying more costly interface refinement to the correct docking solutions. Here we explore a simple approach to scoring of rigid-body docking poses, which has been implemented in a program called pyDock. The scheme is based on Coulombic electrostatics with distance dependent dielectric constant, and implicit desolvation energy with atomic solvation parameters previously adjusted for rigid-body protein-protein docking. This scoring function is not highly dependent on specific geometry of the docking poses and therefore can be used in rigid-body docking sets generated by a variety of methods. We have tested the procedure in a large benchmark set of 80 unbound docking cases. The method is able to detect a near-native solution from 12,000 docking poses and place it within the 100 lowest-energy docking solutions in 56% of the cases, in a completely unrestricted manner and without any other additional information. More specifically, a near-native solution will lie within the top 20 solutions in 37% of the cases. The simplicity of the approach allows for a better understanding of the physical principles behind protein-protein association, and provides a fast tool for the evaluation of large sets of rigid-body docking poses in search of the near-native orientation. © 2007 Wiley-Liss, Inc.","authors":["Cheng T.M.-K.","Blundell T.L.","Fernandez-Recio J."],"cit_count":165,"journal":"Proteins: Structure, Function and Genetics","pmid":"17444519","title":"PyDock: Electrostatics and desolvation for effective scoring of rigid-body protein-protein docking","year":"2007-08-01"}],"summary":{"biotoolsCURIE":"biotools:pydock","biotoolsID":"pydock","description":"pyDock is a fast protocol for protein-protein docking which uses electrostatics and desolvation energy to score docking poses generated with FFT-based algorithms.","homepage":"https://life.bsc.es/pid/pydock/","name":"pyDock"}}