{
    "additionDate": "2019-11-14T18:21:54Z",
    "biotoolsCURIE": "biotools:FunVar",
    "biotoolsID": "FunVar",
    "confidence_flag": "tool",
    "description": "A systematic pipeline to unravel the convergence patterns of genetic variants in ASD | A Systematic Pipeline to Unravel the Convergence Patterns of Genetic Variants in Complex Diseases | FunVar (Functional annotation of Variants ) utilizes the existing resources to streamline and to improve the functional enrichment analysis of genetic variants disrupting genes in patients. FunVar, a semi-automated pipeline consist of three different and independent modules",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/lasigeBioTM/FunVar",
    "language": [
        "Python",
        "R"
    ],
    "lastUpdate": "2021-01-04T10:47:42Z",
    "name": "FunVar",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.JBI.2019.103273",
            "metadata": {
                "abstract": "© 2019 Elsevier Inc.In recent years, the technological advances for capturing genetic variation in large populations led to the identification of large numbers of putative or disease-causing variants. However, their mechanistic understanding is lagging far behind and has posed new challenges regarding their relevance for disease phenotypes, particularly for common complex disorders. In this study, we propose a systematic pipeline to infer biological meaning from genetic variants, namely rare Copy Number Variants (CNVs). The pipeline consists of three modules that seek to (1) improve genetic data quality by excluding low confidence CNVs, (2) identify disrupted biological processes, and (3) aggregate similar enriched biological processes terms using semantic similarity. The proposed pipeline was applied to CNVs from individuals diagnosed with Autism Spectrum Disorder (ASD). We found that rare CNVs disrupting brain expressed genes dysregulated a wide range of biological processes, such as nervous system development and protein polyubiquitination. The disrupted biological processes identified in ASD patients were in accordance with previous findings. This coherence with literature indicates the feasibility of the proposed pipeline in interpreting the biological role of genetic variants in complex disease development. The suggested pipeline is easily adjustable at each step and its independence from any specific dataset and software makes it an effective tool in analyzing existing genetic resources. The FunVar pipeline is available at https://github.com/lasigeBioTM/FunVar and includes pre and post processing steps to effectively interpret biological mechanisms of putative disease causing genetic variants.",
                "authors": [
                    {
                        "name": "Asif M."
                    },
                    {
                        "name": "Couto F.M."
                    },
                    {
                        "name": "Vicente A.M."
                    }
                ],
                "date": "2019-10-01T00:00:00Z",
                "journal": "Journal of Biomedical Informatics",
                "title": "FunVar: A systematic pipeline to unravel the convergence patterns of genetic variants in ASD, a paradigmatic complex disease"
            },
            "pmid": "31454647"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        }
    ],
    "validated": 1
}
