{
    "additionDate": "2021-01-18T08:03:26Z",
    "biotoolsCURIE": "biotools:v-sva",
    "biotoolsID": "v-sva",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "leed13@miamioh.edu",
            "name": "Donghyung Lee",
            "typeEntity": "Person"
        },
        {
            "name": "Duygu Ucar",
            "typeEntity": "Person"
        }
    ],
    "description": "Visual Surrogate Variable Analysis (V-SVA). is an R Shiny application for detecting and annotating hidden sources of variation in single-cell RNA-seq data.\n\nTo facilitate the interpretation of surrogate variables detected by algorithms including IA-SVA, SVA, or ZINB-WaVE, we developed an R Shiny application (Visual Surrogate Variable Analysis (V-SVA)) that provides a web-browser interface for the identification and annotation of hidden sources of variation in scRNA-seq data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Dimensionality reduction",
                    "uri": "http://edamontology.org/operation_3935"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://vsva.jax.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-10T13:36:40Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/nlawlor/V-SVA"
        }
    ],
    "name": "V-SVA",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA128",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press.Single-cell RNA-sequencing (scRNA-seq) technology enables studying gene expression programs from individual cells. However, these data are subject to diverse sources of variation, including 'unwanted' variation that needs to be removed in downstream analyses (e.g. batch effects) and 'wanted' or biological sources of variation (e.g. variation associated with a cell type) that needs to be precisely described. Surrogate variable analysis (SVA)-based algorithms, are commonly used for batch correction and more recently for studying 'wanted' variation in scRNA-seq data. However, interpreting whether these variables are biologically meaningful or stemming from technical reasons remains a challenge. To facilitate the interpretation of surrogate variables detected by algorithms including IA-SVA, SVA or ZINB-WaVE, we developed an R Shiny application [Visual Surrogate Variable Analysis (V-SVA)] that provides a web-browser interface for the identification and annotation of hidden sources of variation in scRNA-seq data. This interactive framework includes tools for discovery of genes associated with detected sources of variation, gene annotation using publicly available databases and gene sets, and data visualization using dimension reduction methods. Contact: leed13@miamioh.edu or duygu.ucar@jax.org",
                "authors": [
                    {
                        "name": "Lawlor N."
                    },
                    {
                        "name": "Lee D."
                    },
                    {
                        "name": "Marquez E.J."
                    },
                    {
                        "name": "Ucar D."
                    }
                ],
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "V-SVA: An R Shiny application for detecting and annotating hidden sources of variation in single-cell RNA-seq data"
            },
            "pmcid": "PMC7267827",
            "pmid": "32119082"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
