{
    "additionDate": "2018-08-14T00:59:58Z",
    "biotoolsCURIE": "biotools:anca",
    "biotoolsID": "anca",
    "credit": [
        {
            "email": "chakracs@pitt.edu",
            "name": "S. Chakra Chennubhotla",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "A python package with modules to measure anharmonicity in the form of higher-order statistics and its variation as a function of time, output a storyboard representation of the simulations to identify key anharmonic conformational events, and identify putative anharmonic conformational substates and visualization of transitions between these substates.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://csb.pitt.edu/anca/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "https://csb.pitt.edu/anca/index.html",
    "language": [
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "BSD-3-Clause",
    "name": "ANCA",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1016/j.bpj.2018.03.021",
            "metadata": {
                "abstract": "© 2018 Biophysical SocietyAnharmonicity in time-dependent conformational fluctuations is noted to be a key feature of functional dynamics of biomolecules. Although anharmonic events are rare, long-timescale (μs–ms and beyond) simulations facilitate probing of such events. We have previously developed quasi-anharmonic analysis to resolve higher-order spatial correlations and characterize anharmonicity in biomolecular simulations. In this article, we have extended this toolbox to resolve higher-order temporal correlations and built a scalable Python package called anharmonic conformational analysis (ANCA). ANCA has modules to: 1) measure anharmonicity in the form of higher-order statistics and its variation as a function of time, 2) output a storyboard representation of the simulations to identify key anharmonic conformational events, and 3) identify putative anharmonic conformational substates and visualization of transitions between these substates.",
                "authors": [
                    {
                        "name": "Parvatikar A."
                    },
                    {
                        "name": "Vacaliuc G.S."
                    },
                    {
                        "name": "Ramanathan A."
                    },
                    {
                        "name": "Chennubhotla S.C."
                    }
                ],
                "citationCount": 1,
                "date": "2018-05-08T00:00:00Z",
                "journal": "Biophysical Journal",
                "title": "ANCA: Anharmonic Conformational Analysis of Biomolecular Simulations"
            },
            "pmcid": "PMC5961460",
            "pmid": "29742397",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}