{
    "accessibility": "Open access",
    "additionDate": "2021-01-18T10:22:14Z",
    "biotoolsCURIE": "biotools:easyamber",
    "biotoolsID": "easyamber",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Dmitry Suplatov",
            "typeEntity": "Person"
        }
    ],
    "description": "EasyAmber is a comprehensive toolbox to automate the molecular dynamics simulation of proteins. EasyAmber is a set of wrapper scripts to automate the molecular dynamics routines implemented in the Amber package. The toolbox can address a wide set of tasks in computational biology struggling to account for protein flexibility, and supports the full-atom model building, optimization/equilibration of the molecular system, classical/conventional and accelerated molecular dynamics simulations. The easyAmber software takes the molecular dynamics to the next level in terms of usability for complex processing of large volumes of data. It implements advanced MD protocols, but is highly automated and easy-to-operate to attract a broad audience. The toolbox can be used on a personal desktop station equipped with a gaming GPU-accelerator, as well as help to manage huge workloads on a powerful supercomputer.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Molecular replacement",
                    "uri": "http://edamontology.org/operation_3455"
                }
            ]
        }
    ],
    "homepage": "https://biokinet.belozersky.msu.ru/easyAmber",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2021-03-05T14:55:59Z",
    "license": "GPL-3.0",
    "name": "easyAmber",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1142/S0219720020400119",
            "metadata": {
                "abstract": "© 2020 World Scientific Publishing Europe Ltd.Conformational plasticity of the functionally important regions and binding sites in protein/enzyme structures is one of the key factors affecting their function and interaction with substrates/ligands. Molecular dynamics (MD) can address the challenge of accounting for protein flexibility by predicting the time-dependent behavior of a molecular system. It has a potential of becoming a particularly important tool in protein engineering and drug discovery, but requires specialized training and skills, what impedes practical use by many investigators. We have developed the easyAmber - a comprehensive set of programs to automate the molecular dynamics routines implemented in the Amber package. The toolbox can address a wide set of tasks in computational biology struggling to account for protein flexibility. The automated workflow includes a complete set of steps from the initial \"static\"molecular model to the MD \"production run\": the full-atom model building, optimization/equilibration of the molecular system, classical/conventional and accelerated molecular dynamics simulations. The easyAmber implements advanced MD protocols, but is highly automated and easy-to-operate to attract a broad audience. The toolbox can be used on a personal desktop station equipped with a compatible gaming GPU-accelerator, as well as help to manage huge workloads on a powerful supercomputer. The software provides an opportunity to operate multiple simulations of different proteins at the same time, thus significantly increasing work efficiency. The easyAmber takes the molecular dynamics to the next level in terms of usability for complex processing of large volumes of data, thus supporting the recent trend away from inefficient \"static\"approaches in biology toward a deeper understanding of the dynamics in protein structures. The software is freely available for download at https://biokinet.belozersky.msu.ru/easyAmber, no login required.",
                "authors": [
                    {
                        "name": "Suplatov D."
                    },
                    {
                        "name": "Sharapova Y."
                    },
                    {
                        "name": "Svedas V."
                    }
                ],
                "citationCount": 4,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "EasyAmber: A comprehensive toolbox to automate the molecular dynamics simulation of proteins"
            },
            "pmid": "32833550"
        }
    ],
    "toolType": [
        "Script",
        "Suite"
    ],
    "topic": [
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Protein interactions",
            "uri": "http://edamontology.org/topic_0128"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        }
    ]
}