
{
    "credit": [
        {
            "email": "help@bioplatforms.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "API documentation",
            "url": "https://data.bioplatforms.com/organization/pages/bioplatforms-australia/api-access"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "labels": {
        "cost": "Free of charge",
        "maturity": "Emerging",
        "toolType": [
            "Web API"
        ],
        "topic": [
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2016 Bissett et al. Background: Microbial inhabitants of soils are important to ecosystem and planetary functions, yet there are large gaps in our knowledge of their diversity and ecology. The 'Biomes of Australian Soil Environments' (BASE) project has generated a database of microbial diversity with associated metadata across extensive environmental gradients at continental scale. As the characterisation of microbes rapidly expands, the BASE database provides an evolving platform for interrogating and integrating microbial diversity and function. Findings: BASE currently provides amplicon sequences and associated contextual data for over 900 sites encompassing all Australian states and territories, a wide variety of bioregions, vegetation and land-use types. Amplicons target bacteria, archaea and general and fungal-specific eukaryotes. The growing database will soon include metagenomics data. Data are provided in both raw sequence (FASTQ) and analysed OTU table formats and are accessed via the project's data portal, which provides a user-friendly search tool to quickly identify samples of interest. Processed data can be visually interrogated and intersected with other Australian diversity and environmental data using tools developed by the 'Atlas of Living Australia'. Conclusions: Developed within an open data framework, the BASE project is the first Australian soil microbial diversity database. The database will grow and link to other global efforts to explore microbial, plant, animal, and marine biodiversity. Its design and open access nature ensures that BASE will evolve as a valuable tool for documenting an often overlooked component of biodiversity and the many microbe-driven processes that are essential to sustain soil function and ecosystem services.",
            "authors": [
                "Bissett A.",
                "Fitzgerald A.",
                "Meintjes T.",
                "Mele P.M.",
                "Reith F.",
                "Dennis P.G.",
                "Breed M.F.",
                "Brown B.",
                "Brown M.V.",
                "Brugger J.",
                "Byrne M.",
                "Caddy-Retalic S.",
                "Carmody B.",
                "Coates D.J.",
                "Correa C.",
                "Ferrari B.C.",
                "Gupta V.V.S.R.",
                "Hamonts K.",
                "Haslem A.",
                "Hugenholtz P.",
                "Karan M.",
                "Koval J.",
                "Lowe A.J.",
                "Macdonald S.",
                "McGrath L.",
                "Martin D.",
                "Morgan M.",
                "North K.I.",
                "Paungfoo-Lonhienne C.",
                "Pendall E.",
                "Phillips L.",
                "Pirzl R.",
                "Powell J.R.",
                "Ragan M.A.",
                "Schmidt S.",
                "Seymour N.",
                "Snape I.",
                "Stephen J.R.",
                "Stevens M.",
                "Tinning M.",
                "Williams K.",
                "Yeoh Y.K.",
                "Zammit C.M.",
                "Young A."
            ],
            "cit_count": 37,
            "doi": "10.1186/s13742-016-0126-5",
            "journal": "GigaScience",
            "title": "Introducing BASE: The Biomes of Australian Soil Environments soil microbial diversity database",
            "type": "Other",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bpa_data_portal",
        "biotoolsID": "bpa_data_portal",
        "description": "Data generated through Bioplatforms Australia’s National Framework Initiatives is available via the Bioplatforms Australia Data Portal. \nThe Data Portal API allows programmatic access via the standard CKAN API. The API can be accessed from commonly used programming languages including Python and R.",
        "homepage": "https://data.bioplatforms.com/organization/pages/bioplatforms-australia/api-access",
        "name": "Bioplatforms Australia Data Portal API"
    }
}