{
    "additionDate": "2018-10-06T19:21:49Z",
    "biotoolsCURIE": "biotools:facets",
    "biotoolsID": "facets",
    "credit": [
        {
            "email": "seshanv@mskcc.org",
            "name": "Venkatraman E. Seshan",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "FACETS is an ASCN tool and open-source software with a broad application to whole genome, whole-exome, as well as targeted panel sequencing platforms.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnxtc2tmYWNldHN8Z3g6MTQ5M2I2YTEyNjZlMTJmOA"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence motif comparison",
                    "uri": "http://edamontology.org/operation_0240"
                }
            ]
        }
    ],
    "homepage": "https://sites.google.com/site/mskfacets/",
    "language": [
        "R",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "Other",
    "name": "FACETS",
    "operatingSystem": [
        "Linux",
        "Windows"
    ],
    "owner": "daniel_stefan",
    "publication": [
        {
            "doi": "10.1093/nar/gkw520",
            "metadata": {
                "abstract": "© 2016 The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Allele-specific copy number analysis (ASCN) from next generation sequencing (NGS) data can greatly extend the utility of NGS beyond the identification of mutations to precisely annotate the genome for the detection of homozygous/heterozygous deletions, copy-neutral loss-of-heterozygosity (LOH), allele-specific gains/amplifications. In addition, as targeted gene panels are increasingly used in clinical sequencing studies for the detection of 'actionable' mutations and copy number alterations to guide treatment decisions, accurate, tumor purity-, ploidy- and clonal heterogeneity-adjusted integer copy number calls are greatly needed to more reliably interpret NGS-based cancer gene copy number data in the context of clinical sequencing. We developed FACETS, an ASCN tool and open-source software with a broad application to whole genome, whole-exome, as well as targeted panel sequencing platforms. It is a fully integrated stand-alone pipeline that includes sequencing BAM file post-processing, joint segmentation of total- and allele-specific read counts, and integer copy number calls corrected for tumor purity, ploidy and clonal heterogeneity, with comprehensive output and integrated visualization. We demonstrate the application of FACETS using The Cancer Genome Atlas (TCGA) whole-exome sequencing of lung adenocarcinoma samples. We also demonstrate its application to a clinical sequencing platform based on a targeted gene panel.",
                "authors": [
                    {
                        "name": "Shen R."
                    },
                    {
                        "name": "Seshan V.E."
                    }
                ],
                "citationCount": 202,
                "date": "2016-09-19T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "FACETS: Allele-specific copy number and clonal heterogeneity analysis tool for high-throughput DNA sequencing"
            },
            "pmcid": "PMC5027494",
            "pmid": "27270079",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Human genetics",
            "uri": "http://edamontology.org/topic_3574"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}