{
    "additionDate": "2020-01-09T17:36:07Z",
    "biotoolsCURIE": "biotools:CLINE",
    "biotoolsID": "CLINE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "rallendes@nibiohn.go.jp",
            "name": "Rodolfo S. Allendes Osorio",
            "orcidid": "https://orcid.org/0000-0002-9627-9338",
            "typeEntity": "Person"
        }
    ],
    "description": "a web-tool for the comparison of biological dendrogram structures.\n\nThis project was generated with Angular CLI version 6.0.7.\n\nCLINE (Comparison of bioLogIcal deNdrogram structurEs), is a web-tool specifically designed for the visual comparison of dendrograms, with an emphasis on the display of matching clusters that, even when not isomorphic, can be perceived as having the same biological meaning.\n\nRun ng serve for a dev server. Navigate to http://localhost:4200/. The app will automatically reload if you change any of the source files.\n\nRun ng generate component component-name to generate a new component. You can also use ng generate directive:pipe:service:class:guard:interface:enum:module.\n\n||| COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/targetmine (MIZUGUCHILAB.ORG)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                },
                {
                    "term": "Dendrogram visualisation",
                    "uri": "http://edamontology.org/operation_2938"
                },
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "http://mizuguchilab.org/tools/cline/",
    "lastUpdate": "2020-01-09T17:36:07Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/RodolfoAllendes/cline/"
        },
        {
            "type": [
                "Other"
            ],
            "url": "http://mizuguchilab.org/cline/"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/rodolfoAllendes/cline"
        }
    ],
    "name": "CLINE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-019-3149-Y",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: When visually comparing the results of hierarchical clustering, the differences in the arrangements of components are of special interest. However, in a biological setting, identifying such differences becomes less straightforward, as the changes in the dendrogram structure caused by permuting biological replicates, do not necessarily imply a different biological interpretation. Here, we introduce a visualization tool to help identify biologically similar topologies across different clustering results, even in the presence of replicates. Results: Here we introduce CLINE, an open-access web application that allows users to visualize and compare multiple dendrogram structures, by visually displaying the links between areas of similarity across multiple structures. Through the use of a single page and a simple user interface, the user is able to load and remove structures form the visualization, change some aspects of their display and set the parameters used to match cluster topology across consecutive pairs of dendrograms. Conclusions: We have implemented a web-tool that allows the users to visualize different dendrogram structures, showing not only the structures themselves, but also linking areas of similarity across multiple structures. The software is freely available at http://mizuguchilab.org/tools/cline/. Also, the source code, documentation and installation instructions are available on GitHub at https://github.com/RodolfoAllendes/cline/.",
                "authors": [
                    {
                        "name": "Allendes Osorio R.S."
                    },
                    {
                        "name": "Tripathi L.P."
                    },
                    {
                        "name": "Mizuguchi K."
                    }
                ],
                "date": "2019-10-28T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "CLINE: A web-tool for the comparison of biological dendrogram structures"
            },
            "pmcid": "PMC6819642",
            "pmid": "31660851"
        }
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}