{
    "accessibility": "Open access",
    "additionDate": "2024-05-03T09:02:03.392148Z",
    "biotoolsCURIE": "biotools:scdrugprio",
    "biotoolsID": "scdrugprio",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "mikael.benson@ki.se",
            "name": "Mikael Benson",
            "typeEntity": "Person"
        },
        {
            "name": "Samuel Schäfer",
            "typeEntity": "Person"
        }
    ],
    "description": "A framework for the analysis of single-cell transcriptomics to address multiple problems in precision medicine in immune-mediated inflammatory diseases.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                },
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://github.com/SDTC-CPMed/scDrugPrio",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:01:36.073711Z",
    "name": "scDrugPrio",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/s13073-024-01314-7",
            "metadata": {
                "abstract": "Background: Ineffective drug treatment is a major problem for many patients with immune-mediated inflammatory diseases (IMIDs). Important reasons are the lack of systematic solutions for drug prioritisation and repurposing based on characterisation of the complex and heterogeneous cellular and molecular changes in IMIDs. Methods: Here, we propose a computational framework, scDrugPrio, which constructs network models of inflammatory disease based on single-cell RNA sequencing (scRNA-seq) data. scDrugPrio constructs detailed network models of inflammatory diseases that integrate information on cell type-specific expression changes, altered cellular crosstalk and pharmacological properties for the selection and ranking of thousands of drugs. Results: scDrugPrio was developed using a mouse model of antigen-induced arthritis and validated by improved precision/recall for approved drugs, as well as extensive in vitro, in vivo, and in silico studies of drugs that were predicted, but not approved, for the studied diseases. Next, scDrugPrio was applied to multiple sclerosis, Crohn’s disease, and psoriatic arthritis, further supporting scDrugPrio through prioritisation of relevant and approved drugs. However, in contrast to the mouse model of arthritis, great interindividual cellular and gene expression differences were found in patients with the same diagnosis. Such differences could explain why some patients did or did not respond to treatment. This explanation was supported by the application of scDrugPrio to scRNA-seq data from eleven individual Crohn’s disease patients. The analysis showed great variations in drug predictions between patients, for example, assigning a high rank to anti-TNF treatment in a responder and a low rank in a nonresponder to that treatment. Conclusions: We propose a computational framework, scDrugPrio, for drug prioritisation based on scRNA-seq of IMID disease. Application to individual patients indicates scDrugPrio’s potential for personalised network-based drug screening on cellulome-, genome-, and drugome-wide scales. For this purpose, we made scDrugPrio into an easy-to-use R package (https://github.com/SDTC-CPMed/scDrugPrio).",
                "authors": [
                    {
                        "name": "Benson M."
                    },
                    {
                        "name": "Eklund D."
                    },
                    {
                        "name": "Gawel D."
                    },
                    {
                        "name": "Gustafsson M."
                    },
                    {
                        "name": "Heyn H."
                    },
                    {
                        "name": "Julia A."
                    },
                    {
                        "name": "Kovacs I.A."
                    },
                    {
                        "name": "Li X."
                    },
                    {
                        "name": "Lilja S."
                    },
                    {
                        "name": "Loscalzo J."
                    },
                    {
                        "name": "Marsal S."
                    },
                    {
                        "name": "Schafer S."
                    },
                    {
                        "name": "Smelik M."
                    },
                    {
                        "name": "Sysoev O."
                    },
                    {
                        "name": "Wang H."
                    },
                    {
                        "name": "Zhang H."
                    },
                    {
                        "name": "Zhao Y."
                    }
                ],
                "citationCount": 2,
                "date": "2024-12-01T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "scDrugPrio: a framework for the analysis of single-cell transcriptomics to address multiple problems in precision medicine in immune-mediated inflammatory diseases"
            },
            "pmcid": "PMC10956347",
            "pmid": "38509600"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Pharmacology",
            "uri": "http://edamontology.org/topic_0202"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
