
{
    "credit": [
        {
            "email": "mgi-help@jax.org",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.informatics.jax.org/mgihome/support/mgi_inbox.shtml"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.informatics.jax.org/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Genetic mapping",
                    "uri": "http://edamontology.org/operation_0282"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Java"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genotype and phenotype",
                "uri": "http://edamontology.org/topic_0625"
            },
            {
                "term": "Mapping",
                "uri": "http://edamontology.org/topic_0102"
            },
            {
                "term": "Model organisms",
                "uri": "http://edamontology.org/topic_0621"
            },
            {
                "term": "Pathology",
                "uri": "http://edamontology.org/topic_0634"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            }
        ]
    },
    "publication": [
        {
            "abstract": "The Mouse Genome Database (MGD) is the community model organism database for the laboratory mouse and the authoritative source for phenotype and functional annotations of mouse genes. MGD includes a complete catalog of mouse genes and genome features with integrated access to genetic, genomic and phenotypic information, all serving to further the use of the mouse as a model system for studying human biology and disease. MGD is a major component of the Mouse Genome Informatics (MGI, http://www.informatics.jax.org/) resource. MGD contains standardized descriptions of mouse phenotypes, associations between mouse models and human genetic diseases, extensive integration of DNA and protein sequence data, normalized representation of genome and genome variant information. Data are obtained and integrated via manual curation of the biomedical literature, direct contributions from individual investigators and downloads from major informatics resource centers. MGD collaborates with the bioinformatics community on the development and use of biomedical ontologies such as the Gene Ontology (GO) and the Mammalian Phenotype (MP) Ontology. Major improvements to the Mouse Genome Database include comprehensive update of genetic maps, implementation of new classification terms for genome features, development of a recombinase (cre) portal and inclusion of all alleles generated by the International Knockout Mouse Consortium (IKMC). © The Author(s) 2010.",
            "authors": [
                "Blake J.A.",
                "Bult C.J.",
                "Kadin J.A.",
                "Richardson J.E.",
                "Eppig J.T."
            ],
            "cit_count": 180,
            "journal": "Nucleic Acids Research",
            "pmid": "21051359",
            "title": "The mouse genome database (MGD): Premier model organism resource for mammalian genomics and genetics",
            "year": "2011-01-01"
        },
        {
            "abstract": "The Mouse Genome Database (MGD) (http://www.informatics.jax.org) one component of a community database resource for the laboratory mouse, a key model organism for interpreting the human genome and for understanding human biology. MGD strives to provide an extensively integrated information resource with experimental details annotated from both literature and on-line genomic data sources. MGD curates and presents the consensus representation of genotype (sequence) to phenotype information including highly detailed information about genes and gene products. Primary foci of integration are through representations of relationships between genes, sequences and phenotypes. MGD collaborates with other bioinformatics groups to curate a definitive set of information about the laboratory mouse. Recent developments include a general implementation of database structures for controlled vocabularies and the integration of a phenotype classification system. © Oxford University Press 2001.",
            "authors": [
                "Blake J.A.",
                "Richardson J.E.",
                "Bult C.J.",
                "Kadin J.A.",
                "Eppig J.T.",
                "Baldarelli R.M.",
                "Beal J.S.",
                "Bradt D.W.",
                "Burkart D.L.",
                "Butler N.E.",
                "Campbell J.",
                "Chu T.",
                "Corbani L.E.",
                "Cousins S.",
                "Drabkin H.J.",
                "Dahmen D.",
                "Frazer K.",
                "Garippa D.M.",
                "Goldsmith C.W.",
                "Grant P.L.",
                "Lennon-Pierce M.",
                "Lewis J.",
                "Lu I.",
                "Lutz C.M.",
                "Maltais L.J.",
                "Mani P.",
                "McKenzie L.M.",
                "Li N.",
                "Ormsby J.E.",
                "Planchart A.",
                "Ramachandran S.",
                "Reed D.J.",
                "Shaw D.R.",
                "Smith C.L.",
                "Szauter P.",
                "Vanden Borre P.",
                "Washburn L.",
                "Winslow J."
            ],
            "cit_count": 177,
            "journal": "Nucleic Acids Research",
            "pmid": "12519980",
            "title": "MGD: The mouse genome database",
            "year": "2003-01-01"
        },
        {
            "abstract": "The Mouse Genome Database (MGD) is a major component of the Mouse Genome Informatics (MGI, http://www.informatics.jax.org/) database resource and serves as the primary community model organism database for the laboratory mouse. MGD is the authoritative source for mouse gene, allele and strain nomenclature and for phenotype and functional annotations of mouse genes. MGD contains comprehensive data and information related to mouse genes and their functions, standardized descriptions of mouse phenotypes, extensive integration of DNA and protein sequence data, normalized representation of genome and genome variant information including comparative data on mammalian genes. Data for MGD are obtained from diverse sources including manual curation of the biomedical literature and direct contributions from individual investigator's laboratories and major informatics resource centers, such as Ensembl, UniProt and NCBI. MGD collaborates with the bioinformatics community on the development and use of biomedical ontologies such as the Gene Ontology and the Mammalian Phenotype Ontology. Recent improvements in MGD described here includes integration of mouse gene trap allele and sequence data, integration of gene targeting information from the International Knockout Mouse Consortium, deployment of an MGI Biomart, and enhancements to our batch query capability for customized data access and retrieval. © The Author(s) 2009. Published by Oxford University Press.",
            "authors": [
                "Bult C.J.",
                "Kadin J.A.",
                "Richardson J.E.",
                "Blake J.A.",
                "Eppig J.T."
            ],
            "cit_count": 59,
            "journal": "Nucleic Acids Research",
            "pmid": "19864252",
            "title": "The mouse genome database: Enhancements and updates",
            "year": "2009-10-27"
        },
        {
            "abstract": "The Mouse Genome Database (MGD, http://www .informatics.jax.org) is the international community resource for integrated genetic, genomic and biological data about the laboratory mouse. Data in MGD are obtained through loads from major data providers and experimental consortia, electronic submissions from laboratories and from the biomedical literature. MGD maintains a comprehensive, unified, non-redundant catalog of mouse genome features generated by distilling gene predictions from NCBI, Ensembl and VEGA. MGD serves as the authoritative source for the nomenclature of mouse genes, mutations, alleles and strains. MGD is the primary source for evidence-supported functional annotations for mouse genes and gene products using the Gene Ontology (GO). MGD provides full annotation of phenotypes and human disease associations for mouse models (genotypes) using terms from the Mammalian Phenotype Ontology and disease names from the Online Mendelian Inheritance in Man (OMIM) resource. MGD is freely accessible online through our website, where users can browse and search interactively, access data in bulk using Batch Query or BioMart, download data files or use our web services Application Programming Interface (API). Improvements to MGD include expanded genome feature classifications, inclusion of new mutant allele sets and phenotype associations and extensions of GO to include new relationships and a new stream of annotations via phylogenetic-based approaches. © The Author(s) 2011.",
            "authors": [
                "Eppig J.T.",
                "Blake J.A.",
                "Bult C.J.",
                "Kadin J.A.",
                "Richardson J.E.",
                "Airey M.T.",
                "Anagnostopoulos A.",
                "Babiuk R.",
                "Baldarelli R.M.",
                "Beal J.S.",
                "Bello S.M.",
                "Butler N.E.",
                "Campbell J.",
                "Corbani L.E.",
                "Giannatto S.L.",
                "Dene H.",
                "Dolan M.E.",
                "Drabkin H.R.",
                "Forthofer K.L.",
                "Knowlton M.",
                "Lewis J.R.",
                "McAndrews-Hill M.",
                "McClatchy S.",
                "Miers D.S.",
                "Ni L.",
                "Onda H.",
                "Ormsby J.E.",
                "Recla J.M.",
                "Reed D.J.",
                "Richards-Smith B.",
                "Shaw D.R.",
                "Sinclair R.",
                "Sitnikov D.",
                "Smith C.L.",
                "Tomczuk M.",
                "Washburn L.L.",
                "Zhu Y."
            ],
            "cit_count": 199,
            "journal": "Nucleic Acids Research",
            "pmid": "22075990",
            "title": "The Mouse Genome Database (MGD): Comprehensive resource for genetics and genomics of the laboratory mouse",
            "year": "2012-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:mgd",
        "biotoolsID": "mgd",
        "description": "Community model organism database for the laboratory mouse and the source for phenotype and functional annotations of mouse genes. It includes a complete catalog of mouse genes and genome features with integrated access to genetic, genomic and phenotypic information.",
        "homepage": "http://www.informatics.jax.org/",
        "name": "Mouse Genome Database (MGD)"
    }
}