{
    "accessibility": "Open access",
    "additionDate": "2022-03-01T20:14:48.880121Z",
    "biotoolsCURIE": "biotools:heap.egg",
    "biotoolsID": "heap.egg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "M0829002@cgu.edu.tw",
            "name": "Pei-Hsuan Li"
        },
        {
            "email": "chchiu@adm.cgmh.org.tw",
            "name": "Cheng-Hsun Chiu"
        },
        {
            "email": "petang@mail.cgu.edu.tw",
            "name": "Petrus Tang"
        },
        {
            "email": "pjhuang@gap.cgu.edu.tw",
            "name": "Po-Jung Huang"
        },
        {
            "email": "whcheng@isu.edu.tw",
            "name": "Wei-Hung Cheng"
        },
        {
            "email": "chichinglee@cgu.edu.tw",
            "name": "Chi-Ching Lee",
            "orcidid": "https://orcid.org/0000-0003-2912-7745"
        },
        {
            "email": "ymyeh@cgmh.org.tw",
            "name": "Close Yuan-Ming Yeh",
            "orcidid": "https://orcid.org/0000-0001-8720-947X"
        }
    ],
    "description": "An opened platform for microscopic helminth egg identification and quantification based on the integration of deep learning architectures.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "http://heap.cgu.edu.tw",
    "lastUpdate": "2022-03-01T20:14:48.882741Z",
    "name": "HEAP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMII.2021.07.014",
            "metadata": {
                "abstract": "© 2021Background: Millions of people throughout the world suffer from parasite infections. Traditionally, technicians use manual eye inspection of microscopic specimens to perform a parasite examination. However, manual operations have limitations that hinder the ability to obtain precise egg counts and cause inefficient identification of infected parasites on co-infections. The technician requirements for handling a large number of microscopic examinations in countries that have limited medical resources are substantial. We developed the helminth egg analysis platform (HEAP) as a user-friendly microscopic helminth eggs identification and quantification platform to assist medical technicians during parasite infection examination. Methods: Multiple deep learning strategies including SSD (Single Shot MultiBox Detector), U-net, and Faster R-CNN (Faster Region-based Convolutional Neural Network) are integrated to identify the same specimen allowing users to choose the best predictions. An image binning and egg-in-edge algorithm based on pixel density detection was developed to increase the performance. Computers with different operation systems can be gathered to lower the computation time using our easy-to-deploy software architecture. Results: A user-friendly interface is provided to substantially increase the efficiency of manual validation. To adapt to low-cost computers, we architected a distributed computing structure with high flexibilities. Conclusions: HEAP serves not only as a prediction service provider but also as a parasitic egg database of microscopic helminth egg image collection, labeling data and pretrained models. All images and labeling resources are free and accessible at http://heap.cgu.edu.tw. HEAP can also be an ideal education and training resource for helminth egg examination.",
                "authors": [
                    {
                        "name": "Cheng W.-H."
                    },
                    {
                        "name": "Chiu C.-H."
                    },
                    {
                        "name": "Huang P.-J."
                    },
                    {
                        "name": "Lee C.-C."
                    },
                    {
                        "name": "Li P.-H."
                    },
                    {
                        "name": "Tang P."
                    },
                    {
                        "name": "Yeh Y.-M."
                    }
                ],
                "date": "2021-01-01T00:00:00Z",
                "journal": "Journal of Microbiology, Immunology and Infection",
                "title": "Helminth egg analysis platform (HEAP): An opened platform for microscopic helminth egg identification and quantification based on the integration of deep learning architectures"
            },
            "pmid": "34511389"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biological databases",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Parasitology",
            "uri": "http://edamontology.org/topic_3302"
        }
    ],
    "validated": 1
}
