{
    "accessibility": "Open access",
    "additionDate": "2024-06-18T16:00:13.195322Z",
    "biotoolsCURIE": "biotools:bio-past",
    "biotoolsID": "bio-past",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chenshengquan@nankai.edu.cn",
            "name": "Shengquan Chen",
            "typeEntity": "Person"
        },
        {
            "email": "ruijiang@tsinghua.edu.cn",
            "name": "Rui Jiang",
            "typeEntity": "Person"
        }
    ],
    "description": "Latent feature extraction with a Prior-based self-Attention framework for Spatial Transcriptomics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Simulation analysis",
                    "uri": "http://edamontology.org/operation_0244"
                },
                {
                    "term": "Trajectory visualization",
                    "uri": "http://edamontology.org/operation_3890"
                }
            ]
        }
    ],
    "homepage": "https://past.readthedocs.io/en/latest",
    "lastUpdate": "2024-11-24T13:53:21.985240Z",
    "name": "PAST",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/gr.277891.123",
            "metadata": {
                "abstract": "Rapid advances in spatial transcriptomics (ST) have revolutionized the interrogation of spatial heterogeneity and increase the demand for comprehensive methods to effectively characterize spatial domains. As a prerequisite for ST data analysis, spatial domain characterization is a crucial step for downstream analyses and biological implications. Here we propose a prior-based self-attention framework for spatial transcriptomics (PAST), a variational graph convolutional autoencoder for ST, which effectively integrates prior information via a Bayesian neural network, captures spatial patterns via a self-attention mechanism, and enables scalable application via a ripple walk sampler strategy. Through comprehensive experiments on data sets generated by different technologies, we show that PAST can effectively characterize spatial domains and facilitate various downstream analyses, including ST visualization, spatial trajectory inference and pseudotime analysis. Also, we highlight the advantages of PAST for multislice joint embedding and automatic annotation of spatial domains in newly sequenced ST data. Compared with existing methods, PAST is the first ST method that integrates reference data to analyze ST data. We anticipate that PAST will open up new avenues for researchers to decipher ST data with customized reference data, which expands the applicability of ST technology.",
                "authors": [
                    {
                        "name": "Chen S."
                    },
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Jiang R."
                    },
                    {
                        "name": "Li Z."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 9,
                "date": "2023-10-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Latent feature extraction with a prior-based self-attention framework for spatial transcriptomics"
            },
            "pmcid": "PMC10691543",
            "pmid": "37903634"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
