
{
    "credit": [
        {
            "email": "galaxy@pasteur.fr",
            "name": "Galaxy Support Team",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://galaxy.pasteur.fr/root?tool_id=hgv_gpass"
        }
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Report",
                        "uri": "http://edamontology.org/data_2048"
                    },
                    "format": [
                        {
                            "term": "HTML",
                            "uri": "http://edamontology.org/format_2331"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Data",
                        "uri": "http://edamontology.org/data_0006"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "collectionID": [
            "galaxyPasteur",
            "Galaxy Tools"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            },
            {
                "term": "Statistics and probability",
                "uri": "http://edamontology.org/topic_2269"
            },
            {
                "term": "Data mining",
                "uri": "http://edamontology.org/topic_3473"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Galaxy service",
            "url": "https://galaxy.pasteur.fr/tool_runner?tool_id=hgv_gpass"
        }
    ],
    "publication": [
        {
            "abstract": "Genome-wide association studies commonly involve simultaneous tests of millions of single nucleotide polymorphisms (SNP) for disease association. The SNPs in nearby genomic regions, however, are often highly correlated due to linkage disequilibrium (LD, a genetic term for correlation). Simple Bonferonni correction for multiple comparisons is therefore too conservative. Permutation tests, which are often employed in practice, are both computationally expensive for genome-wide studies and limited in their scopes. We present an accurate and computationally efficient method, based on Poisson de-clumping heuristics, for approximating genome-wide significance of SNP associations. Compared with permutation tests and other multiple comparison adjustment approaches, our method computes the most accurate and robust p-value adjustments for millions of correlated comparisons within seconds. We demonstrate analytically that the accuracy and the efficiency of our method are nearly independent of the sample size, the number of SNPs, and the scale of p-values to be adjusted. In addition, our method can be easily adopted to estimate false discovery rate. When applied to genome-wide SNP datasets, we observed highly variable p-value adjustment results evaluated from different genomic regions. The variation in adjustments along the genome, however, are well conserved between the European and the African populations. The p-value adjustments are significantly correlated with LD among SNPs, recombination rates, and SNP densities. Given the large variability of sequence features in the genome, we further discuss a novel approach of using SNP-specific (local) thresholds to detect genome-wide significant associations. This article has supplementary material online. © 2011 American Statistical Association.",
            "authors": [
                "Zhang Y.",
                "Liu J.S."
            ],
            "cit_count": 4,
            "doi": "10.1198/jasa.2011.ap10657",
            "journal": "Journal of the American Statistical Association",
            "title": "Fast and accurate approximation to significance tests in genome-wide association studies",
            "type": "Primary",
            "year": "2011-10-21"
        },
        {
            "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.High-throughput data production technologies, particularly 'next-generation' DNA sequencing, have ushered in widespread and disruptive changes to biomedical research. Making sense of the large datasets produced by these technologies requires sophisticated statistical and computational methods, as well as substantial computational power. This has led to an acute crisis in life sciences, as researchers without informatics training attempt to perform computation-dependent analyses. Since 2005, the Galaxy project has worked to address this problem by providing a framework that makes advanced computational tools usable by non experts. Galaxy seeks to make data-intensive research more accessible, transparent and reproducible by providing a Web-based environment in which users can perform computational analyses and have all of the details automatically tracked for later inspection, publication, or reuse. In this report we highlight recently added features enabling biomedical analyses on a large scale.",
            "authors": [
                "Afgan E.",
                "Baker D.",
                "van den Beek M.",
                "Blankenberg D.",
                "Bouvier D.",
                "Cech M.",
                "Chilton J.",
                "Clements D.",
                "Coraor N.",
                "Eberhard C.",
                "Gruning B.",
                "Guerler A.",
                "Hillman-Jackson J.",
                "Von Kuster G.",
                "Rasche E.",
                "Soranzo N.",
                "Turaga N.",
                "Taylor J.",
                "Nekrutenko A.",
                "Goecks J."
            ],
            "cit_count": 523,
            "doi": "10.1093/nar/gkw343",
            "journal": "Nucleic acids research",
            "title": "The Galaxy platform for accessible, reproducible and collaborative biomedical analyses: 2016 update",
            "type": "Other",
            "year": "2016-07-08"
        },
        {
            "doi": "10.7490/f1000research.1114334.1",
            "type": "Other"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:hgv_gpass-ip",
        "biotoolsID": "hgv_gpass",
        "description": "The tool detects significant single-SNP associations in case-control studies at a user-specified FDR.",
        "homepage": "https://github.com/galaxyproject/galaxy/tree/dev/tools",
        "name": "hgv_gpass",
        "version": [
            "1.0.0"
        ]
    }
}