{
    "additionDate": "2019-11-14T19:53:58Z",
    "biotoolsCURIE": "biotools:AstroDot",
    "biotoolsID": "AstroDot",
    "confidence_flag": "tool",
    "description": "A new method for studying the spatial distribution of mRNA in astrocytes | Abstract Cells with a complex shape often use mRNA distribution and local translation to regulate distal functions. These mechanisms have recently been described in astrocytes, the processes of which contact and functionally modulate neighbouring synapses and blood vessels. In order to study the distribution of mRNA in astrocytes, we developed a three-dimensional histological method that combines mRNA detection via in situ hybridization with immunostaining of the astrocyte-specific intermediate filament glial fibrillary acidic protein (GFAP). Three-dimensional confocal images were analyzed using AstroDot, a custom Image J plug-in developed in-house for the identification and quantification of mRNAs in GFAP-immunolabelled astrocyte somata, large processes and fine processes",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deisotoping",
                    "uri": "http://edamontology.org/operation_3629"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://doi.org/10.1242/jcs.239756",
    "lastUpdate": "2024-11-24T20:57:11.540463Z",
    "name": "AstroDot",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1242/jcs.239756",
            "metadata": {
                "abstract": "Astrocytes are morphologically complex and use local translation to regulate distal functions. To study the distribution of mRNA in astrocytes, we combined mRNA detection via in situ hybridization with immunostaining of the astrocyte-specific intermediate filament glial fibrillary acidic protein (GFAP). mRNAs at the level of GFAP-immunolabelled astrocyte somata, and large and fine processes were analysed using AstroDot, an ImageJ plug-in and the R package AstroStat. Taking the characterization of mRNAs encoding GFAP-α and GFAP-δ isoforms as a proof of concept, we showed that they mainly localized on GFAP processes. In the APPswe/PS1dE9 mouse model of Alzheimer's disease, the density and distribution of both α and δ forms of Gfap mRNA changed as a function of the region of the hippocampus and the astrocyte's proximity to amyloid plaques. To validate our method, we confirmed that the ubiquitous Rpl4 (large subunit ribosomal protein 4) mRNA was present in astrocyte processes as well as in microglia processes immunolabelled for ionized calcium binding adaptor molecule 1 (Iba1; also known as IAF1). In summary, this novel set of tools allows the characterization of mRNA distribution in astrocytes and microglia in physiological or pathological settings.",
                "authors": [
                    {
                        "name": "Boulay A.-C."
                    },
                    {
                        "name": "Cohen-Salmon M."
                    },
                    {
                        "name": "Mailly P."
                    },
                    {
                        "name": "Mazare N."
                    },
                    {
                        "name": "Oudart M."
                    },
                    {
                        "name": "Tortuyaux R."
                    }
                ],
                "citationCount": 15,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Journal of Cell Science",
                "title": "AstroDot - A new method for studying the spatial distribution of mRNA in astrocytes"
            },
            "pmid": "32079659"
        }
    ],
    "topic": [
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}
