{
    "additionDate": "2021-01-18T06:57:30Z",
    "biotoolsCURIE": "biotools:aliclu",
    "biotoolsID": "aliclu",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "susanavinga@tecnico.ulisboa.pt",
            "name": "Susana Vinga",
            "orcidid": "https://orcid.org/0000-0002-1954-5487",
            "typeEntity": "Person"
        }
    ],
    "description": "Temporal sequence alignment for clustering longitudinal clinical data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Sequence alignment",
                    "uri": "http://edamontology.org/operation_0292"
                },
                {
                    "term": "Phylogenetic tree bootstrapping",
                    "uri": "http://edamontology.org/operation_0552"
                }
            ]
        }
    ],
    "homepage": "https://kishanrama.github.io/AliClu/",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-01-23T13:52:23Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/sysbiomed/AliClu"
        }
    ],
    "name": "AliClu",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12911-019-1013-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Patient stratification is a critical task in clinical decision making since it can allow physicians to choose treatments in a personalized way. Given the increasing availability of electronic medical records (EMRs) with longitudinal data, one crucial problem is how to efficiently cluster the patients based on the temporal information from medical appointments. In this work, we propose applying the Temporal Needleman-Wunsch (TNW) algorithm to align discrete sequences with the transition time information between symbols. These symbols may correspond to a patient's current therapy, their overall health status, or any other discrete state. The transition time information represents the duration of each of those states. The obtained TNW pairwise scores are then used to perform hierarchical clustering. To find the best number of clusters and assess their stability, a resampling technique is applied. Results: We propose the AliClu, a novel tool for clustering temporal clinical data based on the TNW algorithm coupled with clustering validity assessments through bootstrapping. The AliClu was applied for the analysis of the rheumatoid arthritis EMRs obtained from the Portuguese database of rheumatologic patient visits (Reuma.pt). In particular, the AliClu was used for the analysis of therapy switches, which were coded as letters corresponding to biologic drugs and included their durations before each change occurred. The obtained optimized clusters allow one to stratify the patients based on their temporal therapy profiles and to support the identification of common features for those groups. Conclusions: The AliClu is a promising computational strategy to analyse longitudinal patient data by providing validated clusters and by unravelling the patterns that exist in clinical outcomes. Patient stratification is performed in an automatic or semi-automatic way, allowing one to tune the alignment, clustering, and validation parameters. The AliClu is freely available at https://github.com/sysbiomed/AliClu.",
                "authors": [
                    {
                        "name": "Rama K."
                    },
                    {
                        "name": "Canhao H."
                    },
                    {
                        "name": "Carvalho A.M."
                    },
                    {
                        "name": "Vinga S."
                    }
                ],
                "date": "2019-12-30T00:00:00Z",
                "journal": "BMC Medical Informatics and Decision Making",
                "title": "AliCluoral sequence alignment for clustering longitudinal clinical data"
            },
            "pmcid": "PMC6938005",
            "pmid": "31888660"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Musculoskeletal medicine",
            "uri": "http://edamontology.org/topic_3416"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        }
    ],
    "validated": 1
}