{
    "name": "CMF", 
    "description": "Contrast motif finder that finds motifs with differential enrichment between two datasets. It aims to take advantage of multiple high quality binding datasets to identify subtle regulatory signals, such as context-dependent motifs, within bound sequences. It is specifically designed to discriminate between two sets of bound sequences and takes into account false positive sites when updating PWMs and other model parameters.", 
    "homepage": "http://www.stat.ucla.edu/~zhou/CMF/index.html", 
    "biotoolsID": "cmf", 
    "biotoolsCURIE": "biotools:cmf", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3501", 
                    "term": "Enrichment analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3511", 
            "term": "Nucleic acid sites, features and motifs"
        }, 
        {
            "uri": "http://edamontology.org/topic_0654", 
            "term": "DNA"
        }, 
        {
            "uri": "http://edamontology.org/topic_0080", 
            "term": "Sequence analysis"
        }
    ], 
    "operatingSystem": [
        "Linux"
    ], 
    "language": [
        "R"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/cmf-contrast-motif-finder.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "http://www.stat.ucla.edu/~zhou/CMF/cmfREADME.txt", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btq546", 
            "pmid": null, 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Identification of context-dependent motifs by contrasting ChIP binding data", 
                "abstract": "Motivation: DNA binding proteins play crucial roles in the regulation of gene expression. Transcription factors (TFs) activate or repress genes directly while other proteins influence chromatin structure for transcription. Binding sites of a TF exhibit a similar sequence pattern called a motif. However, a one-to-one map does not exist between each TF and motif. Many TFs in a protein family may recognize the same motif with subtle nucleotide differences leading to different binding affinities. Additionally, a particular TF may bind different motifs under certain conditions, for example in the presence of different co-regulators. The availability of genome-wide binding data of multiple collaborative TFs makes it possible to detect such context-dependent motifs. Results: We developed a contrast motif finder (CMF) for the de novo identification of motifs that are differentially enriched in two sets of sequences. Applying this method to a number of TF binding datasets from mouse embryonic stem cells, we demonstrate that CMF achieves substantially higher accuracy than several well-known motif finding methods. By contrasting sequences bound by distinct sets of TFs, CMF identified two different motifs that may be recognized by Oct4 dependent on the presence of another coregulator and detected subtle motif signals that may be associated with potential competitive binding between Sox2 and Tcf3. © The Author 2010. Published by Oxford University Press. All rights reserved.", 
                "date": "2010-11-01T00:00:00Z", 
                "citationCount": 31, 
                "authors": [
                    {
                        "name": "Mason M.J."
                    }, 
                    {
                        "name": "Plath K."
                    }, 
                    {
                        "name": "Zhou Q."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": "zhou@stat.ucla.edu", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-12-18T00:04:43Z", 
    "lastUpdate": "2018-12-10T12:58:54Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}