{
    "additionDate": "2019-11-14T17:59:56Z",
    "biotoolsCURIE": "biotools:VIC",
    "biotoolsID": "VIC",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "maxm.he@outlook.com",
            "name": "Max M. He",
            "typeEntity": "Person"
        },
        {
            "email": "wangk@email.chop.edu",
            "name": "Kai Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "a computational tool for assessing clinical impacts of somatic variants | A Computational Tool for Assessing Clinical Impacts of Somatic Variants Following the AMP-ASCO-CAP 2017 Guidelines | Variant Interpretation for Cancer (VIC) | Clinical Interpretations of Variants in Cancer | java -jar target/VIC-1.0-jar-with-dependencies.jar [-b ] [-d ] [-h] [-input_type ] [-i ] [-cancer_type ] [-convert2annovar ] [-l ] [-skip_annovar] [-o ] [-annotate_variation ] [-table_annovar ] [-s ] [-otherinfo ] [-db ]",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://github.com/HGLab/VIC/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2021-01-02T15:15:17Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://civicdb.org/releases"
        },
        {
            "type": [
                "Other"
            ],
            "url": "https://civicdb.org/home"
        }
    ],
    "name": "VIC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13073-019-0664-4",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Clinical laboratories implement a variety of measures to classify somatic sequence variants and identify clinically significant variants to facilitate the implementation of precision medicine. To standardize the interpretation process, the Association for Molecular Pathology (AMP), American Society of Clinical Oncology (ASCO), and College of American Pathologists (CAP) published guidelines for the interpretation and reporting of sequence variants in cancer in 2017. These guidelines classify somatic variants using a four-tiered system with ten criteria. Even with the standardized guidelines, assessing clinical impacts of somatic variants remains to be tedious. Additionally, manual implementation of the guidelines may vary among professionals and may lack reproducibility when the supporting evidence is not documented in a consistent manner. Results: We developed a semi-automated tool called \"Variant Interpretation for Cancer\" (VIC) to accelerate the interpretation process and minimize individual biases. VIC takes pre-annotated files and automatically classifies sequence variants based on several criteria, with the ability for users to integrate additional evidence to optimize the interpretation on clinical impacts. We evaluated VIC using several publicly available databases and compared with several predictive software programs. We found that VIC is time-efficient and conservative in classifying somatic variants under default settings, especially for variants with strong and/or potential clinical significance. Additionally, we also tested VIC on two cancer-panel sequencing datasets to show its effectiveness in facilitating manual interpretation of somatic variants. Conclusions: Although VIC cannot replace human reviewers, it will accelerate the interpretation process on somatic variants. VIC can also be customized by clinical laboratories to fit into their analytical pipelines to facilitate the laborious process of somatic variant interpretation. VIC is freely available at https://github.com/HGLab/VIC/.",
                "authors": [
                    {
                        "name": "He M.M."
                    },
                    {
                        "name": "Li Q."
                    },
                    {
                        "name": "Yan M."
                    },
                    {
                        "name": "Cao H."
                    },
                    {
                        "name": "Hu Y."
                    },
                    {
                        "name": "He K.Y."
                    },
                    {
                        "name": "Cao K."
                    },
                    {
                        "name": "Li M.M."
                    },
                    {
                        "name": "Wang K."
                    }
                ],
                "citationCount": 5,
                "date": "2019-08-23T00:00:00Z",
                "journal": "Genome Medicine",
                "title": "Variant Interpretation for Cancer (VIC): A computational tool for assessing clinical impacts of somatic variants"
            },
            "pmcid": "PMC6708137",
            "pmid": "31443733"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Allergy, clinical immunology and immunotherapeutics",
            "uri": "http://edamontology.org/topic_3400"
        }
    ],
    "validated": 1
}