{
    "additionDate": "2018-07-14T08:35:55Z",
    "biotoolsCURIE": "biotools:hybrid-denovo",
    "biotoolsID": "hybrid-denovo",
    "credit": [
        {
            "email": "chen.jun2@mayo.edu",
            "name": "Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "chen.xianfeng@mayo.edu",
            "name": "Chen Xianfeng",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "De novo OTU-picking pipeline integrating single- and paired-end 16S sequence tags. It is designed to take Illumina paired-end sequencing reads as input and output the OTU BIOM table, together with their representative sequences and a phylogenetic tree of OTUs.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bioinformaticstools.mayo.edu/research/hybrid-denovo/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree generation",
                    "uri": "http://edamontology.org/operation_0323"
                },
                {
                    "term": "Sequence merging",
                    "uri": "http://edamontology.org/operation_0232"
                }
            ]
        }
    ],
    "homepage": "http://bioinformaticstools.mayo.edu/research/hybrid-denovo/",
    "language": [
        "Shell",
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-04-16T06:16:13.954868Z",
    "license": "BSD-2-Clause",
    "name": "Hybrid-denovo",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_015866"
        }
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1093/gigascience/gix129",
            "metadata": {
                "abstract": "© The Author(s) 2018.Background: Illumina paired-end sequencing has been increasingly popular for 16S rRNA gene-based microbiota profiling. It provides higher phylogenetic resolution than single-end reads due to a longer read length. However, the reverse read (R2) often has significant low base quality, and a large proportion of R2s will be discarded after quality control, resulting in a mixture of paired-end and single-end reads. A typical 16S analysis pipeline usually processes either paired-end or single-end reads but not a mixture. Thus, the quantification accuracy and statistical power will be reduced due to the loss of a large amount of reads. As a result, rare taxa may not be detectable with the paired-end approach, or low taxonomic resolution will result in a single-end approach. Results: To have both the higher phylogenetic resolution provided by paired-end reads and the higher sequence coverage by single-end reads, we propose a novel OTU-picking pipeline, hybrid-denovo, that can process a hybrid of single-end and paired-end reads. Using high-quality paired-end reads as a gold standard, we show that hybrid-denovo achieved the highest correlation with the gold standard and performed better than the approaches based on paired-end or single-end reads in terms of quantifying the microbial diversity and taxonomic abundances. By applying our method to a rheumatoid arthritis (RA) data set, we demonstrated that hybrid-denovo captured more microbial diversity and identified more RA-associated taxa than a paired-end or single-end approach. Conclusions: Hybrid-denovo utilizes both paired-end and single-end 16S sequencing reads and is recommended for 16S rRNA gene targeted paired-end sequencing data.",
                "authors": [
                    {
                        "name": "Chen X."
                    },
                    {
                        "name": "Johnson S."
                    },
                    {
                        "name": "Jeraldo P."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Chia N."
                    },
                    {
                        "name": "Kocher J.-P.A."
                    },
                    {
                        "name": "Chen J."
                    }
                ],
                "citationCount": 51,
                "date": "2018-03-01T00:00:00Z",
                "journal": "GigaScience",
                "title": "Hybrid-denovo: A de novo OTU-picking pipeline integrating single-end and paired-end 16S sequence tags"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ],
    "validated": 1
}