{
    "additionDate": "2021-01-18T08:13:48Z",
    "biotoolsCURIE": "biotools:forgenet",
    "biotoolsID": "forgenet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "tianwei.yu@emory.edu",
            "name": "Tianwei Yu",
            "typeEntity": "Person"
        }
    ],
    "description": "forgeNet (forest graph-embedded deep feedforward networks) a graph deep neural network model using tree-based ensemble classifiers for feature graph construction.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                }
            ]
        }
    ],
    "homepage": "https://github.com/yunchuankong/forgeNet",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-03-11T10:47:10Z",
    "license": "MIT",
    "name": "forgeNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA164",
            "metadata": {
                "abstract": "© 2020 The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: A unique challenge in predictive model building for omics data has been the small number of samples (n) versus the large amount of features (p). This 'n'p' property brings difficulties for disease outcome classification using deep learning techniques. Sparse learning by incorporating known functional relationships between the biological units, such as the graph-embedded deep feedforward network (GEDFN) model, has been a solution to this issue. However, such methods require an existing feature graph, and potential mis-specification of the feature graph can be harmful on classification and feature selection. Results: To address this limitation and develop a robust classification model without relying on external knowledge, we propose a forest graph-embedded deep feedforward network (forgeNet) model, to integrate the GEDFN architecture with a forest feature graph extractor, so that the feature graph can be learned in a supervised manner and specifically constructed for a given prediction task. To validate the method's capability, we experimented the forgeNet model with both synthetic and real datasets. The resulting high classification accuracy suggests that the method is a valuable addition to sparse deep learning models for omics data. Contact: tianwei.yu@emory.edu",
                "authors": [
                    {
                        "name": "Kong Y."
                    },
                    {
                        "name": "Yu T."
                    }
                ],
                "citationCount": 4,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "ForgeNet: A graph deep neural network model using tree-based ensemble classifiers for feature graph construction"
            },
            "pmcid": "PMC7267822",
            "pmid": "32163118"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Laboratory techniques",
            "uri": "http://edamontology.org/topic_3361"
        }
    ]
}