{
    "additionDate": "2022-01-10T13:26:07.767604Z",
    "biotoolsCURIE": "biotools:ms2compound",
    "biotoolsID": "ms2compound",
    "confidence_flag": "tool",
    "description": "MS2Compound is a user-friendly compound identification tool for LC-MS/MS-based metabolomics data.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Natural product identification",
                    "uri": "http://edamontology.org/operation_3803"
                },
                {
                    "term": "Spectral library search",
                    "uri": "http://edamontology.org/operation_3801"
                }
            ]
        }
    ],
    "homepage": "https://github.com/beherasan/MS2Compound",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2022-01-10T13:26:07.771676Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/beherasan/MS2Compound/issues"
        }
    ],
    "name": "MS2Compound",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1089/OMI.2021.0051",
            "metadata": {
                "abstract": "© Copyright 2021, Mary Ann Liebert, Inc., publishers 2021.Metabolomics is a leading frontier of systems science and biomedical innovation. However, metabolite identification in mass spectrometry (MS)-based global metabolomics investigations remains a formidable challenge. Moreover, lack of comprehensive spectral databases hinders accurate identification of compounds in global MS-based metabolomics. Creating experiment-derived metabolite spectral libraries tailored to each experiment is labor-intensive. Therefore, predicted spectral libraries could serve as a better alternative. User-friendly tools are much needed, as the currently available metabolomic analysis tools do not offer adequate provision for users to create or choose context-specific databases. Here, we introduce the MS2Compound, a metabolite identification tool, which can be used to generate a custom database of predicted spectra using the Competitive Fragmentation Modeling-ID (CFM-ID) algorithm, and identify metabolites or compounds from the generated database. The database generator can create databases of the model/context/species used in the metabolomics study. The MS2Compound is also powered with mS-score, a scoring function for matching raw fragment spectra to a predicted spectra database. We demonstrated that mS-score is robust in par with dot product and hypergeometric score in identifying metabolites using benchmarking datasets. We evaluated and highlight here the unique features of the MS2Compound by a re-analysis of a publicly available metabolomic dataset (MassIVE id: MSV000086784) for a complex traditional drug formulation called Triphala. In conclusion, we believe that the omics systems science and biomedical research and innovation community in the field of metabolomics will find the MS2Compound as a user-friendly analysis tool of choice to accelerate future metabolomic analyses.",
                "authors": [
                    {
                        "name": "Behera S.K."
                    },
                    {
                        "name": "Karthikkeyan G."
                    },
                    {
                        "name": "Kasaragod S."
                    },
                    {
                        "name": "Narayana Kotimoole C."
                    },
                    {
                        "name": "Prasad T.S.K."
                    },
                    {
                        "name": "Raju R."
                    },
                    {
                        "name": "Subbannayya Y."
                    }
                ],
                "date": "2021-06-01T00:00:00Z",
                "journal": "OMICS A Journal of Integrative Biology",
                "title": "MS2Compound: A User-Friendly Compound Identification Tool for LC-MS/MS-Based Metabolomics Data"
            },
            "pmid": "34115523",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Biotherapeutics",
            "uri": "http://edamontology.org/topic_3374"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        }
    ]
}
