{
    "name": "Frela", 
    "description": "Frela is a web service for computing functional relationships of protein pairs based on Gene Ontology (GO) annotations. It allows very fast calculation of protein functional similarity based on their GO annotations for biological process (BP), molecular function (MF), and cellular component (CC) ontologies using various popular semantic similarity measures that can be combined arbitrarily with a set of widely used mixing strategies.", 
    "homepage": "https://frela.eurac.edu", 
    "biotoolsID": "Frela", 
    "biotoolsCURIE": "biotools:Frela", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3438", 
                    "term": "Calculation"
                }, 
                {
                    "uri": "http://edamontology.org/operation_1778", 
                    "term": "Protein function comparison"
                }
            ], 
            "input": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_3021", 
                        "term": "UniProt accession"
                    }, 
                    "format": []
                }
            ], 
            "output": [
                {
                    "data": {
                        "uri": "http://edamontology.org/data_1668", 
                        "term": "Z-value"
                    }, 
                    "format": [
                        {
                            "uri": "http://edamontology.org/format_2331", 
                            "term": "HTML"
                        }
                    ]
                }
            ], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Web application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_0091", 
            "term": "Bioinformatics"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Mac"
    ], 
    "language": [
        "Python"
    ], 
    "license": "MIT", 
    "collectionID": [], 
    "maturity": "Mature", 
    "cost": "Free of charge", 
    "accessibility": [
        "Open access"
    ], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [], 
    "documentation": [
        {
            "url": "https://frela.eurac.edu/#help", 
            "type": "General", 
            "note": "Link to help page of the web service."
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "28336965", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Exploring Approaches for Detecting Protein Functional Similarity within an Orthology-based Framework", 
                "abstract": "© 2017 The Author(s).Protein functional similarity based on gene ontology (GO) annotations serves as a powerful tool when comparing proteins on a functional level in applications such as protein-protein interaction prediction, gene prioritization, and disease gene discovery. Functional similarity (FS) is usually quantified by combining the GO hierarchy with an annotation corpus that links genes and gene products to GO terms. One large group of algorithms involves calculation of GO term semantic similarity (SS) between all the terms annotating the two proteins, followed by a second step, described as \"mixing strategy\", which involves combining the SS values to yield the final FS value. Due to the variability of protein annotation caused e.g. by annotation bias, this value cannot be reliably compared on an absolute scale. We therefore introduce a similarity z-score that takes into account the FS background distribution of each protein. For a selection of popular SS measures and mixing strategies we demonstrate moderate accuracy improvement when using z-scores in a benchmark that aims to separate orthologous cases from random gene pairs and discuss in this context the impact of annotation corpus choice. The approach has been implemented in Frela, a fast high-throughput public web server for protein FS calculation and interpretation.", 
                "date": "2017-12-01T00:00:00Z", 
                "citationCount": 2, 
                "authors": [
                    {
                        "name": "Weichenberger C.X."
                    }, 
                    {
                        "name": "Palermo A."
                    }, 
                    {
                        "name": "Pramstaller P.P."
                    }, 
                    {
                        "name": "Domingues F.S."
                    }
                ], 
                "journal": "Scientific Reports"
            }
        }
    ], 
    "credit": [], 
    "owner": "cweich", 
    "additionDate": "2019-07-04T10:18:11Z", 
    "lastUpdate": "2019-07-04T10:25:17Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}