
{
    "credit": [
        {
            "email": "oasis@dzne.de",
            "name": "Oasis Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://oasis.dzne.de/smallrnapipeline-demo.html"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Read mapping",
                    "uri": "http://edamontology.org/operation_3198"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "JavaScript",
            "Java",
            "Perl",
            "Python",
            "C"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 The Author 2015. Published by Oxford University Press.Summary: Oasis is a WEB application that allows for the fast and flexible online analysis of small-RNA-seq (sRNA-seq) data. It was designed for the end user in the lab, providing an easy-to-use WEB frontend including video tutorials, demo data and best practice step-by-step guidelines on how to analyze sRNA-seq data. Oasis' exclusive selling points are a differential expression module that allows for the multivariate analysis of samples, a classification module for robust biomarker detection and an advanced programming interface that supports the batch submission of jobs. Both modules include the analysis of novel miRNAs, miRNA targets and functional analyses including GO and pathway enrichment. Oasis generates downloadable interactive WEB reports for easy visualization, exploration and analysis of data on a local system. Finally, Oasis' modular workflow enables for the rapid (re-) analysis of data. Availability and implementation: Oasis is implemented in Python, R, Java, PHP, C++ and JavaScript. It is freely available at http://oasis.dzne.de.",
            "authors": [
                "Capece V.",
                "Garcia Vizcaino J.C.",
                "Vidal R.",
                "Rahman R.-U.",
                "Pena Centeno T.",
                "Shomroni O.",
                "Suberviola I.",
                "Fischer A.",
                "Bonn S."
            ],
            "cit_count": 25,
            "doi": "10.1093/bioinformatics/btv113",
            "journal": "Bioinformatics",
            "title": "Oasis: Online analysis of small RNA deep sequencing data",
            "type": "Primary",
            "year": "2015-07-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:oasis",
        "biotoolsID": "oasis",
        "description": "It is a web application that allows for the fast and flexible online analysis of small-RNA-seq data. It was designed for the end user in the lab, providing an easy-to-use web frontend including video tutorials, demo data, and best practice step-by-step guidelines on how to analyze sRNA-seq data. Oasis generates downloadable interactive web reports for easy visualization, exploration, and analysis of data on a local system.",
        "homepage": "http://oasis.dzne.de",
        "name": "Oasis"
    }
}