{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://www.bic.kyoto-u.ac.jp/"}],"documentation":[{"type":"TERMS_OF_USE","url":"http://www.genome.jp/tools/gecs/gecs_help.html"}],"function":[{"operation":[{"term":"Protein structure prediction","uri":"http://edamontology.org/operation_0474"}]},{"operation":[{"term":"Prediction and recognition","uri":"http://edamontology.org/operation_2423"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Structure prediction","uri":"http://edamontology.org/topic_0082"},{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Gene expression","uri":"http://edamontology.org/topic_0203"},{"term":"Small molecules","uri":"http://edamontology.org/topic_0154"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/gecs-glycan-structure-prediction-microarray-data.html"}],"publication":[{"abstract":"The prediction of glycan structures from gene expression of glycosyltransferases (GTs) is a challenging new area in computational biology because the biosynthesis of glycan chains is under the control of GT expression. In this paper we developed a new method for predicting glycan structures from gene expression data. There are two main original aspects of the proposed method. First, we proposed to increase the number of predictable glycan structure candidates by estimating missing glycans from a global glycan structure map, which enables us to predict new glycan structures that are not stored in the database. Second, we proposed a more general scoring scheme based on real-valued gene expression intensity rather than converting it into binary information. In the result we applied the proposed method to predicting cancer-specific glycan structures from gene expression profiles for patients of acute lymphocytic leukemia (ALL) and acute myelocytic leukemia (AML). We confirmed that several of the predicted glycan structures successfully correspond to known cancer-specific glycan structures according to the literature, and our method outperforms the previous methods at a statistically significant level.","authors":["Suga A.","Yamanishi Y.","Hashimoto K.","Goto S.","Kanehisa M."],"cit_count":22,"journal":"Genome informatics. International Conference on Genome Informatics","pmid":"18546491","title":"An improved scoring scheme for predicting glycan structures from gene expression data.","year":"2007-01-01"}],"summary":{"biotoolsCURIE":"biotools:gecs","biotoolsID":"gecs","description":"GECS (Gene Expression to Chemical Structure) is a collection of prediction methods linking genomic or transcriptomic contents of genes to chemical structures of biosynthetic substances. This N-Glycan Prediction Server is based on the repertoire of glycosyltransferases for N-glycan biosynthesis.","homepage":"http://www.genome.jp/tools/gecs","name":"GECS"}}