{
    "accessibility": "Open access",
    "additionDate": "2021-11-24T15:19:10.637362Z",
    "biotoolsCURIE": "biotools:dbmcs",
    "biotoolsID": "dbmcs",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Zhenyu Yue",
            "orcidid": "https://orcid.org/0000-0002-9370-2540"
        }
    ],
    "description": "A Database for Exploring the Mutation Markers of Anti-Cancer Drug Sensitivity",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "http://bioinfo.aielab.cc/dbMCS/",
    "lastUpdate": "2021-11-24T15:19:10.640034Z",
    "name": "dbMCS",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/JBHI.2021.3100424",
            "metadata": {
                "abstract": "© 2013 IEEE.The identification of mutation markers and the selection of appropriate treatment for patients with specific genome mutations are important steps in the development of targeted therapies and the realization of precision medicine for human cancers. To investigate the baseline characteristics of drug sensitivity markers and develop computational methods of mutation effect prediction, we presented a manually curated online-based database of mutation Markers for anti-Cancer drug Sensitivity (dbMCS). Currently, dbMCS contains 1271 mutations and 4427 mutation-disease-drug associations (3151 and 1276 for sensitivity and resistance, respectively) with their PubMed indexed articles. By comparing the mutations in dbMCS with the putative neutral polymorphisms, we investigated the characteristics of drug sensitivity markers. We found that the mutation markers tend to significantly impact on high-conservative regions both in DNA sequences and protein domains. And some of them presented pleiotropic effects depending on the tumor context, appearing concurrently in the sensitivity and resistance categories. In addition, we preliminarily explored the machine learning-based methods for identifying mutation markers of anti-cancer drug sensitivity and produced optimistic results, which suggests that a reliable dataset may provide new insights and essential clues for future cancer pharmacogenomics studies. dbMCS is available at http://bioinfo.aielab.cc/dbMCS/.",
                "authors": [
                    {
                        "name": "Shen Y."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Xue W."
                    },
                    {
                        "name": "Yue Z."
                    }
                ],
                "date": "2021-11-01T00:00:00Z",
                "journal": "IEEE Journal of Biomedical and Health Informatics",
                "title": "DbMCS: A Database for Exploring the Mutation Markers of Anti-Cancer Drug Sensitivity"
            },
            "pmid": "34314366"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Pharmacogenomics",
            "uri": "http://edamontology.org/topic_0208"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ]
}