{
    "additionDate": "2021-10-25T09:29:43.522984Z",
    "biotoolsCURIE": "biotools:odm-clinical-data-generator",
    "biotoolsID": "odm-clinical-data-generator",
    "confidence_flag": "high",
    "description": "ODM Clinical Data Generator is a tool that produces artificial study data for a given Operational Data Model (ODM) file. This synthetic study data can be used e.g. for the evaluation of other ODM-based tools.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://cdgen.uni-muenster.de",
    "lastUpdate": "2021-10-25T09:29:43.525436Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "https://imigitlab.uni-muenster.de/published/odm-clinical-data-generator"
        }
    ],
    "name": "ODM Clinical Data Generator",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3233/SHTI210048",
            "metadata": {
                "abstract": "© 2021 The authors and IOS Press.The Operational Data Model (ODM) is a data standard for interchanging clinical trial data. ODM contains the metadata definition of a study, i.e., case report forms, as well as the clinical data, i.e., the answers of the participants. The portal of medical data models is an infrastructure for creation, exchange, and analysis of medical metadata models. There, over 23000 metadata definitions can be downloaded in ODM format. Due to data protection law and privacy issues, clinical data is not contained in these files. Access to exemplary clinical test data in the desired metadata definition is necessary in order to evaluate systems claiming to support ODM or to evaluate if a planned statistical analysis can be performed with the defined data types. In this work, we present a web application, which generates syntactically correct clinical data in ODM format based on an uploaded ODM metadata definition. Data types and range constraints are taken into account. Data for up to one million participants can be generated in a reasonable amount of time. Thus, in combination with the portal of medical data models, a large number of ODM files including metadata definition and clinical data can be provided for testing of any ODM supporting system. The current version of the application can be tested at https://cdgen.uni-muenster.de and source code is available, under MIT license, at https://imigitlab.uni-muenster.de/published/odm-clinical-data-generator.",
                "authors": [
                    {
                        "name": "Becker L."
                    },
                    {
                        "name": "Brix T.J."
                    },
                    {
                        "name": "Dugas M."
                    },
                    {
                        "name": "Fechner M."
                    },
                    {
                        "name": "Harbich T."
                    },
                    {
                        "name": "Oehm J."
                    },
                    {
                        "name": "Storck M."
                    }
                ],
                "date": "2021-06-22T00:00:00Z",
                "journal": "German Medical Data Sciences: Bringing Data to Life: Proceedings of the Joint Annual Meeting of the German Association of Medical Informatics, Biometry and Epidemiology (gmds e.V.) and the Central European Network - International Biometric Society (CEN-IBS) 2020 in Berlin, Germany",
                "title": "ODM clinical data generator: Syntactically correct clinical data based on metadata definition"
            },
            "pmid": "34042873"
        }
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Medical informatics",
            "uri": "http://edamontology.org/topic_3063"
        },
        {
            "term": "Medicine",
            "uri": "http://edamontology.org/topic_3303"
        },
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}
