{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:08:43Z",
    "biotoolsCURIE": "biotools:GIDB",
    "biotoolsID": "GIDB",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "xyzhang@tongji.edu.cn",
            "name": "Xiaoyan Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "nadger_wang@139.com",
            "name": "Ying Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Knowledge database for the automated curation and multidimensional analysis of molecular signatures in gastrointestinal (GI) cancer.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://bmtongji.cn/GIDB/index.htmlq"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                }
            ]
        }
    ],
    "homepage": "http://bmtongji.cn/GIDB/index.html",
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "Unlicense",
    "maturity": "Mature",
    "name": "GIDB",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/DATABASE/BAZ051",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Gastrointestinal (GI) cancer is common, characterized by high mortality, and includes oesophagus, gastric, liver, bile duct, pancreas, rectal and colon cancers. The insufficient specificity and sensitivity of biomarkers is still a key clinical hindrance for GI cancer diagnosis and successful treatment. The emergence of 'precision medicine', 'basket trial' and 'field cancerization' concepts calls for an urgent need and importance for the understanding of how organ system cancers occur at the molecular levels. Knowledge from both the literature and data available in public databases is informative in elucidating the molecular alterations underlying GI cancer. Currently, most available cancer databases have not offered a comprehensive discovery of gene-disease associations, molecular alterations and clinical information by integrated text mining and data mining in GI cancer. We develop GIDB, a panoptic knowledge database that attempts to automate the curation of molecular signatures using natural language processing approaches and multidimensional analyses. GIDB covers information on 8730 genes with both literature and data supporting evidence, 248 miRNAs, 58 lncRNAs, 320 copy number variations, 49 fusion genes and 2381 semantic networks. It presents a comprehensive database, not only in parallelizing supporting evidence and data integration for signatures associated with GI cancer but also in providing the timeline feature of major molecular discoveries. It highlights the most comprehensive overview, research hotspots and the development of historical knowledge of genes in GI cancer. Furthermore, GIDB characterizes genomic abnormalities in multilevel analysis, including simple somatic mutations, gene expression, DNA methylation and prognosis. GIDB offers a user-friendly interface and two customizable online tools (Heatmap and Network) for experimental researchers and clinicians to explore data and help them shorten the learning curve and broaden the scope of knowledge. More importantly, GIDB is an ongoing research project that will continue to be updated and improve the automated method for reducing manual work.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Tong Y."
                    },
                    {
                        "name": "Jin L."
                    },
                    {
                        "name": "Zong H."
                    },
                    {
                        "name": "Zheng R."
                    },
                    {
                        "name": "Yang J."
                    },
                    {
                        "name": "Zhang Z."
                    },
                    {
                        "name": "Ouyang E."
                    },
                    {
                        "name": "Zhou M."
                    },
                    {
                        "name": "Zhang X."
                    }
                ],
                "citationCount": 2,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Database",
                "title": "GIDB: A knowledge database for the automated curation and multidimensional analysis of molecular signatures in gastrointestinal cancer"
            },
            "pmcid": "PMC6517830",
            "pmid": "31089686",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web application",
        "Database portal"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        }
    ]
}