{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:20:26Z",
    "biotoolsCURIE": "biotools:a-o-tool",
    "biotoolsID": "a-o-tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "eric.simon@boehringer-ingelheim.com",
            "name": "Eric Simon",
            "orcidid": "https://orcid.org/0000-0002-2585-3830",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Exploiting orthology and de novo transcriptome assembly to refine target sequence information.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/Julia-F-S/a-o-tool/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ab initio structure prediction",
                    "uri": "http://edamontology.org/operation_0476"
                },
                {
                    "term": "de Novo sequencing",
                    "uri": "http://edamontology.org/operation_3644"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Julia-F-S/a-o-tool",
    "language": [
        "Groovy"
    ],
    "lastUpdate": "2020-06-16T10:55:25Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "a-o-tool",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12920-019-0524-5",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The ability to generate recombinant drug target proteins is important for drug discovery research as it facilitates the investigation of drug-target-interactions in vitro. To accomplish this, the target's exact protein sequence is required. Public databases, such as Ensembl, UniProt and RefSeq, are extensive protein and nucleotide sequence repositories. However, many sequences for non-human organisms are predicted by computational pipelines and may thus be incomplete or incorrect. This could lead to misinterpreted experimental outcomes due to gaps or errors in orthologous drug target sequences. Transcriptome analysis by RNA-Seq has been established as a standard method for gene expression analysis. Apart from this common application, paired-end RNA-Seq data can also be used to obtain full coverage cDNA sequences via de novo transcriptome assembly. Methods: To assess whether de novo transcriptome assemblies can be used to determine a protein's sequence by searching the assembly for a known orthologous sequence, we generated 3 × 6 = 18 tissue specific assemblies (three organs: brain, kidney and liver; six species: human, mouse, rat, dog, pig and cynomolgus monkey). These assemblies and the manually curated human protein sequences from UniProtKB/Swiss-Prot were used in a reciprocal BLAST search to identify best matching hits. We automated and generalised our approach and present the a&o-tool, a workflow which exploits de novo assemblies of paired-end RNA-Seq data and orthology information for target sequence validation and refinement across related species. Furthermore, the a&o-tool extracts best hits' sequences from a reciprocal BLAST search, translates them into protein sequences, computes a multiple sequence alignment and quantifies the refinement. Results: For the three human assemblies we observed a hit rate greater than 60% with 100% sequence coverage and identity. For assemblies from the other species we observed similar hit rates and coverage with highest identities for cynomolgus monkey. Conclusions: In summary, we show how to refine protein sequences using RNA-Seq data and sequence information from closely related species. With the a&o-tool we provide a fully automated pipeline to perform refinement including cDNA translation and multiple sequence alignment for visual inspection. The major prerequisite for applying the a&o-tool is high quality sequencing data.",
                "authors": [
                    {
                        "name": "Sollner J.F."
                    },
                    {
                        "name": "Leparc G."
                    },
                    {
                        "name": "Zwick M."
                    },
                    {
                        "name": "Schonberger T."
                    },
                    {
                        "name": "Hildebrandt T."
                    },
                    {
                        "name": "Nieselt K."
                    },
                    {
                        "name": "Simon E."
                    }
                ],
                "date": "2019-05-23T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "Exploiting orthology and de novo transcriptome assembly to refine target sequence information"
            },
            "pmcid": "PMC6533699",
            "pmid": "31122257",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}