{"credit":[{"typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://sourceforge.net/projects/ngopt/"}],"documentation":[{"type":"GENERAL","url":"https://sourceforge.net/projects/ngopt/"}],"function":[{"operation":[{"term":"Deposition","uri":"http://edamontology.org/operation_3431"}]},{"operation":[{"term":"Sequence assembly","uri":"http://edamontology.org/operation_0310"}]},{"operation":[{"term":"De-novo assembly","uri":"http://edamontology.org/operation_0524"}]}],"labels":{"operatingSystem":["Linux","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Sequence assembly","uri":"http://edamontology.org/topic_0196"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/a5-miseq-20140604-de-novo-assembly-analysis-of-illumina-sequence-data.html"}],"publication":[{"abstract":"© 2014 The Author. Motivation: Open-source bacterial genome assembly remains inaccessible to many biologists because of its complexity. Few software solutions exist that are capable of automating all steps in the process of de novo genome assembly from Illumina data. Results: A5-miseq can produce high-quality microbial genome assemblies on a laptop computer without any parameter tuning. A5-miseq does this by automating the process of adapter trimming, quality filtering, error correction, contig and scaffold generation and detection of misassemblies. Unlike the original A5 pipeline, A5-miseq can use long reads from the Illumina MiSeq, use read pairing information during contig generation and includes several improvements to read trimming. Together, these changes result in substantially improved assemblies that recover a more complete set of reference genes than previous methods.","authors":["Coil D.","Jospin G.","Darling A.E."],"cit_count":289,"journal":"Bioinformatics","pmid":"25338718","title":"A5-miseq: An updated pipeline to assemble microbial genomes from Illumina MiSeq data","year":"2015-02-15"}],"summary":{"biotoolsCURIE":"biotools:a5-miseq","biotoolsID":"a5-miseq","description":"De novo assembly & analysis of Illumina sequence data, including the A5 pipeline, A5-miseq, tools to evaluate assembly quality, and scripts to facilitate data submission to NCBI and the RAST annotation system","homepage":"http://sourceforge.net/projects/ngopt/","name":"A5-miseq"}}