{
    "additionDate": "2017-08-03T18:36:03Z",
    "biotoolsCURIE": "biotools:avia",
    "biotoolsID": "avia",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://avia-abcc.ncifcrf.gov/apps/site/submit_a_question/"
        }
    ],
    "description": "Web based annotation and visualization workflow that allow users with variation data to easily get more information about their specific mutations without having to search multiple websites or databases.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://avia-abcc.ncifcrf.gov/apps/site/about"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                }
            ]
        }
    ],
    "homepage": "https://avia-abcc.ncifcrf.gov",
    "lastUpdate": "2024-11-24T20:39:04.219006Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/avia-analysis-of-genomic-variants-and-genes.html"
        }
    ],
    "name": "AVIA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btaa994",
            "metadata": {
                "abstract": "The Annotation, Visualization and Impact Analysis (AVIA) is a web application combining multiple features to annotate and visualize genomic variant data. Users can investigate functional significance of their genetic alterations across samples, genes and pathways. Version 3.0 of AVIA offers filtering options through interactive charts and by linking disease relevant data sources. Newly incorporated services include gene, variant and sample level reporting, literature and functional correlations among impacted genes, comparative analysis across samples and against data sources such as TCGA and ClinVar, and cohort building. Sample and data management is now feasible through the application, which allows greater flexibility with sharing, reannotating and organizing data. Most importantly, AVIA's utility stems from its convenience for allowing users to upload and explore results without any a priori knowledge or the need to install, update and maintain software or databases. Together, these enhancements strengthen AVIA as a comprehensive, user-driven variant analysis portal. Availabilityand implementation: AVIA is accessible online at https://avia-abcc.ncifcrf.gov.",
                "authors": [
                    {
                        "name": "Che A."
                    },
                    {
                        "name": "Collins J.R."
                    },
                    {
                        "name": "Luke B.T."
                    },
                    {
                        "name": "Mudunuri U.S."
                    },
                    {
                        "name": "Ravichandran S."
                    },
                    {
                        "name": "Reardon H.V."
                    }
                ],
                "citationCount": 1,
                "date": "2021-08-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AVIA 3.0: Interactive portal for genomic variant and sample level analysis"
            },
            "pmcid": "PMC8388034",
            "pmid": "33289511"
        },
        {
            "doi": "10.1093/bioinformatics/btv200",
            "metadata": {
                "abstract": "As sequencing becomes cheaper and more widely available, there is a greater need to quickly and effectively analyze large-scale genomic data. While the functionality of AVIA v1.0, whose implementation was based on ANNOVAR, was comparable with other annotation web servers, AVIA v2.0 represents an enhanced web-based server that extends genomic annotations to cell-specific transcripts and protein-level functional annotations. With AVIA's improved interface, users can better visualize their data, perform comprehensive searches and categorize both coding and non-coding variants. Availability and implementation: AVIA is freely available through the web at http://avia.abcc.ncifcrf.gov.",
                "authors": [
                    {
                        "name": "Che A."
                    },
                    {
                        "name": "Collins J.R."
                    },
                    {
                        "name": "Luke B.T."
                    },
                    {
                        "name": "Mudunuri U.S."
                    },
                    {
                        "name": "Ravichandran S."
                    },
                    {
                        "name": "Vuong H."
                    }
                ],
                "citationCount": 14,
                "date": "2015-01-19T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "AVIA v2.0: Annotation, visualization and impact analysis of genomic variants and genes"
            },
            "pmcid": "PMC4528632",
            "pmid": "25861966"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "DNA mutation",
            "uri": "http://edamontology.org/topic_2533"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}
