{
    "accessibility": "Open access",
    "additionDate": "2022-06-03T16:57:40.455230Z",
    "biotoolsCURIE": "biotools:fpmvs-cag",
    "biotoolsID": "fpmvs-cag",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "En Zhu",
            "orcidid": "https://orcid.org/0000-0003-2305-7555"
        },
        {
            "name": "Siwei Wang",
            "orcidid": "https://orcid.org/0000-0001-9517-262X"
        },
        {
            "name": "Xinwang Liu",
            "orcidid": "https://orcid.org/0000-0001-9066-1475"
        },
        {
            "name": "Xinzhong Zhu",
            "orcidid": "https://orcid.org/0000-0002-0033-5260"
        }
    ],
    "description": "Fast Parameter-free Multi-view Subspace Clustering with Consensus Anchor Guidance.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                }
            ]
        }
    ],
    "homepage": "https://github.com/wangsiwei2010/FPMVS-CAG",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2022-06-03T16:57:40.458603Z",
    "license": "Not licensed",
    "name": "FPMVS-CAG",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1109/TIP.2021.3131941",
            "metadata": {
                "abstract": "© 1992-2012 IEEE.Multi-view subspace clustering has attracted intensive attention to effectively fuse multi-view information by exploring appropriate graph structures. Although existing works have made impressive progress in clustering performance, most of them suffer from the cubic time complexity which could prevent them from being efficiently applied into large-scale applications. To improve the efficiency, anchor sampling mechanism has been proposed to select vital landmarks to represent the whole data. However, existing anchor selecting usually follows the heuristic sampling strategy, e.g. k -means or uniform sampling. As a result, the procedures of anchor selecting and subsequent subspace graph construction are separated from each other which may adversely affect clustering performance. Moreover, the involved hyper-parameters further limit the application of traditional algorithms. To address these issues, we propose a novel subspace clustering method termed Fast Parameter-free Multi-view Subspace Clustering with Consensus Anchor Guidance (FPMVS-CAG). Firstly, we jointly conduct anchor selection and subspace graph construction into a unified optimization formulation. By this way, the two processes can be negotiated with each other to promote clustering quality. Moreover, our proposed FPMVS-CAG is proved to have linear time complexity with respect to the sample number. In addition, FPMVS-CAG can automatically learn an optimal anchor subspace graph without any extra hyper-parameters. Extensive experimental results on various benchmark datasets demonstrate the effectiveness and efficiency of the proposed method against the existing state-of-the-art multi-view subspace clustering competitors. These merits make FPMVS-CAG more suitable for large-scale subspace clustering. The code of FPMVS-CAG is publicly available at https://github.com/wangsiwei2010/FPMVS-CAG.",
                "authors": [
                    {
                        "name": "Gao F."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Wang S."
                    },
                    {
                        "name": "Zhang P."
                    },
                    {
                        "name": "Zhang Y."
                    },
                    {
                        "name": "Zhu E."
                    },
                    {
                        "name": "Zhu X."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Image Processing",
                "title": "Fast Parameter-Free Multi-View Subspace Clustering with Consensus Anchor Guidance"
            },
            "pmid": "34890327"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
