{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:12:45Z",
    "biotoolsCURIE": "biotools:Subdyquency",
    "biotoolsID": "Subdyquency",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "weipeng1980@gmail.com",
            "name": "Wei Peng",
            "orcidid": "https://orcid.org/0000-0002-9572-951X",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Random walk-based method to identify driver genes by integrating the subcellular localization and variation frequency into bipartite graph.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/weiba/Subdyquency/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                }
            ]
        }
    ],
    "homepage": "https://github.com/weiba/Subdyquency",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "Unlicense",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/weiba/Subdyquency/issues"
        }
    ],
    "maturity": "Mature",
    "name": "Subdyquency",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1186/S12859-019-2847-9",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Cancer as a worldwide problem is driven by genomic alterations. With the advent of high-throughput sequencing technology, a huge amount of genomic data generates at every second which offer many valuable cancer information and meanwhile throw a big challenge to those investigators. As the major characteristic of cancer is heterogeneity and most of alterations are supposed to be useless passenger mutations that make no contribution to the cancer progress. Hence, how to dig out driver genes that have effect on a selective growth advantage in tumor cells from those tremendously and noisily data is still an urgent task. Results: Considering previous network-based method ignoring some important biological properties of driver genes and the low reliability of gene interactive network, we proposed a random walk method named as Subdyquency that integrates the information of subcellular localization, variation frequency and its interaction with other dysregulated genes to improve the prediction accuracy of driver genes. We applied our model to three different cancers: lung, prostate and breast cancer. The results show our model can not only identify the well-known important driver genes but also prioritize the rare unknown driver genes. Besides, compared with other existing methods, our method can improve the precision, recall and fscore to a higher level for most of cancer types. Conclusions: The final results imply that driver genes are those prone to have higher variation frequency and impact more dysregulated genes in the common significant compartment.",
                "authors": [
                    {
                        "name": "Peng W."
                    },
                    {
                        "name": "Song J."
                    },
                    {
                        "name": "Wang F."
                    }
                ],
                "citationCount": 6,
                "date": "2019-05-14T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "A random walk-based method to identify driver genes by integrating the subcellular localization and variation frequency into bipartite graph"
            },
            "pmcid": "PMC6518800",
            "pmid": "31088372",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
