{
    "additionDate": "2022-10-13T06:42:23.263999Z",
    "biotoolsCURIE": "biotools:gfnet",
    "biotoolsID": "gfnet",
    "collectionID": [
        "COVID-19"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Chaodong Fan"
        },
        {
            "name": "Xilong Qu"
        }
    ],
    "description": "Automatic segmentation of COVID-19 lung infection regions using CT images based on boundary features.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Backbone modelling",
                    "uri": "http://edamontology.org/operation_0479"
                },
                {
                    "term": "Network visualisation",
                    "uri": "http://edamontology.org/operation_3925"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                }
            ]
        }
    ],
    "homepage": "https://github.com/zengzhenhuan/GFNet",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2022-10-13T06:42:23.266479Z",
    "license": "Not licensed",
    "name": "GFNet",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.PATCOG.2022.108963",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdIn early 2020, the global spread of the COVID-19 has presented the world with a serious health crisis. Due to the large number of infected patients, automatic segmentation of lung infections using computed tomography (CT) images has great potential to enhance traditional medical strategies. However, the segmentation of infected regions in CT slices still faces many challenges. Specially, the most core problem is the high variability of infection characteristics and the low contrast between the infected and the normal regions. This problem leads to fuzzy regions in lung CT segmentation. To address this problem, we have designed a novel global feature network(GFNet) for COVID-19 lung infections: VGG16 as backbone, we design a Edge-guidance module(Eg) that fuses the features of each layer. First, features are extracted by reverse attention module and Eg is combined with it. This series of steps enables each layer to fully extract boundary details that are difficult to be noticed by previous models, thus solving the fuzzy problem of infected regions. The multi-layer output features are fused into the final output to finally achieve automatic and accurate segmentation of infected areas. We compared the traditional medical segmentation networks, UNet, UNet++, the latest model Inf-Net, and methods of few shot learning field. Experiments show that our model is superior to the above models in Dice, Sensitivity, Specificity and other evaluation metrics, and our segmentation results are clear and accurate from the visual effect, which proves the effectiveness of GFNet. In addition, we verify the generalization ability of GFNet on another “never seen” dataset, and the results prove that our model still has better generalization ability than the above model. Our code has been shared at https://github.com/zengzhenhuan/GFNet.",
                "authors": [
                    {
                        "name": "Fan C."
                    },
                    {
                        "name": "Qu X."
                    },
                    {
                        "name": "Xiao L."
                    },
                    {
                        "name": "Zeng Z."
                    }
                ],
                "date": "2022-12-01T00:00:00Z",
                "journal": "Pattern Recognition",
                "title": "GFNet: Automatic segmentation of COVID-19 lung infection regions using CT images based on boundary features"
            },
            "pmcid": "PMC9359771",
            "pmid": "35966970"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "validated": 1
}
