{
    "accessibility": "Open access",
    "additionDate": "2023-01-24T15:27:22.780978Z",
    "biotoolsCURIE": "biotools:wgdtree",
    "biotoolsID": "wgdtree",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "daliberles@temple.edu",
            "name": "David A. Liberles",
            "orcidid": "https://orcid.org/0000-0003-3487-8826",
            "typeEntity": "Person"
        },
        {
            "name": "C. Nicholas Henry"
        },
        {
            "name": "Claire S. Probst"
        },
        {
            "name": "Yuying Rong"
        }
    ],
    "description": "A phylogenetic software tool to examine conditional probabilities of retention following whole genome duplication events.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene tree construction",
                    "uri": "http://edamontology.org/operation_0553"
                },
                {
                    "term": "Phylogenetic tree reconciliation",
                    "uri": "http://edamontology.org/operation_3947"
                },
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Tree dating",
                    "uri": "http://edamontology.org/operation_3942"
                }
            ]
        }
    ],
    "homepage": "https://github.com/cnickh/wgdtree",
    "language": [
        "Python"
    ],
    "lastUpdate": "2024-11-24T15:10:30.790071Z",
    "license": "MIT",
    "name": "WGDTree",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12859-022-05042-w",
            "metadata": {
                "abstract": "Background: Multiple processes impact the probability of retention of individual genes following whole genome duplication (WGD) events. In analyzing two consecutive whole genome duplication events that occurred in the lineage leading to Atlantic salmon, a new phylogenetic statistical analysis was developed to examine the contingency of retention in one event based upon retention in a previous event. This analysis is intended to evaluate mechanisms of duplicate gene retention and to provide software to generate the test statistic for any genome with pairs of WGDs in its history. Results: Here a software package written in Python, ‘WGDTree’ for the analysis of duplicate gene retention following whole genome duplication events is presented. Using gene tree-species tree reconciliation to label gene duplicate nodes and differentiate between WGD and SSD duplicates, the tool calculates a statistic based upon the conditional probability of a gene duplicate being retained after a second whole genome duplication dependent upon the retention status after the first event. The package also contains methods for the simulation of gene trees with WGD events. After running simulations, the accuracy of the placement of events has been determined to be high. The conditional probability statistic has been calculated for Phalaenopsis equestris on a monocot species tree with a pair of consecutive WGD events on its lineage, showing the applicability of the method. Conclusions: A new software tool has been created for the analysis of duplicate genes in examination of retention mechanisms. The software tool has been made available on the Python package index and the source code can be found on GitHub here: https://github.com/cnickh/wgdtree.",
                "authors": [
                    {
                        "name": "Henry C.N."
                    },
                    {
                        "name": "Liberles D.A."
                    },
                    {
                        "name": "Miraszek J.L."
                    },
                    {
                        "name": "Piper K."
                    },
                    {
                        "name": "Probst C.S."
                    },
                    {
                        "name": "Rong Y."
                    },
                    {
                        "name": "Wilson A.E."
                    }
                ],
                "citationCount": 3,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "WGDTree: a phylogenetic software tool to examine conditional probabilities of retention following whole genome duplication events"
            },
            "pmcid": "PMC9701042",
            "pmid": "36434497"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Genomics",
            "uri": "http://edamontology.org/topic_0622"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
