{"credit":[{"email":"hlin@uestc.edu.cn","name":"Hao Lin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://lin.uestc.edu.cn/"}],"documentation":[{"type":"GENERAL","url":"http://lin.uestc.edu.cn/server/IG/readme"}],"function":[{"operation":[{"term":"Protein sequence analysis","uri":"http://edamontology.org/operation_2479"},{"term":"Protein identification","uri":"http://edamontology.org/operation_3767"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"},{"term":"Immunoproteins, genes and antigens","uri":"http://edamontology.org/topic_2830"},{"term":"Immunology","uri":"http://edamontology.org/topic_0804"},{"term":"Gene and protein families","uri":"http://edamontology.org/topic_0623"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/igpred-identifying-immunoglobulins.html"}],"publication":[{"abstract":"© The Royal Society of Chemistry 2016. Immunoglobulins, also called antibodies, are a group of cell surface proteins which are produced by the immune system in response to the presence of a foreign substance (called antigen). They play key roles in many medical, diagnostic and biotechnological applications. Correct identification of immunoglobulins is crucial to the comprehension of humoral immune function. With the avalanche of protein sequences identified in postgenomic age, it is highly desirable to develop computational methods to timely identify immunoglobulins. In view of this, we designed a predictor called \"IGPred\" by formulating protein sequences with the pseudo amino acid composition into which nine physiochemical properties of amino acids were incorporated. Jackknife cross-validated results showed that 96.3% of immunoglobulins and 97.5% of non-immunoglobulins can be correctly predicted, indicating that IGPred holds very high potential to become a useful tool for antibody analysis. For the convenience of most experimental scientists, a web-server for IGPred was established at http://lin.uestc.edu.cn/server/IGPred. We believe that the web-server will become a powerful tool to study immunoglobulins and to guide related experimental validations.","authors":["Tang H.","Chen W.","Lin H."],"cit_count":72,"journal":"Molecular BioSystems","pmid":"26883492","title":"Identification of immunoglobulins using Chou's pseudo amino acid composition with feature selection technique","year":"2016-01-01"}],"summary":{"biotoolsCURIE":"biotools:igpred","biotoolsID":"igpred","description":"The web-server IGPred was developed to identify the immunoglobulins (antibodies) based on the sequence information.","homepage":"http://lin.uestc.edu.cn/server/IGPred","name":"IGPred"}}