{
    "additionDate": "2022-09-26T18:47:24.287623Z",
    "biotoolsCURIE": "biotools:bert-promoter",
    "biotoolsID": "bert-promoter",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Jung-Su Chang"
        },
        {
            "name": "Nguyen Quoc Khanh Le"
        }
    ],
    "description": "An improved sequence-based predictor of DNA promoter using BERT pre-trained model and SHAP feature selection.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature selection",
                    "uri": "http://edamontology.org/operation_3936"
                },
                {
                    "term": "Promoter prediction",
                    "uri": "http://edamontology.org/operation_0440"
                }
            ]
        }
    ],
    "homepage": "https://github.com/khanhlee/bert-promoter",
    "language": [
        "Python"
    ],
    "lastUpdate": "2022-09-26T18:47:24.290116Z",
    "license": "Not licensed",
    "name": "BERT-Promoter",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/J.COMPBIOLCHEM.2022.107732",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdA promoter is a sequence of DNA that initializes the process of transcription and regulates whenever and wherever genes are expressed in the organism. Because of its importance in molecular biology, identifying DNA promoters are challenging to provide useful information related to its functions and related diseases. Several computational models have been developed to early predict promoters from high-throughput sequencing over the past decade. Although some useful predictors have been proposed, there remains short-falls in those models and there is an urgent need to enhance the predictive performance to meet the practice requirements. In this study, we proposed a novel architecture that incorporated transformer natural language processing (NLP) and explainable machine learning to address this problem. More specifically, a pre-trained Bidirectional Encoder Representations from Transformers (BERT) model was employed to encode DNA sequences, and SHapley Additive exPlanations (SHAP) analysis served as a feature selection step to look at the top-rank BERT encodings. At the last stage, different machine learning classifiers were implemented to learn the top features and produce the prediction outcomes. This study not only predicted the DNA promoters but also their activities (strong or weak promoters). Overall, several experiments showed an accuracy of 85.5 % and 76.9 % for these two levels, respectively. Our performance showed a superiority to previously published predictors on the same dataset in most measurement metrics. We named our predictor as BERT-Promoter and it is freely available at https://github.com/khanhlee/bert-promoter.",
                "authors": [
                    {
                        "name": "Chang J.-S."
                    },
                    {
                        "name": "Ho Q.-T."
                    },
                    {
                        "name": "Le N.Q.K."
                    },
                    {
                        "name": "Nguyen V.-N."
                    }
                ],
                "date": "2022-08-01T00:00:00Z",
                "journal": "Computational Biology and Chemistry",
                "title": "BERT-Promoter: An improved sequence-based predictor of DNA promoter using BERT pre-trained model and SHAP feature selection"
            },
            "pmid": "35863177"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ],
    "validated": 1
}
