{
    "additionDate": "2019-11-14T19:52:09Z",
    "biotoolsCURIE": "biotools:HowDe-SBT",
    "biotoolsID": "HowDe-SBT",
    "confidence_flag": "tool",
    "description": "Improved representation of sequence Bloom trees | Sequence Bloom Tree, supporting determined/how split filters | Jellyfish (Version 2.2.0 or later)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "https://github.com/medvedevgroup/HowDeSBT",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-12-14T09:32:57Z",
    "license": "MIT",
    "name": "HowDe-SBT",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ662",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.Motivation: Algorithmic solutions to index and search biological databases are a fundamental part of bioinformatics, providing underlying components to many end-user tools. Inexpensive next generation sequencing has filled publicly available databases such as the Sequence Read Archive beyond the capacity of traditional indexing methods. Recently, the Sequence Bloom Tree (SBT) and its derivatives were proposed as a way to efficiently index such data for queries about transcript presence. Results: We build on the SBT framework to construct the HowDe-SBT data structure, which uses a novel partitioning of information to reduce the construction and query time as well as the size of the index. Compared to previous SBT methods, on real RNA-seq data, HowDe-SBT can construct the index in less than 36% of the time and with 39% less space and can answer small-batch queries at least five times faster. We also develop a theoretical framework in which we can analyze and bound the space and query performance of HowDe-SBT compared to other SBT methods.",
                "authors": [
                    {
                        "name": "Harris R.S."
                    },
                    {
                        "name": "Medvedev P."
                    }
                ],
                "citationCount": 6,
                "date": "2020-02-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Improved representation of sequence bloom trees"
            },
            "pmid": "31504157"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}