{
    "accessibility": "Open access",
    "additionDate": "2024-04-26T12:51:51.787252Z",
    "biotoolsCURIE": "biotools:g-aligner",
    "biotoolsID": "g-aligner",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "yu_lab@sdfmu.edu.cn",
            "name": "Changbin Yu",
            "typeEntity": "Person"
        },
        {
            "name": "Ruimin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Graph-based feature alignment method for untargeted LC-MS-based metabolomics.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Feature extraction",
                    "uri": "http://edamontology.org/operation_3937"
                },
                {
                    "term": "Retention time prediction",
                    "uri": "http://edamontology.org/operation_3633"
                },
                {
                    "term": "Sequence alignment validation",
                    "uri": "http://edamontology.org/operation_0447"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CSi-Studio/G-Aligner",
    "language": [
        "Java",
        "Python"
    ],
    "lastUpdate": "2024-04-26T12:51:51.789259Z",
    "name": "G-Aligner",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12859-023-05525-4",
            "metadata": {
                "abstract": "Background: Liquid chromatography–mass spectrometry is widely used in untargeted metabolomics for composition profiling. In multi-run analysis scenarios, features of each run are aligned into consensus features by feature alignment algorithms to observe the intensity variations across runs. However, most of the existing feature alignment methods focus more on accurate retention time correction, while underestimating the importance of feature matching. None of the existing methods can comprehensively consider feature correspondences among all runs and achieve optimal matching. Results: To comprehensively analyze feature correspondences among runs, we propose G-Aligner, a graph-based feature alignment method for untargeted LC–MS data. In the feature matching stage, G-Aligner treats features and potential correspondences as nodes and edges in a multipartite graph, considers the multi-run feature matching problem an unbalanced multidimensional assignment problem, and provides three combinatorial optimization algorithms to find optimal matching solutions. In comparison with the feature alignment methods in OpenMS, MZmine2 and XCMS on three public metabolomics benchmark datasets, G-Aligner achieved the best feature alignment performance on all the three datasets with up to 9.8% and 26.6% increase in accurately aligned features and analytes, and helped all comparison software obtain more accurate results on their self-extracted features by integrating G-Aligner to their analysis workflow. G-Aligner is open-source and freely available at https://github.com/CSi-Studio/G-Aligner under a permissive license. Benchmark datasets, manual annotation results, evaluation methods and results are available at https://doi.org/10.5281/zenodo.8313034 Conclusions: In this study, we proposed G-Aligner to improve feature matching accuracy for untargeted metabolomics LC–MS data. G-Aligner comprehensively considered potential feature correspondences between all runs, converting the feature matching problem as a multidimensional assignment problem (MAP). In evaluations on three public metabolomics benchmark datasets, G-Aligner achieved the highest alignment accuracy on manual annotated and popular software extracted features, proving the effectiveness and robustness of the algorithm.",
                "authors": [
                    {
                        "name": "An S."
                    },
                    {
                        "name": "Lu M."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Yu C."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "G-Aligner: a graph-based feature alignment method for untargeted LC–MS-based metabolomics"
            },
            "pmcid": "PMC10644574",
            "pmid": "37964228"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Proteomics experiment",
            "uri": "http://edamontology.org/topic_3520"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        }
    ]
}
