
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://fantom.gsc.riken.jp/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "https://sourceforge.net/projects/moirai/files/document/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Processing",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Quality control",
                    "uri": "http://edamontology.org/operation_2428"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "PHP",
            "Java",
            "C++",
            "Perl"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Data quality",
                "uri": "http://edamontology.org/topic_3572"
            },
            {
                "term": "Workflows",
                "uri": "http://edamontology.org/topic_0769"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/moirai-20140528-compact-workflow-system-for-cage-analysis.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: Cap analysis of gene expression (CAGE) is a sequencing based technology to capture the 5' ends of RNAs in a biological sample. After mapping, a CAGE peak on the genome indicates the position of an active transcriptional start site (TSS) and the number of reads correspond to its expression level. CAGE is prominently used in both the FANTOM and ENCODE project but presently there is no software package to perform the essential data processing steps. Results: Here we describe MOIRAI, a compact yet flexible workflow system designed to carry out the main steps in data processing and analysis of CAGE data. MOIRAI has a graphical interface allowing wet-lab researchers to create, modify and run analysis workflows. Embedded within the workflows are graphical quality control indicators allowing users assess data quality and to quickly spot potential problems. We will describe three main workflows allowing users to map, annotate and perform an expression analysis over multiple samples.Conclusions: Due to the many built in quality control features MOIRAI is especially suitable to support the development of new sequencing based protocols.Availiability: The MOIRAI source code is freely available at http://sourceforge.net/projects/moirai/. © 2014 Hasegawa et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Hasegawa A.",
                "Daub C.",
                "Carninci P.",
                "Hayashizaki Y.",
                "Lassmann T."
            ],
            "cit_count": 17,
            "doi": "10.1186/1471-2105-15-144",
            "journal": "BMC Bioinformatics",
            "title": "MOIRAI: A compact workflow system for CAGE analysis",
            "type": "Primary",
            "year": "2014-05-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:moirai",
        "biotoolsID": "moirai",
        "description": "MOIRAI is a compact yet flexible workflow system designed to carry out the main steps in data processing and analysis of CAGE data. MOIRAI has a graphical interface allowing wet-lab researchers to create, modify and run analysis workflows. Embedded within the workflows are graphical quality control indicators allowing users assess data quality and to quickly spot potential problems.",
        "homepage": "http://sourceforge.net/projects/moirai/",
        "name": "MOIRAI",
        "version": [
            "20140528"
        ]
    }
}