{
    "accessibility": "Open access",
    "additionDate": "2022-06-06T11:22:37.483513Z",
    "biotoolsCURIE": "biotools:chitah",
    "biotoolsID": "chitah",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "milana.morgenstern@biu.ac.il",
            "name": "Milana Frenkel-Morgenstern",
            "orcidid": "https://orcid.org/0000-0002-0329-4599",
            "typeEntity": "Person"
        }
    ],
    "description": "ChiTaH, a fast and accurate method for the discovery of known human chimeras or fusion genes using DNA-Seq or RNA-Seq data generated using NGS technologies",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Chimera detection",
                    "uri": "http://edamontology.org/operation_0450"
                },
                {
                    "term": "Genome analysis",
                    "uri": "http://edamontology.org/operation_3918"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/Rajesh-Detroja/ChiTaH",
    "language": [
        "Shell"
    ],
    "lastUpdate": "2022-06-06T11:22:37.486758Z",
    "name": "ChiTaH",
    "operatingSystem": [
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1093/NARGAB/LQAB112",
            "metadata": {
                "abstract": "© 2021 The Author(s) 2021. Published by Oxford University Press on behalf of NAR Genomics and Bioinformatics.Fusion genes or chimeras typically comprise sequences from two different genes. The chimeric RNAs of such joined sequences often serve as cancer drivers. Identifying such driver fusions in a given cancer or complex disease is important for diagnosis and treatment. The advent of next-generation sequencing technologies, such as DNA-Seq or RNA-Seq, together with the development of suitable computational tools, has made the global identification of chimeras in tumors possible. However, the testing of over 20 computational methods showed these to be limited in terms of chimera prediction sensitivity, specificity, and accurate quantification of junction reads. These shortcomings motivated us to develop the first 'reference-based' approach termed ChiTaH (Chimeric Transcripts from High-throughput sequencing data). ChiTaH uses 43,466 non-redundant known human chimeras as a reference database to map sequencing reads and to accurately identify chimeric reads. We benchmarked ChiTaH and four other methods to identify human chimeras, leveraging both simulated and real sequencing datasets. ChiTaH was found to be the most accurate and fastest method for identifying known human chimeras from simulated and sequencing datasets. Moreover, especially ChiTaH uncovered heterogeneity of the BCR-ABL1 chimera in both bulk and single-cells of the K-562 cell line, which was confirmed experimentally.",
                "authors": [
                    {
                        "name": "Baum G."
                    },
                    {
                        "name": "Detroja R."
                    },
                    {
                        "name": "Frenkel-Morgenstern M."
                    },
                    {
                        "name": "Giwa O."
                    },
                    {
                        "name": "Gorohovski A."
                    }
                ],
                "citationCount": 1,
                "date": "2021-12-01T00:00:00Z",
                "journal": "NAR Genomics and Bioinformatics",
                "title": "ChiTaH: A fast and accurate tool for identifying known human chimeric sequences from high-throughput sequencing data"
            },
            "pmcid": "PMC8633610",
            "pmid": "34859212"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Gene structure",
            "uri": "http://edamontology.org/topic_0114"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
