{
    "additionDate": "2021-01-18T11:19:44Z",
    "biotoolsCURIE": "biotools:adact",
    "biotoolsID": "adact",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "msrahman@cse.buet.ac.bd",
            "name": "M Sohel Rahman",
            "typeEntity": "Person"
        }
    ],
    "description": "A Tool for Analysing (Dis)similarity among Nucleotide and Protein Sequences Using Minimal and Relative Absent Words.\n\nADACT (The Alignment-free Dissimilarity Analysis & Comparison Tool) measures dissimilarities among several species in an alignment-free manner. ADACT takes several genome sequences and some parameters (e.g. K-mer size, absent word type, dissimilarity index, RC-setting) as input, and outputs distance matrix, sorted species relationship and phylogenetic trees (neighbor joining tree and UPGMA tree) among species.",
    "documentation": [
        {
            "note": "Documentation for Web API",
            "type": [
                "User manual"
            ],
            "url": "https://github.com/mujtahid-akon/ADACT/wiki"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Species tree construction",
                    "uri": "http://edamontology.org/operation_0544"
                },
                {
                    "term": "Phylogenetic tree comparison",
                    "uri": "http://edamontology.org/operation_0325"
                },
                {
                    "term": "Sequence distance matrix generation",
                    "uri": "http://edamontology.org/operation_0289"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "http://research.buet.ac.bd/ADACT/",
    "language": [
        "PHP",
        "JavaScript"
    ],
    "lastUpdate": "2021-01-21T12:55:54Z",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/mujtahid-akon/ADACT/"
        }
    ],
    "name": "ADACT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA853",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com.MOTIVATION: Researchers and practitioners use a number of popular sequence comparison tools that use many alignment-based techniques. Due to high time and space complexity and length-related restrictions, researchers often seek alignment-free tools. Recently, some interesting ideas, namely, Minimal Absent Words (MAW) and Relative Absent Words (RAW), have received much interest among the scientific community as distance measures that can give us alignment-free alternatives. This drives us to structure a framework for analysing biological sequences in an alignment-free manner. RESULTS: In this application note, we present Alignment-free Dissimilarity Analysis & Comparison Tool (ADACT), a simple web-based tool that computes the analogy among sequences using a varied number of indexes through the distance matrix, species relation list and phylogenetic tree. This tool basically combines absent word (MAW or RAW) computation, dissimilarity measures, species relationship and thus brings all required software in one platform for the ease of researchers and practitioners alike in the field of bioinformatics. We have also developed a restful API. AVAILABILITY AND IMPLEMENTATION: ADACT has been hosted at http://research.buet.ac.bd/ADACT/. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Akon M."
                    },
                    {
                        "name": "Akon M."
                    },
                    {
                        "name": "Kabir M."
                    },
                    {
                        "name": "Rahman M.S."
                    },
                    {
                        "name": "Rahman M.S."
                    }
                ],
                "date": "2021-06-16T00:00:00Z",
                "journal": "Bioinformatics (Oxford, England)",
                "title": "ADACT: a tool for analysing (dis)similarity among nucleotide and protein sequences using minimal and relative absent words"
            },
            "pmid": "33016997"
        }
    ],
    "toolType": [
        "Web application",
        "Web API"
    ],
    "topic": [
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        }
    ],
    "validated": 1
}