{
    "additionDate": "2017-03-24T11:31:13Z",
    "biotoolsCURIE": "biotools:webgestalt",
    "biotoolsID": "webgestalt",
    "credit": [
        {
            "email": "suhas.vasaikar@bcm.edu",
            "name": "Suhas Vasaikar",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "zhiao.shi@bcm.edu",
            "name": "Zhiao Shi",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "email": "bing.zhang@bcm.edu",
            "name": "Bing Zhang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "System facilitating the analysis of sets of genes.  Gene sets can be compared using set operations (intersection, union, etc.), different annotations can be selected and retrieved for the set, and sets can be visualized and organized by a user-selected method (Gene Ontology, chromosomal distribution, etc.).  WebGestalt can also perform a statistical analysis to suggest areas of interest with respect to the set of genes selected. Pathway maps.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://www.webgestalt.org/WebGestalt_2017_Manual.pdf"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene set testing",
                    "uri": "http://edamontology.org/operation_3224"
                },
                {
                    "term": "Over-representation analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Gene expression profile pathway mapping",
                    "uri": "http://edamontology.org/operation_0533"
                }
            ]
        }
    ],
    "homepage": "http://www.webgestalt.org/option.php",
    "language": [
        "PHP"
    ],
    "lastUpdate": "2021-01-03T16:18:50Z",
    "name": "WebGestalt",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "High-throughput technologies have led to the rapid generation of large-scale datasets about genes and gene products. These technologies have also shifted our research focus from 'single genes' to 'gene sets'. We have developed a web-based integrated data mining system, WebGestalt http://genereg.ornl.gov/webgestalt/, to help biologists in exploring large sets of genes. WebGestalt is composed of four modules: gene set management, information retrieval, organization/ visualization, and statistics. The management module uploads, saves, retrieves and deletes gene sets, as well as performs Boolean operations to generate the unions, intersections or differences between different gene sets. The information retrieval module currently retrieves information for up to 20 attributes for all genes in a gene set. The organization/visualization module organizes and visualizes gene sets in various biological contexts, including Gene Ontology, tissue expression pattern, chromosome distribution, metabolic and signaling pathways, protein domain information and publications. The statistics module recommends and performs statistical tests to suggest biological areas that are important to a gene set and warrant further investigation. In order to demonstrate the use of WebGestalt, we have generated 48 gene sets with genes over-represented in various human tissue types. Exploration of all the 48 gene sets using WebGestalt is available for the public at http://genereg.ornl.gov/webgestalt/wg_enrich.php. © 2005 Oxford University Press.",
                "authors": [
                    {
                        "name": "Zhang B."
                    },
                    {
                        "name": "Kirov S."
                    },
                    {
                        "name": "Snoddy J."
                    }
                ],
                "citationCount": 1241,
                "date": "2005-07-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "WebGestalt: An integrated system for exploring gene sets in various biological contexts"
            },
            "pmid": "15980575"
        },
        {
            "metadata": {
                "abstract": "Functional enrichment analysis is an essential task for the interpretation of gene lists derived from large-scale genetic, transcriptomic and proteomic studies. WebGestalt (WEB-based GEne SeT AnaLysis Toolkit) has become one of the popular software tools in this field since its publication in 2005. For the last 7 years, WebGestalt data holdings have grown substantially to satisfy the requirements of users from different research areas. The current version of WebGestalt supports 8 organisms and 201 gene identifiers from various databases and different technology platforms, making it directly available to the fast growing omics community. Meanwhile, by integrating functional categories derived from centrally and publicly curated databases as well as computational analyses, WebGestalt has significantly increased the coverage of functional categories in various biological contexts including Gene Ontology, pathway, network module, gene-phenotype association, gene-disease association, gene-drug association and chromosomal location, leading to a total of 78 612 functional categories. Finally, new interactive features, such as pathway map, hierarchical network visualization and phenotype ontology visualization have been added to WebGestalt to help users better understand the enrichment results. WebGestalt can be freely accessed through http://www.webgestalt.org or http://bioinfo.vanderbilt.edu/webgestalt/.",
                "authors": [
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Duncan D."
                    },
                    {
                        "name": "Shi Z."
                    },
                    {
                        "name": "Zhang B."
                    }
                ],
                "citationCount": 1050,
                "date": "2013-01-01T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "WEB-based GEne SeT AnaLysis Toolkit (WebGestalt): update 2013."
            },
            "pmid": "23703215"
        },
        {
            "doi": "10.3892/MMR.2019.10522",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.Type 2 diabetes mellitus (T2DM) is a metabolic disorder. Numerous proteins have been identified that are associated with the occurrence and development of T2DM. This study aimed to identify potential core genes and pathways involved in T2DM, through exhaustive bioinformatic analyses using GSE20966 microarray profiles of pancreatic β-cells obtained from healthy controls and patients with T2DM. The original microarray data were downloaded from the Gene expression omnibus database. Data were processed by the limma package in r software and the differentially expressed genes (DEGs) were identified. Gene ontology functional analysis and Kyoto encyclopedia of Genes and Genomes pathway analysis were carried out to identify potential biological functions and pathways of the DEGs. Key transcription factors were identified using the WEB-based GEne SeT AnaLysis Toolkit (WebGestalt) and Enrichr. The Search Tool for the Retrieval of Interacting Genes (STRING) database was used to establish a protein-protein interaction (PPI) network for the DEGs. In total, 329 DEGs were involved in T2DM, with 208 upregulated genes enriched in pancreatic secretion and the complement and coagulation cascades, and 121 downregulated genes enriched in insulin secretion, carbohydrate digestion and absorption, and the Toll-like receptor pathway. Furthermore, hepatocyte nuclear factor 1-alpha (HNF1A), signal transducer and activator of transcription 3 (STAT3) and glucocorticoid receptor (GR) were key transcription factors in T2DM. Twenty important nodes were detected in the PPI network. Finally, two core genes, serpin family G member 1 (SERPING1) and alanyl aminopeptidase, membrane (ANPEP), were shown to be associated with the development of T2DM. On the whole, the findings of this study enhance our understanding of the potential molecular mechanisms of T2DM and provide potential targets for further research.",
                "authors": [
                    {
                        "name": "Ding L."
                    },
                    {
                        "name": "Fan L."
                    },
                    {
                        "name": "Xu X."
                    },
                    {
                        "name": "Fu J."
                    },
                    {
                        "name": "Xue Y."
                    }
                ],
                "citationCount": 9,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Molecular Medicine Reports",
                "title": "Identification of core genes and pathways in type 2 diabetes mellitus by bioinformatics analysis"
            },
            "pmcid": "PMC6691242",
            "pmid": "31524257"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ],
    "validated": 1
}