{
    "accessibility": "Open access",
    "additionDate": "2022-08-29T21:39:40.331798Z",
    "biotoolsCURIE": "biotools:throne",
    "biotoolsID": "throne",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Balachandran Manavalan"
        },
        {
            "name": "Gwang Lee"
        },
        {
            "name": "Shaherin Basith"
        },
        {
            "name": "Thejkiran Pitti"
        },
        {
            "name": "Watshara Shoombuatong"
        }
    ],
    "description": "A New Approach for Accurate Prediction of Human RNA N7-Methylguanosine Sites.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "RNA sequence",
                        "uri": "http://edamontology.org/data_3495"
                    },
                    "format": [
                        {
                            "term": "FASTA",
                            "uri": "http://edamontology.org/format_1929"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Data handling",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://thegleelab.org/THRONE/",
    "lastUpdate": "2022-08-29T21:39:40.334496Z",
    "name": "THRONE",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1016/J.JMB.2022.167549",
            "metadata": {
                "abstract": "© 2022 Elsevier LtdN7-methylguanosine (m7G) is an essential, ubiquitous, and positively charged modification at the 5′ cap of eukaryotic mRNA, modulating its export, translation, and splicing processes. Although several machine learning (ML)-based computational predictors for m7G have been developed, all utilized specific computational framework. This study is the first instance we explored four different computational frameworks and identified the best approach. Based on that we developed a novel predictor, THRONE (A three-layer ensemble predictor for identifying human RNA N7-methylguanosine sites) to accurately identify m7G sites from the human genome. THRONE employs a wide range of sequence-based features inputted to several ML classifiers and combines these models through ensemble learning. The three-step ensemble learning is as follows: 54 baseline models were constructed in the first layer and the predicted probability of m7G was considered as a new feature vector for the sequential step. Subsequently, six meta-models were created using the new feature vector and their predicted probability was yet again considered as novel features. Finally, random forest was deemed as the best super classifier learner for the final prediction using a systematic approach incorporated with novel features. Interestingly, THRONE outperformed other existing methods in the prediction of m7G sites on both cross-validation analysis and independent evaluation. The proposed method is publicly accessible at: http://thegleelab.org/THRONE/ and expects to help the scientific community identify the putative m7G sites and formulate a novel testable biological hypothesis.",
                "authors": [
                    {
                        "name": "Basith S."
                    },
                    {
                        "name": "Lee G."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Pitti T."
                    },
                    {
                        "name": "Shoombuatong W."
                    }
                ],
                "citationCount": 3,
                "date": "2022-06-15T00:00:00Z",
                "journal": "Journal of Molecular Biology",
                "title": "THRONE: A New Approach for Accurate Prediction of Human RNA N7-Methylguanosine Sites"
            },
            "pmid": "35662472"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        }
    ],
    "validated": 1
}
