{
    "accessibility": "Open access",
    "additionDate": "2020-11-19T10:16:55Z",
    "biotoolsCURIE": "biotools:metaseqr2",
    "biotoolsID": "metaseqr2",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "moulos@fleming.gr",
            "name": "Panagiotis Moulos",
            "typeRole": [
                "Developer",
                "Primary contact"
            ]
        }
    ],
    "description": "metaseqR2 provides an interface to several normalization and statistical testing packages for RNA-Seq gene expression data. Additionally, it creates several diagnostic plots, performs meta-analysis by combinining the results of several statistical tests and reports the results in an interactive way. In the new version, the underlying PANDORA algorithm has been extended with additional statistical analysis tools, the report has been completely redesigned and is fully ineractive, there is an annotation database building system and all actions run 5-50x faster.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://bioconductor.org/packages/release/bioc/html/metaseqR2.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T15:18:59.905413Z",
    "license": "AFL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/pmoulos/metaseqR2/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/pmoulos/metaseqR2"
        }
    ],
    "maturity": "Mature",
    "name": "metaseqR2",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "pmoulos",
    "publication": [
        {
            "doi": "10.1093/bib/bbaa156",
            "metadata": {
                "abstract": "The study of differential gene expression patterns through RNA-Seq comprises a routine task in the daily lives of molecular bioscientists, who produce vast amounts of data requiring proper management and analysis. Despite widespread use, there are still no widely accepted golden standards for the normalization and statistical analysis of RNA-Seq data, and critical biases, such as gene lengths and problems in the detection of certain types of molecules, remain largely unaddressed. Stimulated by these unmet needs and the lack of in-depth research into the potential of combinatorial methods to enhance the analysis of differential gene expression, we had previously introduced the PANDORA P-value combination algorithm while presenting evidence for PANDORA's superior performance in optimizing the tradeoff between precision and sensitivity. In this article, we present the next generation of the algorithm along with a more in-depth investigation of its capabilities to effectively analyze RNA-Seq data. In particular, we show that PANDORA-reported lists of differentially expressed genes are unaffected by biases introduced by different normalization methods, while, at the same time, they comprise a reliable input option for downstream pathway analysis. Additionally, PANDORA outperforms other methods in detecting differential expression patterns in certain transcript types, including long non-coding RNAs.",
                "authors": [
                    {
                        "name": "Fanidis D."
                    },
                    {
                        "name": "Moulos P."
                    }
                ],
                "citationCount": 17,
                "date": "2021-05-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "Integrative, normalization-insusceptible statistical analysis of RNA-Seq data, with improved differential expression and unbiased downstream functional analysis"
            },
            "pmid": "32778872",
            "type": [
                "Method"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}
