{
    "additionDate": "2017-03-27T07:56:37Z",
    "biotoolsCURIE": "biotools:pubchem",
    "biotoolsID": "pubchem",
    "credit": [
        {
            "email": "pubchem-help@ncbi.nlm.nih.gov",
            "name": "PubChem Support",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://pubchemdocs.ncbi.nlm.nih.gov/contact"
        }
    ],
    "description": "The PubChem BioAssay database is a public repository for biological activities of small molecules and small interfering RNAs (siRNAs). It archives experimental descriptions of assays and biological test results. A PubChem BioAssay data entry includes an assay description, a summary and detailed test results. Each assay record is linked to the molecular target, whenever possible, and is cross-referenced to other NCBI database records.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://pubchemdocs.ncbi.nlm.nih.gov"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Aggregation",
                    "uri": "http://edamontology.org/operation_3436"
                }
            ]
        }
    ],
    "homepage": "http://pubchem.ncbi.nlm.nih.gov/",
    "lastUpdate": "2021-04-18T13:18:27.102018Z",
    "name": "PubChem",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "otherID": [
        {
            "type": "rrid",
            "value": "RRID:SCR_004284"
        }
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "The PubChem BioAssay database (http://pubchem.ncbi.nlm.nih.gov) is a public repository for biological activities of small molecules and small interfering RNAs (siRNAs) hosted by the US National Institutes of Health (NIH). It archives experimental descriptions of assays and biological test results and makes the information freely accessible to the public. A PubChem BioAssay data entry includes an assay description, a summary and detailed test results. Each assay record is linked to the molecular target, whenever possible, and is cross-referenced to other National Center for Biotechnology Information (NCBI) database records. 'Related BioAssays' are identified by examining the assay target relationship and activity profile of commonly tested compounds. A key goal of PubChem BioAssay is to make the biological activity information easily accessible through the NCBI information retrieval system-Entrez, and various web-based PubChem services. An integrated suite of data analysis tools are available to optimize the utility of the chemical structure and biological activity information within PubChem, enabling researchers to aggregate, compare and analyze biological test results contributed by multiple organizations. In this work, we describe the PubChem BioAssay database, including data model, bioassay deposition and utilities that PubChem provides for searching, downloading and analyzing the biological activity information contained therein. © Published by Oxford University Press 2009.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Bolton E."
                    },
                    {
                        "name": "Dracheva S."
                    },
                    {
                        "name": "Karapetyan K."
                    },
                    {
                        "name": "Shoemaker B.A."
                    },
                    {
                        "name": "Suzek T.O."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Xiao J."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Bryant S.H."
                    }
                ],
                "citationCount": 226,
                "date": "2009-11-19T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "An overview of the PubChem BioAssay resource"
            },
            "pmid": "19933261"
        },
        {
            "metadata": {
                "abstract": "PubChem (http://pubchem.ncbi.nlm.nih.gov) is a public repository for biological activity data of small molecules and RNAi reagents. The mission of PubChem is to deliver free and easy access to all deposited data, and to provide intuitive data analysis tools. The PubChem BioAssay database currently contains 500 000 descriptions of assay protocols, covering 5000 protein targets, 30 000 gene targets and providing over 130 million bioactivity outcomes. PubChem's bioassay data are integrated into the NCBI Entrez information retrieval system, thus making PubChem data searchable and accessible by Entrez queries. Also, as a repository, PubChem constantly optimizes and develops its deposition system answering many demands of both high- and low-volume depositors. The PubChem information platform allows users to search, review and download bioassay description and data. The PubChem platform also enables researchers to collect, compare and analyze biological test results through web-based and programmatic tools. In this work, we provide an update for the PubChem BioAssay resource, including information content growth, data model extension and new developments of data submission, retrieval, analysis and download tools.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Xiao J."
                    },
                    {
                        "name": "Suzek T.O."
                    },
                    {
                        "name": "Zhang J."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhou Z."
                    },
                    {
                        "name": "Han L."
                    },
                    {
                        "name": "Karapetyan K."
                    },
                    {
                        "name": "Dracheva S."
                    },
                    {
                        "name": "Shoemaker B.A."
                    },
                    {
                        "name": "Bolton E."
                    },
                    {
                        "name": "Gindulyte A."
                    },
                    {
                        "name": "Bryant S.H."
                    }
                ],
                "citationCount": 354,
                "date": "2012-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "PubChem's BioAssay database"
            },
            "pmid": "22140110"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        }
    ],
    "validated": 1
}