
{
    "credit": [
        {
            "email": "ikavakiotis@gmail.com",
            "name": "Ioannis Kavakiotis",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://mlkd.csd.auth.gr/bio/miga/"
        }
    ],
    "documentation": [
        {
            "type": "User manual",
            "url": "http://mlkd.csd.auth.gr/bio/miga/tutorial.html"
        },
        {
            "type": "User manual",
            "url": "http://mlkd.csd.auth.gr/bio/miga/download/MiGAUsersGuide.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "SQL"
        ],
        "operatingSystem": [
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Microsatellite loci comprise an important part of eukaryotic genomes. Their applications in biology as genetic markers are related to numerous fields ranging from paternity analyses to construction of genetic maps and linkage to human disease. Existing software solutions which offer pattern discovery algorithms for the correct identification and downstream analysis of microsatellites are scarce and are proving to be inefficient to analyze large, exponentially increasing, sequenced genomes. Moreover, such analyses can be very difficult for bioinformatically inexperienced biologists. In this paper we present Microsatellite Genome Analysis (MiGA) software for the detection of all microsatellite loci in genomic data through a user friendly interface. The algorithm searches exhaustively and rapidly for most microsatellites. Contrary to other applications, MiGA takes into consideration the following three most important aspects: the efficiency of the algorithm, the usability of the software and the plethora of offered summary statistics. All of the above, help biologists to obtain basic quantitative and qualitative information regarding the presence of microsatellites in genomic data as well as downstream processes, such as selection of specific microsatellite loci for primer design and comparative genome analysis. © 2014 Elsevier Ltd.",
            "authors": [
                "Kavakiotis I.",
                "Triantafyllidis A.",
                "Samaras P.",
                "Voulgaridis A.",
                "Karaiskou N.",
                "Konstantinidis E.",
                "Vlahavas I."
            ],
            "cit_count": 0,
            "journal": "Computers in Biology and Medicine",
            "pmid": "24529207",
            "title": "Pattern discovery for microsatellite genome analysis",
            "year": "2014-03-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:miga",
        "biotoolsID": "miga",
        "description": "Pattern discovery for microsatellite genome analysis. MiGA is a user friendly programme for the detection of all microsatellite loci in genomic data.",
        "homepage": "http://mlkd.csd.auth.gr/bio/miga/",
        "name": "MiGA"
    }
}