{
    "additionDate": "2020-01-14T09:50:38Z",
    "biotoolsCURIE": "biotools:fluorescent_robotic_imager",
    "biotoolsID": "fluorescent_robotic_imager",
    "confidence_flag": "tool",
    "description": "Inexpensive robotic system for standard and fluorescent imaging of protein crystals.\n\nCode and .obj files for construction of a fluorescent robotic imager used for protein crystallography.\n\nCode and .obj files for construction of a robotic imager capable of using visible fluorescence to automatically image plates from protein crystallization experiments.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                },
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dakota0064/Fluorescent_Robotic_Imager",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-29T10:03:25Z",
    "license": "Apache-2.0",
    "name": "Fluorescent Robotic Imager",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1107/S2053230X19014730",
            "metadata": {
                "abstract": "© 2019 International Union of Crystallography.Protein-crystallization imaging and classification is a labor-intensive process typically performed either by humans or by instruments that currently cost well over 100000. This cost puts the use of crystallization-trial imaging outside the reach of most academic laboratories, and also start-up biotechnology firms, where resources are scarce. An imaging system has been designed and prototyped which automatically captures images from multi-well protein-crystallization experiments using both standard and fluorescent imaging techniques at a cost 28 times lower than current market rates. The machine uses a Panowin F1 3D printer as a base and controls it using G-code commands sent from a Python script running on a desktop computer. A graphical user interface (GUI) was developed to enable users to control the machine and facilitate image capture, classification and editing. A 488nm laser diode and a 525nm filter were incorporated to allow in situ fluorescent imaging of proteins trace-labeled with a fluorophore, Alexa Fluor 488. The instrument was primarily designed using a 3D printer and augmented using commercially available parts, and this publication aims to serve as a guide for comparable in-laboratory robotics projects.",
                "authors": [
                    {
                        "name": "Handzlik D."
                    },
                    {
                        "name": "Larson E.T."
                    },
                    {
                        "name": "Munschy E."
                    },
                    {
                        "name": "Obmolova G."
                    },
                    {
                        "name": "Collin D."
                    },
                    {
                        "name": "Craig T.K."
                    }
                ],
                "citationCount": 2,
                "date": "2019-11-01T00:00:00Z",
                "journal": "Acta Crystallographica Section F: Structural Biology Communications",
                "title": "Inexpensive robotic system for standard and fluorescent imaging of protein crystals"
            },
            "pmid": "31702581"
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "Biotechnology",
            "uri": "http://edamontology.org/topic_3297"
        }
    ],
    "validated": 1
}