
{
    "credit": [
        {
            "email": "xuejun.liu@nuaa.edu.cn",
            "name": "Xuejun Liu",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://parnec.nuaa.edu.cn/liux/"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/PUGEA/NLDMseq/blob/master/README.md"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/nldmseq-expression-calculation-at-both-gene-and-isoform-levels-from-rna-seq-data-given-a-reference-transcriptom.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2015 Liu et al.Background: The high-throughput sequencing technology, RNA-Seq, has been widely used to quantify gene and isoform expression in the study of transcriptome in recent years. Accurate expression measurement from the millions or billions of short generated reads is obstructed by difficulties. One is ambiguous mapping of reads to reference transcriptome caused by alternative splicing. This increases the uncertainty in estimating isoform expression. The other is non-uniformity of read distribution along the reference transcriptome due to positional, sequencing, mappability and other undiscovered sources of biases. This violates the uniform assumption of read distribution for many expression calculation approaches, such as the direct RPKM calculation and Poisson-based models. Many methods have been proposed to address these difficulties. Some approaches employ latent variable models to discover the underlying pattern of read sequencing. However, most of these methods make bias correction based on surrounding sequence contents and share the bias models by all genes. They therefore cannot estimate gene- and isoform-specific biases as revealed by recent studies. Results: We propose a latent variable model, NLDMseq, to estimate gene and isoform expression. Our method adopts latent variables to model the unknown isoforms, from which reads originate, and the underlying percentage of multiple spliced variants. The isoform- and exon-specific read sequencing biases are modeled to account for the non-uniformity of read distribution, and are identified by utilizing the replicate information of multiple lanes of a single library run. We employ simulation and real data to verify the performance of our method in terms of accuracy in the calculation of gene and isoform expression. Results show that NLDMseq obtains competitive gene and isoform expression compared to popular alternatives. Finally, the proposed method is applied to the detection of differential expression (DE) to show its usefulness in the downstream analysis. Conclusions: The proposed NLDMseq method provides an approach to accurately estimate gene and isoform expression from RNA-Seq data by modeling the isoform- and exon-specific read sequencing biases. It makes use of a latent variable model to discover the hidden pattern of read sequencing. We have shown that it works well in both simulations and real datasets, and has competitive performance compared to popular methods. The method has been implemented as a freely available software which can be found at https://github.com/PUGEA/NLDMseq.",
            "authors": [
                "Liu X.",
                "Shi X.",
                "Chen C.",
                "Zhang L."
            ],
            "cit_count": 5,
            "journal": "BMC Bioinformatics",
            "pmid": "26475308",
            "title": "Improving RNA-Seq expression estimation by modeling isoform- and exon-specific read sequencing rate",
            "year": "2015-10-16"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:nldmseq",
        "biotoolsID": "nldmseq",
        "description": "Bioinformatics tool for expression calculation at both gene and isoform levels from RNA-seq data by considering isoform- and exon-specific read sequencing rate.",
        "homepage": "https://github.com/PUGEA/NLDMseq",
        "name": "NLDMseq"
    }
}