
{
    "credit": [
        {
            "name": "Department of biostatistics USC",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://keck.usc.edu/preventive-medicine/contact-us/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://biostats.usc.edu/cgi-bin/DownloadGxEscan.pl"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Prediction and recognition",
                    "uri": "http://edamontology.org/operation_2423"
                }
            ]
        }
    ],
    "labels": {
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            },
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "GWAS study",
                "uri": "http://edamontology.org/topic_3517"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/gxescan-0-2-0-detect-gxe-interactions-in-a-genome-wide-association-study.html"
        }
    ],
    "publication": [
        {
            "abstract": "In a genome-wide association study (GWAS), investigators typically focus their primary analysis on the direct (marginal) associations of each single nucleotide polymorphism (SNP) with the trait. Some SNPs that are truly associated with the trait may not be identified in this scan if they have a weak marginal effect and thus low power to be detected. However, these SNPs may be quite important in subgroups of the population defined by an environmental or personal factor, and may be detectable if such a factor is carefully considered in a gene-environment (G × E) interaction analysis. We address the question \"Using a genome wide interaction scan (GWIS), can we find new genes that were not found in the primary GWAS scan?\" We review commonly used approaches for conducting a GWIS in case-control studies, and propose a new two-step screening and testing method (EDG×E) that is optimized to find genes with a weak marginal effect. We simulate several scenarios in which our two-step method provides 70-80% power to detect a disease locus while a marginal scan provides less than 5% power. We also provide simulations demonstrating that the EDG×E method outperforms other GWIS approaches (including case only and previously proposed two-step methods) for finding genes with a weak marginal effect. Application of this method to a G × Sex scan for childhood asthma reveals two potentially interesting SNPs that were not identified in the marginal-association scan. We distribute a new software program (G×Escan, available at http://biostats.usc.edu/software) that implements this new method as well as several other GWIS approaches. © 2013 WILEY PERIODICALS, INC.",
            "authors": [
                "Gauderman W.J.",
                "Zhang P.",
                "Morrison J.L.",
                "Lewinger J.P."
            ],
            "cit_count": 53,
            "journal": "Genetic Epidemiology",
            "pmid": "23873611",
            "title": "Finding novel genes by testing G × E interactions in a genome-wide association study",
            "year": "2013-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:gxescan",
        "biotoolsID": "gxescan",
        "description": "Detects GxE Interactions in a Genome-wide Association Study",
        "homepage": "http://biostats.usc.edu/software",
        "name": "GxEscan"
    }
}