{"credit":[{"email":"srimicro2002@gmail.com","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://bioserver1.physics.iisc.ernet.in/cgi-bin/psrna/PsRNA-documentation.pdf"},{"url":"http://bioserver1.physics.iisc.ernet.in/cgi-bin/psrna/PsRNA-instruction.pdf"}],"function":[{"operation":[{"term":"Nucleic acid feature detection","uri":"http://edamontology.org/operation_0415"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Functional, regulatory and non-coding RNA","uri":"http://edamontology.org/topic_0659"},{"term":"RNA","uri":"http://edamontology.org/topic_0099"},{"term":"Sequence analysis","uri":"http://edamontology.org/topic_0080"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/psrna-identification-of-putative-small-rna-locations-within-the-intergenic-regions.html"}],"publication":[{"abstract":"Small RNAs (sRNAs) are non-coding transcripts exerting their functions in the cells directly. Identification of sRNAs is a difficult task due to the lack of clear sequence and structural biases. Most sRNAs are identified within genus specific intergenic regions in related genomes. However, several of these regions remain un-annotated due to lack of sequence homology and/or potent statistical identification tools. A computational engine has been built to search within the intergenic regions to identify and roughly annotate new putative sRNA regions in Enterobacteriaceae genomes. It utilizes experimentally known sRNA data and their flanking genes/KEGG Orthology (KO) numbers as templates to identify similar sRNA regions in related query genomes. The search engine not only has the capability to locate putative intergenic regions for specific sRNAs, but also has the potency to locate conserved, shuffled or deleted gene clusters in query genomes. Because it uses the KO terms for locating functionally important regions such as sRNAs, any further KO number assignment to additional genes will increase the sensitivity. The PsRNA server is used for the identification of putative sRNA regions through the information retrieved from the sRNA of interest. The computing engine is available online at http://bioserver1.physics.iisc.ernet.in/psrna/ and http://bicmku.in:8081/psrna/. © 2010 Beijing Genomics Institute.","authors":["Sridhar J.","Sowmiya G.","Sekar K.","Rafi Z.A."],"cit_count":4,"journal":"Genomics, Proteomics and Bioinformatics","pmid":"20691398","title":"PsRNA: A computing engine for the comparative identification of putative small RNA locations within intergenic regions","year":"2010-01-01"}],"summary":{"biotoolsCURIE":"biotools:psrna","biotoolsID":"psrna","description":"Identify putative sRNA regions through the information retrieved from the sRNA of interest.","homepage":"http://bioserver1.physics.iisc.ernet.in/psrna/","name":"PsRNA"}}