{"credit":[{"email":"ofiehn@ucdavis.edu","name":"Oliver Fiehn","typeEntity":"Person","typeRoles":["Primary contact"]}],"function":[{"operation":[{"term":"Service invocation","uri":"http://edamontology.org/operation_3763"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows","Mac"],"toolType":["Command-line tool"],"topic":[{"term":"Cheminformatics","uri":"http://edamontology.org/topic_2258"},{"term":"Metabolomics","uri":"http://edamontology.org/topic_3172"}]},"publication":[{"abstract":"© 2017 The Author(s).In mass spectrometry-based untargeted metabolomics, rarely more than 30% of the compounds are identified. Without the true identity of these molecules it is impossible to draw conclusions about the biological mechanisms, pathway relationships and provenance of compounds. The only way at present to address this discrepancy is to use in silico fragmentation software to identify unknown compounds by comparing and ranking theoretical MS/MS fragmentations from target structures to experimental tandem mass spectra (MS/MS). We compared the performance of four publicly available in silico fragmentation algorithms (MetFragCL, CFM-ID, MAGMa+ and MS-FINDER) that participated in the 2016 CASMI challenge. We found that optimizing the use of metadata, weighting factors and the manner of combining different tools eventually defined the ultimate outcomes of each method. We comprehensively analysed how outcomes of different tools could be combined and reached a final success rate of 93% for the training data, and 87% for the challenge data, using a combination of MAGMa+, CFM-ID and compound importance information along with MS/MS matching. Matching MS/MS spectra against the MS/MS libraries without using any in silico tool yielded 60% correct hits, showing that the use of in silico methods is still important.","authors":["Blazenovic I.","Kind T.","Torbasinovic H.","Obrenovic S.","Mehta S.S.","Tsugawa H.","Wermuth T.","Schauer N.","Jahn M.","Biedendieck R.","Jahn D.","Fiehn O."],"cit_count":19,"doi":"10.1186/s13321-017-0219-x","journal":"Journal of Cheminformatics","title":"Comprehensive comparison of in silico MS/MS fragmentation tools of the CASMI contest: Database boosting is needed to achieve 93% accuracy","year":"2017-05-25"}],"summary":{"biotoolsCURIE":"biotools:insilico_fragmentation","biotoolsID":"insilico_fragmentation","description":"Comparative analysis of open source in silico fragmentation tools.","homepage":"https://sourceforge.net/projects/insilico-fragmentation/","name":"In silico fragmentation evaluation"}}