{
    "accessibility": [
        "Open access"
    ],
    "additionDate": "2016-10-02T22:18:58Z",
    "biotoolsCURIE": "biotools:mixomics",
    "biotoolsID": "mixomics",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "unimelb.edu.au",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "mixomics@math.univ-toulouse.fr",
            "name": "Australia",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The tool offers a wide range of multivariate methods for the exploration and integration of biological datasets with a particular focus on variable selection.",
    "documentation": [
        {
            "type": "General",
            "url": "https://qfab.org/biostatistics/mixOmics"
        },
        {
            "type": "User manual",
            "url": "https://cran.r-project.org/web/packages/mixOmics/mixOmics.pdf"
        }
    ],
    "download": [
        {
            "type": "Binaries",
            "url": "https://cran.r-project.org/web/packages/mixOmics/"
        }
    ],
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "http://mixomics.org/",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:59:00Z",
    "license": "GPL-3.0",
    "maturity": "Mature",
    "name": "mixomics",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mv.schneider@unimelb.edu.au",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btp515",
            "metadata": {
                "abstract": "Motivation: With the availability of many 'omics' data, such as transcriptomics, proteomics or metabolomics, the integrative or joint analysis of multiple datasets from different technology platforms is becoming crucial to unravel the relationships between different biological functional levels. However, the development of such an analysis is a major computational and technical challenge as most approaches suffer from high data dimensionality. New methodologies need to be developed and validated. Results: integrOmics efficiently performs integrative analyses of two types of 'omics' variables that are measured on the same samples. It includes a regularized version of canonical correlation analysis to enlighten correlations between two datasets, and a sparse version of partial least squares (PLS) regression that includes simultaneous variable selection in both datasets. The usefulness of both approaches has been demonstrated previously and successfully applied in various integrative studies. © The Author(s) 2009. Published by Oxford University Press.",
                "authors": [
                    {
                        "name": "Le Cao K.-A."
                    },
                    {
                        "name": "Gonzalez I."
                    },
                    {
                        "name": "Dejean S."
                    }
                ],
                "citationCount": 195,
                "date": "2009-01-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "IntegrOmics: An R package to unravel relationships between two omics datasets"
            },
            "type": "Primary"
        },
        {
            "doi": "10.1371/journal.pcbi.1005752",
            "metadata": {
                "abstract": "© 2017 Rohart et al. The advent of high throughput technologies has led to a wealth of publicly available ‘omics data coming from different sources, such as transcriptomics, proteomics, metabolomics. Combining such large-scale biological data sets can lead to the discovery of important biological insights, provided that relevant information can be extracted in a holistic manner. Current statistical approaches have been focusing on identifying small subsets of molecules (a ‘molecular signature’) to explain or predict biological conditions, but mainly for a single type of ‘omics. In addition, commonly used methods are univariate and consider each biological feature independently. We introduce mixOmics, an R package dedicated to the multivariate analysis of biological data sets with a specific focus on data exploration, dimension reduction and visualisation. By adopting a systems biology approach, the toolkit provides a wide range of methods that statistically integrate several data sets at once to probe relationships between heterogeneous ‘omics data sets. Our recent methods extend Projection to Latent Structure (PLS) models for discriminant analysis, for data integration across multiple ‘omics data or across independent studies, and for the identification of molecular signatures. We illustrate our latest mixOmics integrative frameworks for the multivariate analyses of ‘omics data available from the package.",
                "authors": [
                    {
                        "name": "Rohart F."
                    },
                    {
                        "name": "Gautier B."
                    },
                    {
                        "name": "Singh A."
                    },
                    {
                        "name": "Le Cao K.-A."
                    }
                ],
                "citationCount": 77,
                "date": "2017-11-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "mixOmics: An R package for ‘omics feature selection and multiple data integration"
            }
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}