{
    "additionDate": "2021-01-18T07:36:28Z",
    "biotoolsCURIE": "biotools:amlvaran",
    "biotoolsID": "amlvaran",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "c.wuensch@uni-muenster.de",
            "name": "Christian Wünsch",
            "orcidid": "https://orcid.org/0000-0003-4367-3857",
            "typeEntity": "Person"
        }
    ],
    "description": "AMLVaran, the AML Variant Analyzer is a web-based software platform for variant analysis on targeted NGS data, addressing the requirements of a clinical setting.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Variant calling",
                    "uri": "http://edamontology.org/operation_3227"
                },
                {
                    "term": "Variant filtering",
                    "uri": "http://edamontology.org/operation_3675"
                },
                {
                    "term": "Variant classification",
                    "uri": "http://edamontology.org/operation_3225"
                }
            ]
        }
    ],
    "homepage": "https://amlvaran.uni-muenster.de",
    "language": [
        "JavaScript",
        "PHP"
    ],
    "lastUpdate": "2021-01-23T15:05:14Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/cwuensch/AMLVaran"
        }
    ],
    "name": "AMLVaran",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12920-020-0668-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: Next-Generation Sequencing (NGS) enables large-scale and cost-effective sequencing of genetic samples in order to detect genetic variants. After successful use in research-oriented projects, NGS is now entering clinical practice. Consequently, variant analysis is increasingly important to facilitate a better understanding of disease entities and prognoses. Furthermore, variant calling allows to adapt and optimize specific treatments of individual patients, and thus is an integral part of personalized medicine.However, the analysis of NGS data typically requires a number of complex bioinformatics processing steps. A flexible and reliable software that combines the variant analysis process with a simple, user-friendly interface is therefore highly desirable, but still lacking. Results: With AMLVaran (AML Variant Analyzer), we present a web-based software, that covers the complete variant analysis workflow of targeted NGS samples. The software provides a generic pipeline that allows free choice of variant calling tools and a flexible language (SSDL) for filtering variant lists. AMLVaran's interactive website presents comprehensive annotation data and includes curated information on relevant hotspot regions and driver mutations. A concise clinical report with rule-based diagnostic recommendations is generated.An AMLVaran configuration with eight variant calling tools and a complex scoring scheme, based on the somatic variant calling pipeline appreci8, was used to analyze three datasets from AML and MDS studies with 402 samples in total. Maximum sensitivity and positive predictive values were 1.0 and 0.96, respectively. The tool's usability was found to be satisfactory by medical professionals. Conclusion: Coverage analysis, reproducible variant filtering and software usability are important for clinical assessment of variants. AMLVaran performs reliable NGS variant analyses and generates reports fulfilling the requirements of a clinical setting. Due to its generic design, the software can easily be adapted for use with different targeted panels for other tumor entities, or even for whole-exome data. AMLVaran has been deployed to a public web server and is distributed with Docker scripts for local use.",
                "authors": [
                    {
                        "name": "Wunsch C."
                    },
                    {
                        "name": "Banck H."
                    },
                    {
                        "name": "Muller-Tidow C."
                    },
                    {
                        "name": "Dugas M."
                    }
                ],
                "date": "2020-02-04T00:00:00Z",
                "journal": "BMC Medical Genomics",
                "title": "AMLVaran: A software approach to implement variant analysis of targeted NGS sequencing data in an oncological care setting"
            },
            "pmcid": "PMC7001226",
            "pmid": "32019565"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        }
    ],
    "validated": 1
}