{
    "accessibility": "Open access",
    "additionDate": "2022-09-06T21:30:08.151529Z",
    "biotoolsCURIE": "biotools:meshclust",
    "biotoolsID": "meshclust",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "hani.girgis@tamuk.edu",
            "name": "Hani Z. Girgis",
            "typeEntity": "Person"
        }
    ],
    "description": "High-quality clustering of DNA sequences using the mean shift algorithm and alignment-free identity scores.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Clustering",
                    "uri": "http://edamontology.org/operation_3432"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "k-mer counting",
                    "uri": "http://edamontology.org/operation_3472"
                }
            ]
        }
    ],
    "homepage": "https://github.com/BioinformaticsToolsmith/MeShClust2",
    "language": [
        "C++"
    ],
    "lastUpdate": "2024-11-24T15:41:16.225624Z",
    "license": "GPL-3.0",
    "name": "MeShClust",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1186/s12864-022-08619-0",
            "metadata": {
                "abstract": "Background: Tools for accurately clustering biological sequences are among the most important tools in computational biology. Two pioneering tools for clustering sequences are CD-HIT and UCLUST, both of which are fast and consume reasonable amounts of memory; however, there is a big room for improvement in terms of cluster quality. Motivated by this opportunity for improving cluster quality, we applied the mean shift algorithm in MeShClust v1.0. The mean shift algorithm is an instance of unsupervised learning. Its strong theoretical foundation guarantees the convergence to the true cluster centers. Our implementation of the mean shift algorithm in MeShClust v1.0 was a step forward. In this work, we scale up the algorithm by adapting an out-of-core strategy while utilizing alignment-free identity scores in a new tool: MeShClust v3.0. Results: We evaluated CD-HIT, MeShClust v1.0, MeShClust v3.0, and UCLUST on 22 synthetic sets and five real sets. These data sets were designed or selected for testing the tools in terms of scalability and different similarity levels among sequences comprising clusters. On the synthetic data sets, MeShClust v3.0 outperformed the related tools on all sets in terms of cluster quality. On two real data sets obtained from human microbiome and maize transposons, MeShClust v3.0 outperformed the related tools by wide margins, achieving 55%–300% improvement in cluster quality. On another set that includes degenerate viral sequences, MeShClust v3.0 came third. On two bacterial sets, MeShClust v3.0 was the only applicable tool because of the long sequences in these sets. MeShClust v3.0 requires more time and memory than the related tools; almost all personal computers at the time of this writing can accommodate such requirements. MeShClust v3.0 can estimate an important parameter that controls cluster membership with high accuracy. Conclusions: These results demonstrate the high quality of clusters produced by MeShClust v3.0 and its ability to apply the mean shift algorithm to large data sets and long sequences. Because clustering tools are utilized in many studies, providing high-quality clusters will help with deriving accurate biological knowledge.",
                "authors": [
                    {
                        "name": "Girgis H.Z."
                    }
                ],
                "citationCount": 10,
                "date": "2022-12-01T00:00:00Z",
                "journal": "BMC Genomics",
                "title": "MeShClust v3.0: high-quality clustering of DNA sequences using the mean shift algorithm and alignment-free identity scores"
            },
            "pmcid": "PMC9171953",
            "pmid": "35668366"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Mobile genetic elements",
            "uri": "http://edamontology.org/topic_0798"
        },
        {
            "term": "Sequence assembly",
            "uri": "http://edamontology.org/topic_0196"
        }
    ],
    "validated": 1,
    "version": [
        "3.0"
    ]
}
