{
    "additionDate": "2020-01-09T18:00:17Z",
    "biotoolsCURIE": "biotools:DeepCINAC",
    "biotoolsID": "DeepCINAC",
    "confidence_flag": "tool",
    "description": "A deep-learning-based Python toolbox for inferring calcium imaging neuronal activity based on movie visualization.\n\nAbstract Two-photon calcium imaging is now widely used to indirectly infer multi neuronal dynamics from changes in fluorescence of an indicator. However, state of the art computational tools are not optimized for the analysis of highly active neurons in densely packed regions such as the CA1 pyramidal layer of the hippocampus during early postnatal stages of development. Indeed, the reliable inference of single cell activity is not achieved by the latest analytical tools that often lack proper benchmark measurements. To meet this challenge, we first developed a graphical user interface allowing for a precise manual detection of all calcium transients from detected neurons based on the visualization of the calcium imaging movie. Then, we analyzed our movies using a convolutional neural network with an attention process and a bidirectional long-short term memory network",
    "documentation": [
        {
            "type": [
                "Installation instructions"
            ],
            "url": "https://deepcinac.readthedocs.io/en/latest/install.html"
        },
        {
            "type": [
                "User manual"
            ],
            "url": "https://deepcinac.readthedocs.io/en/latest/index.html"
        },
        {
            "type": [
                "General"
            ],
            "url": "https://deepcinac.readthedocs.io/en/latest/tutorial_gui.html"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                },
                {
                    "term": "Neurite measurement",
                    "uri": "http://edamontology.org/operation_3450"
                }
            ]
        }
    ],
    "homepage": "https://gitlab.com/cossartlab/deepcinac",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-17T15:42:55Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://gitlab.com/cossartlab/deepcinac/issues"
        }
    ],
    "name": "DeepCINAC",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/803726"
        },
        {
            "doi": "10.1523/ENEURO.0038-20.2020",
            "metadata": {
                "abstract": "© 2020 Denis et al.Two-photon calcium imaging is now widely used to infer neuronal dynamics from changes in fluorescence of an indicator. However, state-of-the-art computational tools are not optimized for the reliable detection of fluorescence transients from highly synchronous neurons located in densely packed regions such as the CA1 pyramidal layer of the hippocampus during early postnatal stages of development. Indeed, the latest analytical tools often lack proper benchmark measurements. To meet this challenge, we first developed a graphical user interface (GUI) allowing for a precise manual detection of all calcium transients from imaged neurons based on the visualization of the calcium imaging movie. Then, we analyzed movies from mouse pups using a convolutional neural network (CNN) with an attention process and a bidirectional long-short term memory (LSTM) network. This method is able to reach human performance and offers a better F1 score (harmonic mean of sensitivity and precision) than CaImAn to infer neural activity in the developing CA1 without any user intervention. It also enables automatically identifying activity originating from GABAergic neurons. Overall, DeepCINAC offers a simple, fast and flexible open-source toolbox for processing a wide variety of calcium imaging datasets while providing the tools to evaluate its performance.",
                "authors": [
                    {
                        "name": "Denis J."
                    },
                    {
                        "name": "Dard R.F."
                    },
                    {
                        "name": "Quiroli E."
                    },
                    {
                        "name": "Cossart R."
                    },
                    {
                        "name": "Picardo M.A."
                    }
                ],
                "date": "2020-07-01T00:00:00Z",
                "journal": "eNeuro",
                "title": "Deepcinac: A deep-learning-based python toolbox for inferring calcium imaging neuronal activity based on movie visualization"
            },
            "pmcid": "PMC7438055",
            "pmid": "32699072"
        }
    ],
    "toolType": [
        "Desktop application",
        "Workflow"
    ],
    "topic": [
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        }
    ],
    "validated": 1
}