{
    "name": "MMB", 
    "description": "Previously known as RNABuilder. The latter is available up to revision 2.2. We renamed the software since even some longtime users were unaware that the package now handles protein as well as RNA. Aside from the renaming, MMB 2.3 differs from RNABuilder 2.2 in two important ways. Release 2.3 has fully overhauled guts. It uses the BiopolymerClassContainer, a much cleaner programming construct which will make future upgrades and extensions more efficient.", 
    "homepage": "https://simtk.org/home/rnatoolbox", 
    "biotoolsID": "mmb", 
    "biotoolsCURIE": "biotools:mmb", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_2439", 
                    "term": "RNA secondary structure analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_2275", 
            "term": "Molecular modelling"
        }, 
        {
            "uri": "http://edamontology.org/topic_0099", 
            "term": "RNA"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "C++"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/mmb-2-4-model-structure-dynamics-macromolecules.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://simtk.org/projects/rnatoolbox", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "21121048", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "Structural insights into pre-translocation ribosome motions", 
                "abstract": "Subsequent to the peptidyl transfer step of the translation elongation cycle, the initially formed pre-translocation ribosome, which we refer to here as R1, undergoes a ratchet-like intersubunit rotation in order to sample a rotated conformation, referred to here as RF, that is an obligatory intermediate in the translocation of tRNAs and mRNA through the ribosome during the translocation step of the translation elongation cycle. RF and the R1 to RF transition are currently the subject of intense research, driven in part by the potential for developing novel antibiotics which trap RF or confound the R1 to RF transition. Currently lacking a 3D atomic structure of the R F endpoint of the transition, as well as a preliminary conformational trajectory connecting R1 and RF, the dynamics of the mechanistically crucial R1 to RF transition remain elusive. The current literature reports fitting of only a few ribosomal RNA (rRNA) and ribosomal protein (r-protein) components into cryogenic electron microscopy (cryo-EM) reconstructions of the Escherichia coli ribosome in RF. In this work we now fit the entire Thermus thermophilus 16S and 23S rRNAs and most of the remaining T. thermophilus r-proteins into a cryo-EM reconstruction of the E. coli ribosome in RF in order to build an almost complete model of the T. thermophilus ribosome in RF thus allowing a more detailed view of this crucial conformation. The resulting model validates key predictions from the published literature; in particular it recovers intersubunit bridges known to be maintained throughout the R1 to RF transition and results in new intersubunit bridges that are predicted to exist only in RF. In addition, we use a recently reported E. coli ribosome structure, apparently trapped in an intermediate state along the R1 to RF transition pathway, referred to here as R2, as a guide to generate a T. thermophilus ribosome in the R2 state. This demonstrates a multiresolution method for morphing large complexes and provides us with a structural model of R2 in the species of interest. The generated structural models form the basis for probing the motion of the deacylated tRNA bound at the peptidyl-tRNA binding site (P site) of the pre-translocation ribosome as it moves from its so-called classical P/P configuration to its so-called hybrid P/E configuration as part of the R 1 to RF transition. We create a dynamic model of this process which provides structural insights into the functional significance of R2 as well as detailed atomic information to guide the design of further experiments. The results suggest extensibility to other steps of protein synthesis as well as to spatially larger systems. © 2011 World Scientific Publishing Co. Pte. Ltd.", 
                "date": "2011-12-01T00:00:00Z", 
                "citationCount": 5, 
                "authors": [
                    {
                        "name": "Flores S.C."
                    }, 
                    {
                        "name": "Altman R."
                    }
                ], 
                "journal": "Pacific Symposium on Biocomputing 2011, PSB 2011"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "https://simtk.org/project/xml/downloads.xml?group_id=359", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T18:49:47Z", 
    "lastUpdate": "2018-12-10T12:58:52Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}