{
    "additionDate": "2019-11-14T18:23:27Z",
    "biotoolsCURIE": "biotools:AluMine",
    "biotoolsID": "AluMine",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "maido.remm@ut.ee",
            "name": "Maido Remm",
            "orcidid": "https://orcid.org/0000-0003-3966-8422",
            "typeEntity": "Person",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'Conclusions:AluMine' | alignment-free method for the discovery of polymorphic Alu element insertions | Scripts for discovery and genotyping polymorphic Alu element insertions in human genomes | git clone https://github.com/bioinfo-ut/AluMine | This GitHub repository stores various scripts required to discover and genotype polymorphic Alu element insertions. There are four different workflows: REF-plus discovery, REF-minus discovery, merging and filtering workflow and genotyping workflow. REF-plus and REF-minus workflows generate text file containing 32-mer pairs that can be subsequently used for genotyping using FastGT package. The scripts are written in PERL and bash | Please cite: Puurand T, Kukuškina V, Pajuste F-D, Remm M. (2019). AluMine: alignment-free method for the discovery of polymorphic Alu element insertions. Mobile DNA 10:31. [https://doi.org/10.1186/s13100-019-0174-3](doi: https://doi.org/10.1186/s13100-019-0174-3)",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bioinfo-ut/AluMine",
    "language": [
        "Perl",
        "Shell"
    ],
    "lastUpdate": "2024-09-11T12:36:37.954974Z",
    "license": "GPL-3.0",
    "name": "AluMine",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S13100-019-0174-3",
            "metadata": {
                "abstract": "Background: Recently, alignment-free sequence analysis methods have gained popularity in the field of personal genomics. These methods are based on counting frequencies of short k-mer sequences, thus allowing faster and more robust analysis compared to traditional alignment-based methods. Results: We have created a fast alignment-free method, AluMine, to analyze polymorphic insertions of Alu elements in the human genome. We tested the method on 2,241 individuals from the Estonian Genome Project and identified 28,962 potential polymorphic Alu element insertions. Each tested individual had on average 1,574 Alu element insertions that were different from those in the reference genome. In addition, we propose an alignment-free genotyping method that uses the frequency of insertion/deletion-specific 32-mer pairs to call the genotype directly from raw sequencing reads. Using this method, the concordance between the predicted and experimentally observed genotypes was 98.7%. The running time of the discovery pipeline is approximately 2 h per individual. The genotyping of potential polymorphic insertions takes between 0.4 and 4 h per individual, depending on the hardware configuration. Conclusions: AluMine provides tools that allow discovery of novel Alu element insertions and/or genotyping of known Alu element insertions from personal genomes within few hours.",
                "authors": [
                    {
                        "name": "Kukuskina V."
                    },
                    {
                        "name": "Pajuste F.-D."
                    },
                    {
                        "name": "Puurand T."
                    },
                    {
                        "name": "Remm M."
                    }
                ],
                "citationCount": 8,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Mobile DNA",
                "title": "AluMine: alignment-free method for the discovery of polymorphic Alu element insertions"
            },
            "pmcid": "PMC6639938",
            "pmid": "31360240"
        }
    ],
    "topic": [
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Whole genome sequencing",
            "uri": "http://edamontology.org/topic_3673"
        }
    ],
    "validated": 1
}
