
{
    "credit": [
        {
            "email": "jialu.hu@fu-berlin.de",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "https://github.com/screamer"
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/screamer/netcoffee/blob/master/README"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Global alignment",
                    "uri": "http://edamontology.org/operation_0496"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++"
        ],
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Protein interactions",
                "uri": "http://edamontology.org/topic_0128"
            },
            {
                "term": "Molecular interactions, pathways and networks",
                "uri": "http://edamontology.org/topic_0602"
            }
        ]
    },
    "link": [
        {
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/netcoffee-alignment-approach-to-identify-functionally-conserved-proteins-in-multiple-networks.html"
        }
    ],
    "publication": [
        {
            "abstract": "Motivation: Owing to recent advancements in high-throughput technologies, protein-protein interaction networks of more and more species become available in public databases. The question of how to identify functionally conserved proteins across species attracts a lot of attention in computational biology. Network alignments provide a systematic way to solve this problem. However, most existing alignment tools encounter limitations in tackling this problem. Therefore, the demand for faster and more efficient alignment tools is growing.Results: We present a fast and accurate algorithm, NetCoffee, which allows to find a global alignment of multiple protein-protein interaction networks. NetCoffee searches for a global alignment by maximizing a target function using simulated annealing on a set of weighted bipartite graphs that are constructed using a triplet approach similar to T-Coffee. To assess its performance, NetCoffee was applied to four real datasets. Our results suggest that NetCoffee remedies several limitations of previous algorithms, outperforms all existing alignment tools in terms of speed and nevertheless identifies biologically meaningful alignments.Availability: The source code and data are freely available for download under the GNU GPL v3 license at https://code.google.com/p/netcoffee/.Contact: Supplementary information: Supplementary data are available at Bioinformatics online. © 2013 The Author.",
            "authors": [
                "Hu J.",
                "Kehr B.",
                "Reinert K."
            ],
            "cit_count": 27,
            "journal": "Bioinformatics",
            "pmid": "24336806",
            "title": "NetCoffee: A fast and accurate global alignment approach to identify functionally conserved proteins in multiple networks",
            "year": "2014-02-15"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:netcoffee",
        "biotoolsID": "netcoffee",
        "description": "Fast and accurate algorithm which allows to find a global alignment of multiple protein-protein interaction networks.",
        "homepage": "https://github.com/screamer/netcoffee",
        "name": "NetCoffee"
    }
}