{
    "additionDate": "2021-01-18T09:54:42Z",
    "biotoolsCURIE": "biotools:clustermine",
    "biotoolsID": "clustermine",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Jianxin Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "A knowledge-integrated clustering approach based on expression profiles of gene sets.\n\nClusterMine is a knowledge-integrated clustering approach to cluster samples based on gene expression profile. Two inputs are required to run ClusterMine: (1) a list of gene sets, (2) gene expression data matrix with genes in rows and samples in columns (row names are RefSeq gene symbols). ClusterMine (1) uses piror gene sets that often contain a set of functionally related genes to partition gene expression data into gene-set-wise subdata, (2) perform clustering analysis for each subdata, and (3) combine the clustering results of all subdata into a final clustering as the output.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Functional clustering",
                    "uri": "http://edamontology.org/operation_3459"
                }
            ]
        }
    ],
    "homepage": "http://www.genemine.org/clustermine.php",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-12T16:18:12Z",
    "name": "ClusterMine",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1142/S0219720020400090",
            "metadata": {
                "abstract": "© 2020 World Scientific Publishing Europe Ltd.Clustering analysis of gene expression data is essential for understanding complex biological data, and is widely used in important biological applications such as the identification of cell subpopulations and disease subtypes. In commonly used methods such as hierarchical clustering (HC) and consensus clustering (CC), holistic expression profiles of all genes are often used to assess the similarity between samples for clustering. While these methods have been proven successful in identifying sample clusters in many areas, they do not provide information about which gene sets (functions) contribute most to the clustering, thus limiting the interpretability of the resulting cluster. We hypothesize that integrating prior knowledge of annotated gene sets would not only achieve satisfactory clustering performance but also, more importantly, enable potential biological interpretation of clusters. Here we report ClusterMine, an approach that identifies clusters by assessing functional similarity between samples through integrating known annotated gene sets in functional annotation databases such as Gene Ontology. In addition to the cluster membership of each sample as provided by conventional approaches, it also outputs gene sets that most likely contribute to the clustering, thus facilitating biological interpretation. We compare ClusterMine with conventional approaches on nine real-world experimental datasets that represent different application scenarios in biology. We find that ClusterMine achieves better performances and that the gene sets prioritized by our method are biologically meaningful. ClusterMine is implemented as an R package and is freely available at: www.genemine.org/clustermine.php",
                "authors": [
                    {
                        "name": "Li H.-D."
                    },
                    {
                        "name": "Xu Y."
                    },
                    {
                        "name": "Zhu X."
                    },
                    {
                        "name": "Liu Q."
                    },
                    {
                        "name": "Omenn G.S."
                    },
                    {
                        "name": "Wang J."
                    }
                ],
                "citationCount": 1,
                "date": "2020-06-01T00:00:00Z",
                "journal": "Journal of Bioinformatics and Computational Biology",
                "title": "ClusterMine: A knowledge-integrated clustering approach based on expression profiles of gene sets"
            },
            "pmid": "32698720"
        }
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}