{"credit":[{"email":"fgomez@upo.es","typeEntity":"Person","typeRoles":["Primary contact"]},{"email":"ndiaz@upo.es","typeEntity":"Person","typeRoles":["Primary contact"]}],"documentation":[{"type":"GENERAL","url":"http://fgomezvela.github.io/GeneNetVal/"}],"function":[{"operation":[{"term":"Pathway or network analysis","uri":"http://edamontology.org/operation_2497"}]}],"labels":{"language":["Java"],"operatingSystem":["Linux","Windows"],"toolType":["Command-line tool"],"topic":[{"term":"Systems biology","uri":"http://edamontology.org/topic_2259"},{"term":"Molecular interactions, pathways and networks","uri":"http://edamontology.org/topic_0602"},{"term":"Nucleic acids","uri":"http://edamontology.org/topic_0077"},{"term":"Genetics","uri":"http://edamontology.org/topic_3053"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/genenetval-gene-network-biological-validity-based-on-gene-gene-interaction-relevance.html"}],"publication":[{"abstract":"© 2014 Francisco Gómez-Vela and Norberto Díaz-Díaz.In recent years, gene networks have become one of the most useful tools for modeling biological processes. Many inference gene network algorithms have been developed as techniques for extracting knowledge from gene expression data. Ensuring the reliability of the inferred gene relationships is a crucial task in any study in order to prove that the algorithms used are precise. Usually, this validation process can be carried out using prior biological knowledge. The metabolic pathways stored in KEGG are one of the most widely used knowledgeable sources for analyzing relationships between genes. This paper introduces a new methodology, GeneNetVal, to assess the biological validity of gene networks based on the relevance of the gene-gene interactions stored in KEGG metabolic pathways. Hence, a complete KEGG pathway conversion into a gene association network and a new matching distance based on gene-gene interaction relevance are proposed. The performance of GeneNetVal was established with three different experiments. Firstly, our proposal is tested in a comparative ROC analysis. Secondly, a randomness study is presented to show the behavior of GeneNetVal when the noise is increased in the input network. Finally, the ability of GeneNetVal to detect biological functionality of the network is shown.","authors":["Gomez-Vela F.","Diaz-Diaz N."],"cit_count":5,"journal":"Scientific World Journal","pmid":"25295303","title":"Gene Network Biological Validity Based on Gene-Gene Interaction Relevance","year":"2014-01-01"}],"summary":{"biotoolsCURIE":"biotools:genenetval","biotoolsID":"genenetval","description":"Java application for network analysis. The application uses the metabolic pathways stored in kegg to rate the validity of an input network.","homepage":"http://fgomezvela.github.io/GeneNetVal/","name":"GeneNetVal"}}