{
    "additionDate": "2020-12-17T14:39:32Z",
    "biotoolsCURIE": "biotools:deca-xhmm",
    "biotoolsID": "deca-xhmm",
    "confidence_flag": "tool",
    "description": "DECA is a distributed re-implementation of the XHMM exome CNV caller using ADAM and Apache Spark.",
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://github.com/bigdatagenomics/deca",
    "language": [
        "Scala",
        "Java"
    ],
    "lastUpdate": "2020-12-17T14:42:41Z",
    "name": "DECA",
    "operatingSystem": [
        "Mac",
        "Linux",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/s12859-019-3108-7",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: XHMM is a widely used tool for copy-number variant (CNV) discovery from whole exome sequencing data but can require hours to days to run for large cohorts. A more scalable implementation would reduce the need for specialized computational resources and enable increased exploration of the configuration parameter space to obtain the best possible results. Results: DECA is a horizontally scalable implementation of the XHMM algorithm using the ADAM framework and Apache Spark that incorporates novel algorithmic optimizations to eliminate unneeded computation. DECA parallelizes XHMM on both multi-core shared memory computers and large shared-nothing Spark clusters. We performed CNV discovery from the read-depth matrix in 2535 exomes in 9.3 min on a 16-core workstation (35.3× speedup vs. XHMM), 12.7 min using 10 executor cores on a Spark cluster (18.8× speedup vs. XHMM), and 9.8 min using 32 executor cores on Amazon AWS' Elastic MapReduce. We performed CNV discovery from the original BAM files in 292 min using 640 executor cores on a Spark cluster. Conclusions: We describe DECA's performance, our algorithmic and implementation enhancements to XHMM to obtain that performance, and our lessons learned porting a complex genome analysis application to ADAM and Spark. ADAM and Apache Spark are a performant and productive platform for implementing large-scale genome analyses, but efficiently utilizing large clusters can require algorithmic optimizations and careful attention to Spark's configuration parameters.",
                "authors": [
                    {
                        "name": "Linderman M.D."
                    },
                    {
                        "name": "Chia D."
                    },
                    {
                        "name": "Wallace F."
                    },
                    {
                        "name": "Nothaft F.A."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-11T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "DECA: Scalable XHMM exome copy-number variant calling with ADAM and Apache Spark"
            },
            "pmcid": "PMC6787990",
            "pmid": "31604420"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        }
    ]
}