{
    "accessibility": "Open access",
    "additionDate": "2025-01-22T09:30:44.090073Z",
    "biotoolsCURIE": "biotools:enzymedetector",
    "biotoolsID": "enzymedetector",
    "cost": "Free of charge",
    "description": "The EnzymeDetector database offers a comparative and integrative approach to find enzymatic annotations. The most comprehensive databases for protein and genome annotation, namely manually annotated data and text mining data from BRENDA, UniProt, KEGG, PATRIC, and NCBI's RefSeq, are integrated to have a vast view on the organism of interest. The data are complemented with self-performed annotation methods, i.e. BLAST vs. all enzyme annotations from Swiss-Prot and BrEPS enzyme pattern recognition.",
    "documentation": [
        {
            "type": [
                "Training material"
            ],
            "url": "https://www.brenda-enzymes.org/information/tutorial_training/BRENDA_Tutorial_EnzymeDetector.pdf"
        }
    ],
    "editPermission": {
        "authors": [
            "juh22",
            "matkrull"
        ],
        "type": "group"
    },
    "elixirNode": [
        "Germany"
    ],
    "elixirPlatform": [
        "Data",
        "Tools"
    ],
    "homepage": "https://ed.brenda-enzymes.org/help.php",
    "lastUpdate": "2025-01-30T16:15:27.318809Z",
    "license": "CC-BY-4.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://www.brenda-enzymes.org/"
        },
        {
            "type": [
                "Service"
            ],
            "url": "https://hub.dsmz.de/#/"
        }
    ],
    "maturity": "Mature",
    "name": "EnzymeDetector",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "lje",
    "publication": [
        {
            "doi": "10.1093/nar/gkaa1025",
            "metadata": {
                "abstract": "The BRENDA enzyme database (https://www.brendaenzymes.org), established in 1987, has evolved into the main collection of functional enzyme and metabolism data. In 2018, BRENDA was selected as an ELIXIR Core Data Resource. BRENDA provides reliable data, continuous curation and updates of classified enzymes, and the integration of newly discovered enzymes. The main part contains >5 million data for ∼90 000 enzymes from ∼13 000 organisms, manually extracted from ∼157 000 primary literature references, combined with information of text and data mining, data integration, and prediction algorithms. Supplements comprise disease-related data, protein sequences, 3D structures, genome annotations, lig- and information, taxonomic, bibliographic, and kinetic data. BRENDA offers an easy access to enzyme information from quick to advanced searches, text- and structured-based queries for enzyme-ligand interactions, word maps, and visualization of enzyme data. The BRENDA Pathway Maps are completely revised and updated for an enhanced interactive and intuitive usability. The new design of the Enzyme Summary Page provides an improved access to each individual enzyme. A new protein structure 3D viewer was integrated. The prediction of the intracellular localization of eukaryotic enzymes has been implemented. The new EnzymeDetector combines BRENDA enzyme annotations with protein and genome databases for the detection of eukaryotic and prokaryotic enzymes.",
                "authors": [
                    {
                        "name": "Chang A."
                    },
                    {
                        "name": "Hofmann J."
                    },
                    {
                        "name": "Jahn D."
                    },
                    {
                        "name": "Jeske L."
                    },
                    {
                        "name": "Koblitz J."
                    },
                    {
                        "name": "Neumann-Schaal M."
                    },
                    {
                        "name": "Schomburg D."
                    },
                    {
                        "name": "Schomburg I."
                    },
                    {
                        "name": "Ulbrich S."
                    }
                ],
                "citationCount": 392,
                "date": "2021-01-08T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "BRENDA, the ELIXIR core data resource in 2021: New developments and updates"
            },
            "pmcid": "PMC7779020",
            "pmid": "33211880",
            "type": [
                "Review"
            ]
        },
        {
            "doi": "10.1186/1471-2105-12-376",
            "metadata": {
                "abstract": "Background: The ability to accurately predict enzymatic functions is an essential prerequisite for the interpretation of cellular functions, and the reconstruction and analysis of metabolic models. Several biological databases exist that provide such information. However, in many cases these databases provide partly different and inconsistent genome annotations.Description: We analysed nine prokaryotic genomes and found about 70% inconsistencies in the enzyme predictions of the main annotation resources. Therefore, we implemented the annotation pipeline EnzymeDetector. This tool automatically compares and evaluates the assigned enzyme functions from the main annotation databases and supplements them with its own function prediction. This is based on a sequence similarity analysis, on manually created organism-specific enzyme information from BRENDA (Braunschweig Enzyme Database), and on sequence pattern searches.Conclusions: EnzymeDetector provides a fast and comprehensive overview of the available enzyme function annotations for a genome of interest. The web interface allows the user to work with customisable weighting schemes and cut-offs for the different prediction methods. These customised quality criteria can easily be applied, and the resulting annotation can be downloaded. The summarised view of all used annotation sources provides up-to-date information. Annotation errors that occur in only one of the databases can be recognised (because of their low relevance score). The results are stored in a database and can be accessed at http://enzymedetector.tu-bs.de. © 2011 Quester and Schomburg; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Quester S."
                    },
                    {
                        "name": "Schomburg D."
                    }
                ],
                "citationCount": 49,
                "date": "2011-09-23T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "EnzymeDetector: An integrated enzyme function prediction tool and database"
            },
            "pmcid": "PMC3224133",
            "pmid": "21943292",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Web service"
    ],
    "topic": [
        {
            "term": "Enzymes",
            "uri": "http://edamontology.org/topic_0821"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ]
}
