{
    "additionDate": "2021-01-18T11:48:01Z",
    "biotoolsCURIE": "biotools:mdipa",
    "biotoolsID": "mdipa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "faw341@mail.usask.ca",
            "name": "Anthony Kusalik",
            "typeEntity": "Person"
        },
        {
            "email": "kusalik@cs.usask.ca",
            "name": "Fang-Xiang Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "A microRNA-drug interaction prediction approach based on non-negative matrix factorization.\n\nA microRNA-drug interaction prediction ap-proach based on nonnegative matrix factoriza-tion Ali Akbar Jamali, Anthony Kusalik, Fang-Xiang Wu.\n\nA microRNA-drug Interaction Prediction Approach.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Molecular docking",
                    "uri": "http://edamontology.org/operation_0478"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                }
            ]
        }
    ],
    "homepage": "https://github.com/AliJam82/MDIPA",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T17:40:45Z",
    "name": "MDIPA",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAA577",
            "metadata": {
                "abstract": "© The Author(s) 2020.Motivation: Evidence has shown that microRNAs, one type of small biomolecule, regulate the expression level of genes and play an important role in the development or treatment of diseases. Drugs, as important chemical compounds, can interact with microRNAs and change their functions. The experimental identification of microRNA-drug interactions is time-consuming and expensive. Therefore, it is appealing to develop effective computational approaches for predicting microRNA-drug interactions. Results: In this study, a matrix factorization-based method, called the microRNA-drug interaction prediction approach (MDIPA), is proposed for predicting unknown interactions among microRNAs and drugs. Specifically, MDIPA utilizes experimentally validated interactions between drugs and microRNAs, drug similarity and microRNA similarity to predict undiscovered interactions. A path-based microRNA similarity matrix is constructed, while the structural information of drugs is used to establish a drug similarity matrix. To evaluate its performance, our MDIPA is compared with four state-of-the-art prediction methods with an independent dataset and cross-validation. The results of both evaluation methods confirm the superior performance of MDIPA over other methods. Finally, the results of molecular docking in a case study with breast cancer confirm the efficacy of our approach. In conclusion, MDIPA can be effective in predicting potential microRNA-drug interactions.",
                "authors": [
                    {
                        "name": "Jamali A.A."
                    },
                    {
                        "name": "Kusalik A."
                    },
                    {
                        "name": "Wu F.-X."
                    }
                ],
                "citationCount": 2,
                "date": "2020-10-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "MDIPA: A microRNA-drug interaction prediction approach based on non-negative matrix factorization"
            },
            "pmid": "33212495"
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Molecular modelling",
            "uri": "http://edamontology.org/topic_2275"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Drug discovery",
            "uri": "http://edamontology.org/topic_3336"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}