{
    "additionDate": "2019-11-14T19:52:36Z",
    "biotoolsCURIE": "biotools:mlrMBO",
    "biotoolsID": "mlrMBO",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jakob.richter@tu-dortmund.de",
            "name": "Jakob Richter",
            "typeEntity": "Person"
        }
    ],
    "description": "Model-based optimization of subgroup weights for survival analysis | Toolbox for Bayesian Optimization and Model-Based Optimization in R | Model-based optimization with mlr | Issues, Requests and Bug Tracker",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "http://github.com/mlr-org/mlrMBO",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2020-12-14T09:36:34Z",
    "name": "mlrMBO",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ361",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press.Motivation: To obtain a reliable prediction model for a specific cancer subgroup or cohort is often difficult due to limited sample size and, in survival analysis, due to potentially high censoring rates. Sometimes similar data from other patient subgroups are available, e.g. from other clinical centers. Simple pooling of all subgroups can decrease the variance of the predicted parameters of the prediction models, but also increase the bias due to heterogeneity between the cohorts. A promising compromise is to identify those subgroups with a similar relationship between covariates and target variable and then include only these for model building. Results: We propose a subgroup-based weighted likelihood approach for survival prediction with high-dimensional genetic covariates. When predicting survival for a specific subgroup, for every other subgroup an individual weight determines the strength with which its observations enter into model building. MBO (model-based optimization) can be used to quickly find a good prediction model in the presence of a large number of hyperparameters. We use MBO to identify the best model for survival prediction of a specific subgroup by optimizing the weights for additional subgroups for a Cox model. The approach is evaluated on a set of lung cancer cohorts with gene expression measurements. The resulting models have competitive prediction quality, and they reflect the similarity of the corresponding cancer subgroups, with both weights close to 0 and close to 1 and medium weights.",
                "authors": [
                    {
                        "name": "Richter J."
                    },
                    {
                        "name": "Madjar K."
                    },
                    {
                        "name": "Rahnenfuhrer J."
                    }
                ],
                "citationCount": 1,
                "date": "2019-07-15T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Model-based optimization of subgroup weights for survival analysis"
            },
            "pmcid": "PMC6612842",
            "pmid": "31510644"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}