{"collectionID": [], "accessibility": [], "topic": [{"term": "Imaging", "uri": "http://edamontology.org/topic_3382"}, {"term": "Molecular genetics", "uri": "http://edamontology.org/topic_3321"}], "owner": "migle_sur", "cost": null, "relation": [], "download": [], "validated": 1, "publication": [{"doi": "10.1186/s12859-017-1966-4", "note": null, "version": null, "pmid": null, "type": "Primary", "pmcid": null, "metadata": {"title": "Automated classification and characterization of the mitotic spindle following knockdown of a mitosis-related protein", "abstract": "© 2017 The Author(s). Background: Cell division (mitosis) results in the equal segregation of chromosomes between two daughter cells. The mitotic spindle plays a pivotal role in chromosome alignment and segregation during metaphase and anaphase. Structural or functional errors of this spindle can cause aneuploidy, a hallmark of many cancers. To investigate if a given protein associates with the mitotic spindle and regulates its assembly, stability, or function, fluorescence microscopy can be performed to determine if disruption of that protein induces phenotypes indicative of spindle dysfunction. Importantly, functional disruption of proteins with specific roles during mitosis can lead to cancer cell death by inducing mitotic insult. However, there is a lack of automated computational tools to detect and quantify the effects of such disruption on spindle integrity. Results: We developed the image analysis software tool MatQuantify, which detects both large-scale and subtle structural changes in the spindle or DNA and can be used to statistically compare the effects of different treatments. MatQuantify can quantify various physical properties extracted from fluorescence microscopy images, such as area, lengths of various components, perimeter, eccentricity, fractal dimension, satellite objects and orientation. It can also measure textual properties including entropy, intensities and the standard deviation of intensities. Using MatQuantify, we studied the effect of knocking down the protein clathrin heavy chain (CHC) on the mitotic spindle. We analysed 217 microscopy images of untreated metaphase cells, 172 images of metaphase cells transfected with small interfering RNAs targeting the luciferase gene (as a negative control), and 230 images of metaphase cells depleted of CHC. Using the quantified data, we trained 23 supervised machine learning classification algorithms. The Support Vector Machine learning algorithm was the most accurate method (accuracy: 85.1%; area under the curve: 0.92) for classifying a spindle image. The Kruskal-Wallis and Tukey-Kramer tests demonstrated that solidity, compactness, eccentricity, extent, mean intensity and number of satellite objects (multipolar spindles) significantly differed between CHC-depleted cells and untreated/luciferase-knockdown cells. Conclusion: MatQuantify enables automated quantitative analysis of images of mitotic spindles. Using this tool, researchers can unambiguously test if disruption of a protein-of-interest changes metaphase spindle maintenance and thereby affects mitosis.", "citationCount": 1, "authors": [{"name": "Khushi M."}, {"name": "Dean I.M."}, {"name": "Teber E.T."}, {"name": "Chircop M."}, {"name": "Arthur J.W."}, {"name": "Flores-Rodriguez N."}], "date": "2017-12-28T00:00:00Z", "journal": "BMC Bioinformatics"}}], "homepage_status": 0, "credit": [{"typeRole": ["Primary contact"], "name": "Matloob Khushi", "url": null, "gridid": null, "note": null, "orcidid": null, "typeEntity": "Person", "email": "mkhushi@uni.sydney.edu.au"}], "biotoolsCURIE": "biotools:matquantify", "elixirPlatform": [], "elixirNode": [], "version": [], "elixir_badge": 0, "homepage": "https://sourceforge.net/projects/matquantify/", "function": [{"note": null, "input": [], "operation": [{"term": "Image analysis", "uri": "http://edamontology.org/operation_3443"}, {"term": "Clustering", "uri": "http://edamontology.org/operation_3432"}], "cmd": null, "output": []}], "lastUpdate": "2018-12-10T12:59:00Z", "otherID": [], "description": "Automated classification and characterization of the mitotic spindle following knockdown of a mitosis-related protein.", "toolType": ["Command-line tool"], "editPermission": {"type": "private", "authors": []}, "language": ["MATLAB"], "link": [], "biotoolsID": "matquantify", "additionDate": "2018-07-21T09:35:27Z", "name": "MatQuantify", "license": null, "documentation": [], "maturity": null, "confidence_flag": null, "operatingSystem": ["Linux", "Windows", "Mac"]}