{
    "additionDate": "2021-06-14T13:01:27Z",
    "biotoolsCURIE": "biotools:blast-qc",
    "biotoolsID": "blast-qc",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "rsnorman@mailbox.sc.edu",
            "name": "R. Sean Norman",
            "orcidid": "https://orcid.org/0000-0003-4766-4376",
            "typeEntity": "Person"
        }
    ],
    "description": "BLAST-QC is a tool for automated analysis of BLAST results.  It is a quality control filter and parser for NCBI BLAST XML results.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Parsing",
                    "uri": "http://edamontology.org/operation_1812"
                },
                {
                    "term": "Local alignment",
                    "uri": "http://edamontology.org/operation_0495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/torkian/blast-QC",
    "language": [
        "C",
        "Java",
        "Python"
    ],
    "lastUpdate": "2021-08-18T08:27:48Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/torkian/blast-QC/issues"
        }
    ],
    "name": "BLAST-QC",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S40793-020-00361-Y",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The Basic Local Alignment Search Tool (BLAST) from NCBI is the preferred utility for sequence alignment and identification for bioinformatics and genomics research. Among researchers using NCBI's BLAST software, it is well known that analyzing the results of a large BLAST search can be tedious and time-consuming. Furthermore, with the recent discussions over the effects of parameters such as '-max_target_seqs' on the BLAST heuristic search process, the use of these search options are questionable. This leaves using a stand-alone parser as one of the only options of condensing these large datasets, and with few available for download online, the task is left to the researcher to create a specialized piece of software anytime they need to analyze BLAST results. The need for a streamlined and fast script that solves these issues and can be easily implemented into a variety of bioinformatics and genomics workflows was the initial motivation for developing this software. Results: In this study, we demonstrate the effectiveness of BLAST-QC for analysis of BLAST results and its desirability over the other available options. Applying genetic sequence data from our bioinformatic workflows, we establish BLAST_QC's superior runtime when compared to existing parsers developed with commonly used BioPerl and BioPython modules, as well as C and Java implementations of the BLAST_QC program. We discuss the 'max_target_seqs' parameter, the usage of and controversy around the use of the parameter, and offer a solution by demonstrating the ability of our software to provide the functionality this parameter was assumed to produce, as well as a variety of other parsing options. Executions of the script on example datasets are given, demonstrating the implemented functionality and providing test-cases of the program. BLAST-QC is designed to be integrated into existing software, and we establish its effectiveness as a module of workflows or other processes. Conclusions: BLAST-QC provides the community with a simple, lightweight and portable Python script that allows for easy quality control of BLAST results while avoiding the drawbacks of other options. This includes the uncertain results of applying the -max_target_seqs parameter or relying on the cumbersome dependencies of other options like BioPerl, Java, etc. which add complexity and run time when running large data sets of sequences. BLAST-QC is ideal for use in high-throughput workflows and pipelines common in bioinformatic and genomic research, and the script has been designed for portability and easy integration into whatever type of processes the user may be running.",
                "authors": [
                    {
                        "name": "Torkian B."
                    },
                    {
                        "name": "Hann S."
                    },
                    {
                        "name": "Preisner E."
                    },
                    {
                        "name": "Norman R.S."
                    }
                ],
                "date": "2020-08-12T00:00:00Z",
                "journal": "Environmental Microbiomes",
                "title": "BLAST-QC: Automated analysis of BLAST results"
            },
            "pmcid": "PMC8066848",
            "pmid": "33902722",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}