{
    "name": "TIKAL", 
    "description": "A 4-D image processing platform for the work with laser scanning and wide field microscopes. It provides a registration software for correcting global movements and local deformations of cells as well as 2-D and 3-D tracking software.", 
    "homepage": "http://ibios.dkfz.de/tbi/index.php/software/further-software/99-tikal", 
    "biotoolsID": "tikal", 
    "biotoolsCURIE": "biotools:tikal", 
    "version": [], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3443", 
                    "term": "Image analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Desktop application"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3382", 
            "term": "Imaging"
        }, 
        {
            "uri": "http://edamontology.org/topic_2229", 
            "term": "Cell biology"
        }, 
        {
            "uri": "http://edamontology.org/topic_3385", 
            "term": "Light microscopy"
        }
    ], 
    "operatingSystem": [
        "Windows"
    ], 
    "language": [
        "C++", 
        "C"
    ], 
    "license": null, 
    "collectionID": [], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [
        {
            "url": "http://www.mybiosoftware.com/tikal-4-d-image-processing-platform.html", 
            "type": "Registry", 
            "note": null
        }
    ], 
    "download": [], 
    "documentation": [
        {
            "url": "https://ibios.dkfz.de/tbi/index.php/software/further-software/99-tikal", 
            "type": "General", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": null, 
            "pmid": "15560848", 
            "pmcid": null, 
            "type": null, 
            "version": null, 
            "metadata": {
                "title": "4-D single particle tracking of synthetic and proteinaceous microspheres reveals preferential movement of nuclear particles along chromatin - Poor tracks", 
                "abstract": "Background. The dynamics of nuclear organization, nuclear bodies and RNPs in particular has been the focus of many studies. To understand their function, knowledge of their spatial nuclear position and temporal translocation is essential. Typically, such studies generate a wealth of data that require novel methods in image analysis and computational tools to quantitatively track particle movement on the background of moving cells and shape changing nuclei. Results. We developed a novel 4-D image processing platform (TIKAL) for the work with laser scanning and wide field microscopes. TIKAL provides a registration software for correcting global movements and local deformations of cells as well as 2-D and 3-D tracking software. With this new tool, we studied the dynamics of two different types of nuclear particles, namely nuclear bodies made from GFP-NLS-vimentin and microinjected 0.1 μm - wide polystyrene beads, by live cell time-lapse microscopy combined with single particle tracking and mobility analysis. We now provide a tool for the automatic 3-D analysis of particle movement in parallel with the acquisition of chromatin density data. Conclusion. Kinetic analysis revealed 4 modes of movement: confined obstructed, normal diffusion and directed motion. Particle tracking on the background of stained chromatin revealed that particle movement is directly related to local reorganization of chromatin. Further a direct comparison of particle movement in the nucleoplasm and the cytoplasm exhibited an entirely different kinetic behaviour of vimentin particles in both compartments. The kinetics of nuclear particles were slightly affected by depletion of ATP and significantly disturbed by disruption of actin and microtubule networks. Moreover, the hydration state of the nucleus had a strong impact on the mobility of nuclear bodies since both normal diffusion and directed motion were entirely abolished when cells were challenged with 0.6 M sorbitol. This effect correlated with the compaction of chromatin. We conclude that alteration in chromatin density directly influences the mobility of protein assemblies within the nucleus. © 2004 Bacher et al., licensee BioMed Central Ltd.", 
                "date": "2004-11-23T00:00:00Z", 
                "citationCount": 50, 
                "authors": [
                    {
                        "name": "Bacher C.P."
                    }, 
                    {
                        "name": "Reichenzeller M."
                    }, 
                    {
                        "name": "Athale C."
                    }, 
                    {
                        "name": "Herrmann H."
                    }, 
                    {
                        "name": "Eils R."
                    }
                ], 
                "journal": "BMC Cell Biology"
            }
        }
    ], 
    "credit": [
        {
            "name": null, 
            "email": null, 
            "url": "http://ibios.dkfz.de/tbi/index.php", 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "mbs_import", 
    "additionDate": "2017-08-03T19:02:47Z", 
    "lastUpdate": "2018-12-10T12:58:51Z", 
    "editPermission": {
        "type": "private", 
        "authors": []
    }, 
    "validated": 1, 
    "homepage_status": 0, 
    "elixir_badge": 0
}