{
    "additionDate": "2021-01-20T10:57:22Z",
    "biotoolsCURIE": "biotools:orphanet_rare",
    "biotoolsID": "orphanet_rare",
    "collectionID": [
        "Rare Disease"
    ],
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "panagiotis.sergouniotis@manchester.ac.uk",
            "name": "Panagiotis I. Sergouniotis",
            "orcidid": "https://orcid.org/0000-0003-0986-4123",
            "typeEntity": "Person"
        },
        {
            "email": "dollfus@unistra.fr",
            "name": "Hélène Dollfus",
            "typeEntity": "Person"
        }
    ],
    "description": "An ontological foundation for ocular phenotypes and rare eye diseases.\n\nThe portal for rare diseases and orphan drugs.\n\nOrphanet is a unique resource, gathering and improving knowledge on rare diseases so as to improve the diagnosis, care and treatment of patients with rare diseases. Orphanet aims to provide high-quality information on rare diseases, and ensure equal access to knowledge for all stakeholders. Orphanet also maintains the Orphanet rare disease nomenclature (ORPHAcode), essential in improving the visibility of rare diseases in health and research information systems.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "http://www.orpha.net/",
    "lastUpdate": "2021-05-18T05:38:58.620763Z",
    "name": "Orphanet Rare",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1186/S13023-018-0980-6",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The optical accessibility of the eye and technological advances in ophthalmic diagnostics have put ophthalmology at the forefront of data-driven medicine. The focus of this study is rare eye disorders, a group of conditions whose clinical heterogeneity and geographic dispersion make data-driven, evidence-based practice particularly challenging. Inter-institutional collaboration and information sharing is crucial but the lack of standardised terminology poses an important barrier. Ontologies are computational tools that include sets of vocabulary terms arranged in hierarchical structures. They can be used to provide robust terminology standards and to enhance data interoperability. Here, we discuss the development of the ophthalmology-related component of two well-established biomedical ontologies, the Human Phenotype Ontology (HPO; includes signs, symptoms and investigation findings) and the Orphanet Rare Disease Ontology (ORDO; includes rare disease nomenclature/nosology). Methods: A variety of approaches were used including automated matching to existing resources and extensive manual curation. To achieve the latter, a study group including clinicians, patient representatives and ontology developers from 17 countries was formed. A broad range of terms was discussed and validated during a dedicated workshop attended by 60 members of the group. Results: A comprehensive, structured and well-defined set of terms has been agreed on including 1106 terms relating to ocular phenotypes (HPO) and 1202 terms relating to rare eye disease nomenclature (ORDO). These terms and their relevant annotations can be accessed in http://www.human-phenotype-ontology.org/ and http://www.orpha.net/; comments, corrections, suggestions and requests for new terms can be made through these websites. This is an ongoing, community-driven endeavour and both HPO and ORDO are regularly updated. Conclusions: To our knowledge, this is the first effort of such scale to provide terminology standards for the rare eye disease community. We hope that this work will not only improve coding and standardise information exchange in clinical care and research, but also it will catalyse the transition to an evidence-based precision ophthalmology paradigm.",
                "authors": [
                    {
                        "name": "Sergouniotis P.I."
                    },
                    {
                        "name": "Maxime E."
                    },
                    {
                        "name": "Leroux D."
                    },
                    {
                        "name": "Olry A."
                    },
                    {
                        "name": "Thompson R."
                    },
                    {
                        "name": "Rath A."
                    },
                    {
                        "name": "Robinson P.N."
                    },
                    {
                        "name": "Dollfus H."
                    }
                ],
                "citationCount": 5,
                "date": "2019-01-09T00:00:00Z",
                "journal": "Orphanet Journal of Rare Diseases",
                "title": "An ontological foundation for ocular phenotypes and rare eye diseases"
            },
            "pmcid": "PMC6327432",
            "pmid": "30626441"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Rare diseases",
            "uri": "http://edamontology.org/topic_3325"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Personalised medicine",
            "uri": "http://edamontology.org/topic_3577"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}