
{
    "credit": [
        {
            "email": "qzy06@mails.tsinghua.edu.cn",
            "name": "Zhiyi Qin",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "RNA-Seq analysis",
                    "uri": "http://edamontology.org/operation_3680"
                },
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R",
            "C"
        ],
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            },
            {
                "term": "RNA splicing",
                "uri": "http://edamontology.org/topic_3320"
            }
        ]
    },
    "publication": [
        {
            "abstract": "Recent study revealed that most human genes have alternative splicing and can produce multiple isoforms of transcripts. Differences in the relative abundance of the isoforms of a gene can have significant biological consequences. Identifying genes that are differentially spliced between two groups of RNA-sequencing samples is an important basic task in the study of transcriptomes with next-generation sequencing technology. We use the negative binomial (NB) distribution to model sequencing reads on exons, and propose a NB-statistic to detect differentially spliced genes between two groups of samples by comparing read counts on all exons. The method opens a new exon-based approach instead of isoform-based approach for the task. It does not require information about isoform composition, nor need the estimation of isoform expression. Experiments on simulated data and real RNA-seq data of human kidney and liver samples illustrated the method's good performance and applicability. It can also detect previously unknown alternative splicing events, and highlight exons that are most likely differentially spliced between the compared samples. We developed an NB-statistic method that can detect differentially spliced genes between two groups of samples without using a prior knowledge on the annotation of alternative splicing. It does not need to infer isoform structure or to estimate isoform expression. It is a useful method designed for comparing two groups of RNA-seq samples. Besides identifying differentially spliced genes, the method can highlight on the exons that contribute the most to the differential splicing. We developed a software tool called DSGseq for the presented method available at http://bioinfo.au.tsinghua.edu.cn/software/DSGseq. © 2012 Elsevier B.V.",
            "authors": [
                "Wang W.",
                "Qin Z.",
                "Feng Z.",
                "Wang X.",
                "Zhang X."
            ],
            "cit_count": 29,
            "journal": "Gene",
            "pmid": "23228854",
            "title": "Identifying differentially spliced genes from two groups of RNA-seq samples",
            "year": "2013-04-10"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:dsgseq",
        "biotoolsID": "dsgseq",
        "description": "This program aims to identify differentially spliced genes from two groups of RNA-seq samples.",
        "homepage": "http://bioinfo.au.tsinghua.edu.cn/software/DSGseq",
        "name": "DSGseq"
    }
}