{
    "additionDate": "2019-11-14T19:41:12Z",
    "biotoolsCURIE": "biotools:m7G-MaP-seq",
    "biotoolsID": "m7G-MaP-seq",
    "confidence_flag": "tool",
    "description": "Detection of internal N7-methylguanosine (m7G) RNA modifications by mutational profiling sequencing | Code and data associated with m7G-MaP-Seq paper",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Post-translation modification site prediction",
                    "uri": "http://edamontology.org/operation_0417"
                },
                {
                    "term": "miRNA target prediction",
                    "uri": "http://edamontology.org/operation_0463"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://github.com/jeppevinther/m7g_map_seq",
    "language": [
        "R",
        "Shell"
    ],
    "lastUpdate": "2020-12-22T13:45:33Z",
    "name": "m7G-MaP-seq",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/NAR/GKZ736",
            "metadata": {
                "abstract": "© 2019 The Author(s) 2019. Published by Oxford University Press on behalf of Nucleic Acids Research.Methylation of guanosine on position N7 (m7G) on internal RNA positions has been found in all domains of life and have been implicated in human disease. Here, we present m7G Mutational Profiling sequencing (m7G-MaP-seq), which allows high throughput detection of m7G modifications at nucleotide resolution. In our method, m7G modified positions are converted to abasic sites by reduction with sodium borohydride, directly recorded as cDNA mutations through reverse transcription and sequenced. We detect positions with increased mutation rates in the reduced and control samples taking the possibility of sequencing/alignment error into account and use replicates to calculate statistical significance based on log likelihood ratio tests. We show that m7G-MaP-seq efficiently detects known m7G modifications in rRNA with mutational rates up to 25% and we map a previously uncharacterised evolutionarily conserved rRNA modification at position 1581 in Arabidopsis thaliana SSU rRNA. Furthermore, we identify m7G modifications in budding yeast, human and arabidopsis tRNAs and demonstrate that m7G modification occurs before tRNA splicing. We do not find any evidence for internal m7G modifications being present in other small RNA, such as miRNA, snoRNA and sRNA, including human Let-7e. Likewise, high sequencing depth m7G-MaP-seq analysis of mRNA from E. coli or yeast cells did not identify any internal m7G modifications.",
                "authors": [
                    {
                        "name": "Enroth C."
                    },
                    {
                        "name": "Poulsen L.D."
                    },
                    {
                        "name": "Iversen S."
                    },
                    {
                        "name": "Kirpekar F."
                    },
                    {
                        "name": "Albrechtsen A."
                    },
                    {
                        "name": "Vinther J."
                    }
                ],
                "citationCount": 32,
                "date": "2019-11-18T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Detection of internal N7-methylguanosine (m7G) RNA modifications by mutational profiling sequencing"
            },
            "pmid": "31504776"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ],
    "validated": 1
}