{
    "additionDate": "2016-11-21T10:33:07Z",
    "biotoolsCURIE": "biotools:dogsitescorer",
    "biotoolsID": "dogsitescorer",
    "collectionID": [
        "COVID-19",
        "de.NBI"
    ],
    "credit": [
        {
            "email": "rarey-office@zbh.uni-hamburg.de",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        },
        {
            "name": "University of Hamburg - Center for Bioinformatics",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        }
    ],
    "description": "Automated pocket detection and analysis tool enabling the identification of potential binding pockets and subpockets in protein structures. Additionally, global properties, describing size, shape and chemical features of the predicted (sub)pockets, are calculated. Per default, a simple druggability score is provided for each (sub)pocket, based on a linear combination of the three descriptors describing volume, hydrophobicity and enclosure.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://proteinsplus.zbh.uni-hamburg.de/help/index"
        }
    ],
    "editPermission": {
        "authors": [
            "Bietz"
        ],
        "type": "group"
    },
    "elixirCommunity": [
        "3D-BioInfo"
    ],
    "elixirNode": [
        "Germany"
    ],
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Protein structure",
                        "uri": "http://edamontology.org/data_1460"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ],
            "note": "Computational detection of protein binding pockets Protein binding pockets Property statistics of all protein binding pockets",
            "operation": [
                {
                    "term": "Protein structure analysis",
                    "uri": "http://edamontology.org/operation_2406"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Protein property",
                        "uri": "http://edamontology.org/data_0897"
                    },
                    "format": [
                        {
                            "term": "Textual format",
                            "uri": "http://edamontology.org/format_2330"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Protein structural motif",
                        "uri": "http://edamontology.org/data_2878"
                    },
                    "format": [
                        {
                            "term": "PDB",
                            "uri": "http://edamontology.org/format_1476"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://proteinsplus.zbh.uni-hamburg.de/#dogsite",
    "lastUpdate": "2020-06-08T15:15:17Z",
    "name": "DoGSiteScorer",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "stierand",
    "publication": [
        {
            "doi": "10.1021/ci100241y",
            "metadata": {
                "abstract": "Automated prediction of protein active sites is essential for large-scale protein function prediction, classification, and druggability estimates. In this work, we present DoGSite, a new structure-based method to predict active sites in proteins based on a Difference of Gaussian (DoG) approach which originates from image processing. In contrast to existing methods, DoGSite splits predicted pockets into subpockets, revealing a refined description of the topology of active sites. DoGSite correctly predicts binding pockets for over 92% of the PDBBind and the scPDB data set, being in line with the best-performing methods available. In 63% of the PDBBind data set the detected pockets can be subdivided into smaller subpockets. The cocrystallized ligand is contained in exactly one subpocket in 87% of the predictions. Furthermore, we introduce a more precise prediction performance measure by taking the pairwise ligand and pocket coverage into account. In 90% of the cases DoGSite predicts a pocket that contains at least half of the ligand. In 70% of the cases additionally more than a quarter of the respective pocket itself is covered by the cocrystallized ligand. Consideration of subpockets produces an increase in coverage yielding a success rate of 83% for the latter measure. © 2010 American Chemical Society.",
                "authors": [
                    {
                        "name": "Griewel A."
                    },
                    {
                        "name": "Grombacher T."
                    },
                    {
                        "name": "Rarey M."
                    },
                    {
                        "name": "Volkamer A."
                    }
                ],
                "citationCount": 90,
                "date": "2010-11-22T00:00:00Z",
                "journal": "Journal of Chemical Information and Modeling",
                "title": "Analyzing the topology of active sites: On the prediction of pockets and subpockets"
            },
            "type": [
                "Primary"
            ]
        },
        {
            "doi": "10.1093/bioinformatics/bts310",
            "metadata": {
                "abstract": "Motivation: Many drug discovery projects fail because the underlying target is finally found to be undruggable. Progress in structure elucidation of proteins now opens up a route to automatic structure-based target assessment. DoGSiteScorer is a newly developed automatic tool combining pocket prediction, characterization and druggability estimation and is now available through a web server. © The Author 2012. Published by Oxford University Press. All rights reserved.",
                "authors": [
                    {
                        "name": "Kuhn D."
                    },
                    {
                        "name": "Rarey M."
                    },
                    {
                        "name": "Rippmann F."
                    },
                    {
                        "name": "Volkamer A."
                    }
                ],
                "citationCount": 187,
                "date": "2012-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Dogsitescorer: A web server for automatic binding site prediction, analysis and druggability assessment"
            },
            "type": [
                "Other"
            ]
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Protein binding sites",
            "uri": "http://edamontology.org/topic_3534"
        }
    ],
    "validated": 1
}
