{
    "additionDate": "2022-10-11T12:15:01.101838Z",
    "biotoolsCURIE": "biotools:vaccineda",
    "biotoolsID": "vaccineda",
    "credit": [
        {
            "name": "Dr Gajendra P.S. Raghava",
            "url": "https://webs.iiitd.edu.in/raghava/vaccineda/"
        }
    ],
    "description": "‘VaccineDA’ has been made available to the scientific community as a webserver in order to assist the experimentalists in designing better IMODN based adjuvants using sequence information of the oligonucleotides.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/vaccineda/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Analysis",
                    "uri": "http://edamontology.org/operation_2945"
                }
            ]
        }
    ],
    "homepage": "https://webs.iiitd.edu.in/raghava/vaccineda/",
    "lastUpdate": "2022-10-11T12:15:06.609862Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "https://webs.iiitd.edu.in/raghava/vaccineda/"
        }
    ],
    "name": "vaccineda",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "raghavagps",
    "publication": [
        {
            "doi": "10.1038/srep12478",
            "metadata": {
                "abstract": "© 2015, Macmillan Publishers Limited. All rights reserved.Immunomodulatory oligodeoxynucleotides (IMODNs) are the short DNA sequences that activate the innate immune system via toll-like receptor 9. These sequences predominantly contain unmethylated CpG motifs. In this work, we describe VaccineDA (Vaccine DNA adjuvants), a web-based resource developed to design IMODN-based vaccine adjuvants. We collected and analyzed 2193 experimentally validated IMODNs obtained from the literature. Certain types of nucleotides (e.g., T, GT, TC, TT, CGT, TCG, TTT) are dominant in IMODNs. Based on these observations, we developed support vector machine-based models to predict IMODNs using various compositions. The developed models achieved the maximum Matthews Correlation Coefficient (MCC) of 0.75 with an accuracy of 87.57% using the pentanucleotide composition. The integration of motif information further improved the performance of our model from the MCC of 0.75 to 0.77. Similarly, models were developed to predict palindromic IMODNs and attained a maximum MCC of 0.84 with the accuracy of 91.94%. These models were evaluated using a five-fold cross-validation technique as well as validated on an independent dataset. The models developed in this study were integrated into VaccineDA to provide a wide range of services that facilitate the design of DNA-based vaccine adjuvants (http://crdd.osdd.net/raghava/vaccineda/).",
                "authors": [
                    {
                        "name": "Chaudhary K."
                    },
                    {
                        "name": "Gupta S."
                    },
                    {
                        "name": "Kumar Dhanda S."
                    },
                    {
                        "name": "Nagpal G."
                    },
                    {
                        "name": "Prakash S."
                    },
                    {
                        "name": "Raghava G.P.S."
                    }
                ],
                "citationCount": 17,
                "date": "2015-07-27T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "VaccineDA: Prediction, design and genome-wide screening of oligodeoxynucleotide-based vaccine adjuvants"
            },
            "pmcid": "PMC4515643",
            "pmid": "26212482"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Computational biology",
            "uri": "http://edamontology.org/topic_3307"
        }
    ]
}
