{
    "accessibility": "Open access",
    "additionDate": "2024-01-30T15:32:48.860854Z",
    "biotoolsCURIE": "biotools:covrecon",
    "biotoolsID": "covrecon",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "wolfram.weckwerth@univie.ac.at",
            "name": "Wolfram Weckwerth",
            "orcidid": "https://orcid.org/0000-0002-9719-6358",
            "typeEntity": "Person"
        },
        {
            "name": "Jiahang Li",
            "typeEntity": "Person"
        },
        {
            "name": "Steffen Waldherr",
            "typeEntity": "Person"
        }
    ],
    "description": "Automated integration of genome- and metabolome-scale network reconstruction and data-driven inverse modelling of metabolic interaction networks.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Metabolic network modelling",
                    "uri": "http://edamontology.org/operation_3660"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                },
                {
                    "term": "Sequence assembly",
                    "uri": "http://edamontology.org/operation_0310"
                }
            ]
        }
    ],
    "homepage": "https://bitbucket.org/mosys-univie/covrecon",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2024-01-30T15:32:48.863908Z",
    "name": "COVRECON",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTAD397",
            "metadata": {
                "abstract": "Motivation: One central goal of systems biology is to infer biochemical regulations from large-scale OMICS data. Many aspects of cellular physiology and organismal phenotypes can be understood as results of metabolic interaction network dynamics. Previously, we have proposed a convenient mathematical method, which addresses this problem using metabolomics data for the inverse calculation of biochemical Jacobian matrices revealing regulatory checkpoints of biochemical regulations. The proposed algorithms for this inference are limited by two issues: they rely on structural network information that needs to be assembled manually, and they are numerically unstable due to ill-conditioned regression problems for large-scale metabolic networks. Results: To address these problems, we developed a novel regression loss-based inverse Jacobian algorithm, combining metabolomics COVariance and genome-scale metabolic RECONstruction, which allows for a fully automated, algorithmic implementation of the COVRECON workflow. It consists of two parts: (i) Sim-Network and (ii) inverse differential Jacobian evaluation. Sim-Network automatically generates an organism-specific enzyme and reaction dataset from Bigg and KEGG databases, which is then used to reconstruct the Jacobian's structure for a specific metabolomics dataset. Instead of directly solving a regression problem as in the previous workflow, the new inverse differential Jacobian is based on a substantially more robust approach and rates the biochemical interactions according to their relevance from large-scale metabolomics data. The approach is illustrated by in silico stochastic analysis with differently sized metabolic networks from the BioModels database and applied to a real-world example. The characteristics of the COVRECON implementation are that (i) it automatically reconstructs a data-driven superpathway model; (ii) more general network structures can be investigated, and (iii) the new inverse algorithm improves stability, decreases computation time, and extends to large-scale models.",
                "authors": [
                    {
                        "name": "Li J."
                    },
                    {
                        "name": "Waldherr S."
                    },
                    {
                        "name": "Weckwerth W."
                    }
                ],
                "date": "2023-07-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "COVRECON: automated integration of genome- and metabolome-scale network reconstruction and data-driven inverse modeling of metabolic interaction networks"
            },
            "pmcid": "PMC10356784",
            "pmid": "37402625"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Endocrinology and metabolism",
            "uri": "http://edamontology.org/topic_3407"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Metabolomics",
            "uri": "http://edamontology.org/topic_3172"
        },
        {
            "term": "Physiology",
            "uri": "http://edamontology.org/topic_3300"
        }
    ]
}
