{
    "additionDate": "2019-11-14T18:41:07Z",
    "biotoolsCURIE": "biotools:cfDNA",
    "biotoolsID": "cfDNA",
    "confidence_flag": "tool",
    "description": "Detection of genomic alterations in breast cancer with circulating tumour DNA sequencing | Analysis of cfDNA data with UMIs (consensus generation, SNV calling, annotation and evaluation of fragment length profiles) | Detection of genomic alterations with error-corrected cfDNA sequencing | Several recent studies have demonstrated the ability of cfDNA sequencing to provide early prognostication, better molecular profiling and monitoring of disease dynamics with many applications in genomic-driven oncology",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/dkleftogi/cfDNA_AnalysisPipeline/blob/master/Execution_examples.md"
        }
    ],
    "editPermission": {
        "type": "public"
    },
    "homepage": "https://github.com/dkleftogi/cfDNA_AnalysisPipeline",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-12-14T11:49:30Z",
    "license": "MIT",
    "name": "cfDNA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1101/733691"
        },
        {
            "doi": "10.1038/s41598-020-72818-6",
            "metadata": {
                "abstract": "© 2020, The Author(s).Analysis of circulating cell-free DNA (cfDNA) has opened new opportunities for characterizing tumour mutational landscapes with many applications in genomic-driven oncology. We developed a customized targeted cfDNA sequencing approach for breast cancer (BC) using unique molecular identifiers (UMIs) for error correction. Our assay, spanning a 284.5 kb target region, is combined with a novel freely-licensed bioinformatics pipeline that provides detection of low-frequency variants, and reliable identification of copy number variations (CNVs) directly from plasma DNA. We first evaluated our pipeline on reference samples. Then in a cohort of 35 BC patients our approach detected actionable driver and clonal variants at low variant frequency levels in cfDNA that were concordant (77%) with sequencing of primary and/or metastatic solid tumour sites. We also detected ERRB2 gene CNVs used for HER2 subtype classification with 80% precision compared to immunohistochemistry. Further, we evaluated fragmentation profiles of cfDNA in BC and observed distinct differences compared to data from healthy individuals. Our results show that the developed assay addresses the majority of tumour associated aberrations directly from plasma DNA, and thus may be used to elucidate genomic alterations in liquid biopsy studies.",
                "authors": [
                    {
                        "name": "Gan A."
                    },
                    {
                        "name": "Ho D."
                    },
                    {
                        "name": "Kleftogiannis D."
                    },
                    {
                        "name": "Lee A.S.-G."
                    },
                    {
                        "name": "Liew J.X."
                    },
                    {
                        "name": "Lim S.H."
                    },
                    {
                        "name": "Lim T.K.-H."
                    },
                    {
                        "name": "Ng R.C.-H."
                    },
                    {
                        "name": "Ng S.B."
                    },
                    {
                        "name": "Poon P.S.Y."
                    },
                    {
                        "name": "Shih C.C."
                    },
                    {
                        "name": "Tan B.K.-T."
                    },
                    {
                        "name": "Tan G.S."
                    },
                    {
                        "name": "Tan I.B."
                    },
                    {
                        "name": "Tay K.H."
                    },
                    {
                        "name": "Yap Y.-S."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "Scientific Reports",
                "title": "Detection of genomic alterations in breast cancer with circulating tumour DNA sequencing"
            },
            "pmcid": "PMC7544894",
            "pmid": "33033274"
        }
    ],
    "toolType": [
        "Workflow"
    ],
    "topic": [
        {
            "term": "Exome sequencing",
            "uri": "http://edamontology.org/topic_3676"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        },
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        }
    ],
    "validated": 1
}
