{
    "additionDate": "2017-12-18T00:07:30Z",
    "biotoolsCURIE": "biotools:htpheno",
    "biotoolsID": "htpheno",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://htpheno.ipk-gatersleben.de/copyright_contact.html"
        }
    ],
    "description": "HTPheno is a software for high-throughput plant phenotyping is presented. HTPheno is implemented as a plugin for ImageJ, an open source image processing software. It provides the possibility to analyse colour images of plants which are taken in two different views (top view and side view) during a screening. Within the analysis different phenotypical parameters for each plant such as height, width and projected shoot area of the plants are calculated for the duration of the screening.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://htpheno.ipk-gatersleben.de/documentation_tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Image analysis",
                    "uri": "http://edamontology.org/operation_3443"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Processing",
                    "uri": "http://edamontology.org/operation_2409"
                }
            ]
        }
    ],
    "homepage": "http://htpheno.ipk-gatersleben.de/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2019-02-26T12:00:11Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/htpheno-image-analysis-pipeline-high-throughput-phenotyping.html"
        }
    ],
    "name": "HTPheno",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1186/1471-2105-12-148",
            "metadata": {
                "abstract": "Background: In the last few years high-throughput analysis methods have become state-of-the-art in the life sciences. One of the latest developments is automated greenhouse systems for high-throughput plant phenotyping. Such systems allow the non-destructive screening of plants over a period of time by means of image acquisition techniques. During such screening different images of each plant are recorded and must be analysed by applying sophisticated image analysis algorithms.Results: This paper presents an image analysis pipeline (HTPheno) for high-throughput plant phenotyping. HTPheno is implemented as a plugin for ImageJ, an open source image processing software. It provides the possibility to analyse colour images of plants which are taken in two different views (top view and side view) during a screening. Within the analysis different phenotypical parameters for each plant such as height, width and projected shoot area of the plants are calculated for the duration of the screening. HTPheno is applied to analyse two barley cultivars.Conclusions: HTPheno, an open source image analysis pipeline, supplies a flexible and adaptable ImageJ plugin which can be used for automated image analysis in high-throughput plant phenotyping and therefore to derive new biological insights, such as determination of fitness. © 2011 Hartmann et al; licensee BioMed Central Ltd.",
                "authors": [
                    {
                        "name": "Hartmann A."
                    },
                    {
                        "name": "Czauderna T."
                    },
                    {
                        "name": "Hoffmann R."
                    },
                    {
                        "name": "Stein N."
                    },
                    {
                        "name": "Schreiber F."
                    }
                ],
                "citationCount": 169,
                "date": "2011-05-12T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "HTPheno: An image analysis pipeline for high-throughput plant phenotyping"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Desktop application"
    ],
    "topic": [
        {
            "term": "Plant",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Plants",
            "uri": "http://edamontology.org/topic_0780"
        },
        {
            "term": "Phenotyping",
            "uri": "http://edamontology.org/topic_0625"
        }
    ],
    "validated": 1
}