{
    "accessibility": "Open access",
    "additionDate": "2022-10-02T21:57:07.622439Z",
    "biotoolsCURIE": "biotools:iacvp",
    "biotoolsID": "iacvp",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "bala2022@skku.edu",
            "name": "Balachandran Manavalan",
            "orcidid": "https://orcid.org/0000-0003-0697-9419",
            "typeEntity": "Person"
        },
        {
            "email": "kurata@bio.kyutech.ac.jp",
            "name": "Hiroyuki Kurata",
            "orcidid": "https://orcid.org/0000-0003-4254-2214",
            "typeEntity": "Person"
        },
        {
            "name": "Sho Tsukiyama",
            "orcidid": "https://orcid.org/0000-0002-7871-0868"
        }
    ],
    "description": "Computational prediction of anticoronavirus peptides (ACVPs) using their sequences.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Peptide identification",
                    "uri": "http://edamontology.org/operation_3631"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "homepage": "http://kurata35.bio.kyutech.ac.jp/iACVP",
    "lastUpdate": "2024-11-24T15:31:58.013855Z",
    "name": "iACVP",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1093/bib/bbac265",
            "metadata": {
                "abstract": "The COVID-19 pandemic caused several million deaths worldwide. Development of anti-coronavirus drugs is thus urgent. Unlike conventional non-peptide drugs, antiviral peptide drugs are highly specific, easy to synthesize and modify, and not highly susceptible to drug resistance. To reduce the time and expense involved in screening thousands of peptides and assaying their antiviral activity, computational predictors for identifying anti-coronavirus peptides (ACVPs) are needed. However, few experimentally verified ACVP samples are available, even though a relatively large number of antiviral peptides (AVPs) have been discovered. In this study, we attempted to predict ACVPs using an AVP dataset and a small collection of ACVPs. Using conventional features, a binary profile and a word-embedding word2vec (W2V), we systematically explored five different machine learning methods: Transformer, Convolutional Neural Network, bidirectional Long Short-Term Memory, Random Forest (RF) and Support Vector Machine. Via exhaustive searches, we found that the RF classifier with W2V consistently achieved better performance on different datasets. The two main controlling factors were: (i) the dataset-specific W2V dictionary was generated from the training and independent test datasets instead of the widely used general UniProt proteome and (ii) a systematic search was conducted and determined the optimal k-mer value in W2V, which provides greater discrimination between positive and negative samples. Therefore, our proposed method, named iACVP, consistently provides better prediction performance compared with existing state-of-The-Art methods. To assist experimentalists in identifying putative ACVPs, we implemented our model as a web server accessible via the following link: http://kurata35.bio.kyutech.ac.jp/iACVP.",
                "authors": [
                    {
                        "name": "Kurata H."
                    },
                    {
                        "name": "Manavalan B."
                    },
                    {
                        "name": "Tsukiyama S."
                    }
                ],
                "citationCount": 28,
                "date": "2022-07-01T00:00:00Z",
                "journal": "Briefings in Bioinformatics",
                "title": "IACVP: Markedly enhanced identification of anti-coronavirus peptides using a dataset-specific word2vec model"
            },
            "pmid": "35772910"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Bioinformatics",
            "uri": "http://edamontology.org/topic_0091"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}
