{
    "additionDate": "2021-01-18T10:04:02Z",
    "biotoolsCURIE": "biotools:mearec",
    "biotoolsID": "mearec",
    "confidence_flag": "tool",
    "credit": [
        {
            "name": "Alessio Paolo Buccino",
            "typeEntity": "Person"
        }
    ],
    "description": "A Fast and Customizable Testbench Simulator for Ground-truth Extracellular Spiking Activity.\n\nMEArec: Fast and customizable simulation of extracellular recordings on Multi-Electrode-Arrays.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://mearec.readthedocs.io/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "https://github.com/alejoe91/MEArec",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-20T17:44:37Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://pypi.org/project/MEArec/"
        }
    ],
    "name": "MEArec",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1007/S12021-020-09467-7",
            "metadata": {
                "abstract": "© 2020, The Author(s).When recording neural activity from extracellular electrodes, both in vivo and in vitro, spike sorting is a required and very important processing step that allows for identification of single neurons’ activity. Spike sorting is a complex algorithmic procedure, and in recent years many groups have attempted to tackle this problem, resulting in numerous methods and software packages. However, validation of spike sorting techniques is complicated. It is an inherently unsupervised problem and it is hard to find universal metrics to evaluate performance. Simultaneous recordings that combine extracellular and patch-clamp or juxtacellular techniques can provide ground-truth data to evaluate spike sorting methods. However, their utility is limited by the fact that only a few cells can be measured at the same time. Simulated ground-truth recordings can provide a powerful alternative mean to rank the performance of spike sorters. We present here MEArec, a Python-based software which permits flexible and fast simulation of extracellular recordings. MEArec allows users to generate extracellular signals on various customizable electrode designs and can replicate various problematic aspects for spike sorting, such as bursting, spatio-temporal overlapping events, and drifts. We expect MEArec will provide a common testbench for spike sorting development and evaluation, in which spike sorting developers can rapidly generate and evaluate the performance of their algorithms.",
                "authors": [
                    {
                        "name": "Buccino A.P."
                    },
                    {
                        "name": "Einevoll G.T."
                    }
                ],
                "citationCount": 1,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Neuroinformatics",
                "title": "MEArec: A Fast and Customizable Testbench Simulator for Ground-truth Extracellular Spiking Activity"
            },
            "pmid": "32648042"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        }
    ]
}