{
    "additionDate": "2017-08-03T18:55:57Z",
    "biotoolsCURIE": "biotools:platinumcnv",
    "biotoolsID": "platinumcnv",
    "credit": [
        {
            "email": "kumasaka@src.riken.jp",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Software package to fit a Bayesian Gaussian mixture model (GMM) on the SNP array signal intensity data, and infer individual’s allele-specific copy number genotypes at genome-wide SNP loci in a SNP array.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://kumasakanatsuhiko.jp/projects/platinumcnv/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "http://kumasakanatsuhiko.jp/projects/platinumcnv/",
    "language": [
        "R",
        "C"
    ],
    "lastUpdate": "2018-12-10T12:58:56Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/platinumcnv-1-0-bayesian-gaussian-mixture-model-genotyping-copy-number-polymorphisms.html"
        }
    ],
    "name": "PlatinumCNV",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "We present a statistical model for allele-specific patterns of copy number polymorphisms (CNPs) in commercial single nucleotide polymorphism (SNP) array data. This model is based on the observation that fluorescent signal intensities tend to cluster into clouds of similar allele-specific copy number (ASCN) genotypes at each SNP locus. To capture the tendency of this clustering to be made vague by instrumental errors, our model allows for cluster memberships to overlap each other, according to a Bayesian Gaussian mixture model (GMM). This approach is flexible, allowing for both absolute scale differences and X/Y scale imbalances of fluorescent signal intensities. The resulting model is also robust toward unobserved ASCN genotypes, which can be problematic for ordinary GMMs. We illustrated the utility of the model by applying it to commercial SNP array intensity data obtained from the Illumina HumanHap 610K platform. We retrieved more than 4,000 allele-specific CNPs, though 99% of them showed rather simple allele-specific CNP patterns with only a single aneuploid haplotype among the normal haplotypes. The genotyping accuracy was assessed by two approaches, quantitative PCR and replicated subjects. The results of both of these approaches demonstrated mean genotyping error rates of 1%. We demonstrated a preliminary genome-wide association study of three hematological traits. The result exhibited that it could form the foundation for new, more effective statistical methods for the mapping of both disease genes and quantitative trait loci with genome-wide CNPs. The methods described in this work are implemented in a software package, PlatinumCNV, available on the Internet. © 2011 Wiley Periodicals, Inc.",
                "authors": [
                    {
                        "name": "Kumasaka N."
                    },
                    {
                        "name": "Fujisawa H."
                    },
                    {
                        "name": "Hosono N."
                    },
                    {
                        "name": "Okada Y."
                    },
                    {
                        "name": "Takahashi A."
                    },
                    {
                        "name": "Nakamura Y."
                    },
                    {
                        "name": "Kubo M."
                    },
                    {
                        "name": "Kamatani N."
                    }
                ],
                "citationCount": 8,
                "date": "2011-12-01T00:00:00Z",
                "journal": "Genetic Epidemiology",
                "title": "PlatinumCNV: A Bayesian Gaussian mixture model for genotyping copy number polymorphisms using SNP array signal intensity data"
            },
            "pmid": "22125222"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genotyping experiment",
            "uri": "http://edamontology.org/topic_3516"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}