{
    "accessibility": "Open access",
    "additionDate": "2022-12-06T00:32:05.010384Z",
    "biotoolsCURIE": "biotools:taca",
    "biotoolsID": "taca",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "chengf@ccf.org",
            "name": "Feixiong Cheng",
            "typeEntity": "Person"
        },
        {
            "name": "Jielin Xu"
        },
        {
            "name": "Yadi Zhou"
        },
        {
            "name": "Yuan Hou"
        }
    ],
    "description": "A single-cell molecular map for translational therapeutics accelerator in Alzheimer's disease.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Drug name",
                        "uri": "http://edamontology.org/data_2899"
                    }
                },
                {
                    "data": {
                        "term": "DrugBank ID",
                        "uri": "http://edamontology.org/data_2326"
                    }
                },
                {
                    "data": {
                        "term": "Gene symbol",
                        "uri": "http://edamontology.org/data_1026"
                    }
                },
                {
                    "data": {
                        "term": "Locus ID (EntrezGene)",
                        "uri": "http://edamontology.org/data_1904"
                    }
                }
            ],
            "operation": [
                {
                    "term": "Differential gene expression profiling",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Protein interaction prediction",
                    "uri": "http://edamontology.org/operation_2492"
                },
                {
                    "term": "Virtual screening",
                    "uri": "http://edamontology.org/operation_3938"
                }
            ]
        }
    ],
    "homepage": "https://taca.lerner.ccf.org/",
    "lastUpdate": "2024-11-24T15:18:38.048512Z",
    "name": "TACA",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1002/trc2.12350",
            "metadata": {
                "abstract": "Introduction: Recent advances in generating massive single-cell/nucleus transcriptomic data have shown great potential for facilitating the identification of cell type–specific Alzheimer's disease (AD) pathobiology and drug-target discovery for therapeutic development. Methods: We developed The Alzheimer's Cell Atlas (TACA) by compiling an AD brain cell atlas consisting of over 1.1 million cells/nuclei across 26 data sets, covering major brain regions (hippocampus, cerebellum, prefrontal cortex, and so on) and cell types (astrocyte, microglia, neuron, oligodendrocytes, and so on). We conducted nearly 1400 differential expression comparisons to identify cell type–specific molecular alterations (e.g., case vs healthy control, sex-specific, apolipoprotein E (APOE) ε4/ε4, and TREM2 mutations). Each comparison was followed by protein-protein interaction module detection, functional enrichment analysis, and omics-informed target and drug (over 700,000 perturbation profiles) screening. Over 400 cell-cell interaction analyses using 6000 ligand-receptor interactions were conducted to identify the cell-cell communication networks in AD. Results: All results are integrated into TACA (https://taca.lerner.ccf.org/), a new web portal with cell type–specific, abundant transcriptomic information, and 12 interactive visualization tools for AD. Discussion: We envision that TACA will be a highly valuable resource for both basic and translational research in AD, as it provides abundant information for AD pathobiology and actionable systems biology tools for drug discovery. Highlights: We compiled an Alzheimer's disease (AD) brain cell atlas consisting of more than 1.1 million cells/nuclei transcriptomes from 26 data sets, covering major brain regions (cortex, hippocampus, cerebellum) and cell types (e.g., neuron, oligodendrocyte, astrocyte, and microglia). We conducted over 1400 differential expression (DE) comparisons to identify cell type–specific gene expression alterations. Major comparison types are (1) AD versus healthy control; (2) sex-specific DE, (3) genotype-driven DE (i.e., apolipoprotein E [APOE] ε4/ε4 vs APOE ε3/ε3; TREM2R47H vs common variants) analysis; and (4) others. Each comparison was further followed by (1) human protein-protein interactome network module analysis, (2) pathway enrichment analysis, and (3) gene-set enrichment analysis. For drug screening, we conducted gene set enrichment analysis for all the comparisons with over 700,000 drug perturbation profiles connecting more than 10,000 human genes and 13,000 drugs/compounds. A total of over 400 analyses of cell-cell interactions against 6000 experimentally validated ligand-receptor interactions were conducted to reveal the disease-relevant cell-cell communications in AD.",
                "authors": [
                    {
                        "name": "Bekris L."
                    },
                    {
                        "name": "Cheng F."
                    },
                    {
                        "name": "Cummings J."
                    },
                    {
                        "name": "Hou Y."
                    },
                    {
                        "name": "Leverenz J.B."
                    },
                    {
                        "name": "Pieper A.A."
                    },
                    {
                        "name": "Xu J."
                    },
                    {
                        "name": "Zhou Y."
                    }
                ],
                "citationCount": 16,
                "date": "2022-01-01T00:00:00Z",
                "journal": "Alzheimer's and Dementia: Translational Research and Clinical Interventions",
                "title": "The Alzheimer's Cell Atlas (TACA): A single-cell molecular map for translational therapeutics accelerator in Alzheimer's disease"
            },
            "pmcid": "PMC9558163",
            "pmid": "36254161"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Pathology",
            "uri": "http://edamontology.org/topic_0634"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ],
    "validated": 1
}
