{
    "additionDate": "2021-01-18T07:01:10Z",
    "biotoolsCURIE": "biotools:eqtlmapt",
    "biotoolsID": "eqtlmapt",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jiajiepeng@nwpu.edu.cn",
            "name": "Jiajie Peng",
            "typeEntity": "Person"
        },
        {
            "email": "ydwang@hit.edu.cn",
            "name": "Yadong Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "eQTLMAPT is a fast and accurate eQTL mediation analysis with efficient permutation testing approaches. eQTLMAPT implements fast and accurate eQTL mediation analysis with efficient permutation procedures to control for multiple testing. eQTLMAPT provides adaptive permutation scheme which prunes the permutation process opportunely, and it models the null distribution using generalized Pareto distribution (GPD) trained from a few permutations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Gene expression QTL analysis",
                    "uri": "http://edamontology.org/operation_3232"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                }
            ]
        }
    ],
    "homepage": "https://github.com/QidiPeng/eQTLMAPT",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-03-08T08:59:03Z",
    "name": "eQTLMAPT",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FGENE.2019.01309",
            "metadata": {
                "abstract": "© Copyright © 2020 Wang, Peng, Liu, Liu, Liu, Peng and Wang.Expression quantitative trait locus (eQTL) analyses are critical in understanding the complex functional regulatory natures of genetic variation and have been widely used in the interpretation of disease-associated variants identified by genome-wide association studies (GWAS). Emerging evidence has shown that trans-eQTL effects on remote gene expression could be mediated by local transcripts, which is known as the mediation effects. To discover the genome-wide eQTL mediation effects combing genomic and transcriptomic profiles, it is necessary to develop novel computational methods to rapidly scan large number of candidate associations while controlling for multiple testing appropriately. Here, we present eQTLMAPT, an R package aiming to perform eQTL mediation analysis with implementation of efficient permutation procedures in multiple testing correction. eQTLMAPT is advantageous in threefold. First, it accelerates mediation analysis by effectively pruning the permutation process through adaptive permutation scheme. Second, it can efficiently and accurately estimate the significance level of mediation effects by modeling the null distribution with generalized Pareto distribution (GPD) trained from a few permutation statistics. Third, eQTLMAPT provides flexible interfaces for users to combine various permutation schemes with different confounding adjustment methods. Experiments on real eQTL dataset demonstrate that eQTLMAPT provides higher resolution of estimated significance of mediation effects and is an order of magnitude faster than compared methods with similar accuracy.",
                "authors": [
                    {
                        "name": "Liu B."
                    },
                    {
                        "name": "Liu X."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Peng J."
                    },
                    {
                        "name": "Peng Q."
                    },
                    {
                        "name": "Wang T."
                    },
                    {
                        "name": "Wang Y."
                    }
                ],
                "citationCount": 1,
                "date": "2020-01-09T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "eQTLMAPT: Fast and Accurate eQTL Mediation Analysis With Efficient Permutation Testing Approaches"
            },
            "pmcid": "PMC6970436",
            "pmid": "31998368"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "GWAS study",
            "uri": "http://edamontology.org/topic_3517"
        },
        {
            "term": "Gene regulation",
            "uri": "http://edamontology.org/topic_0204"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        }
    ]
}
