{
    "additionDate": "2018-04-26T15:30:03Z",
    "biotoolsCURIE": "biotools:t3_mm",
    "biotoolsID": "t3_mm",
    "credit": [
        {
            "email": "yejun.wang@gmail.com",
            "name": "Yejun Wang",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "T3S effector prediction tool based on Markov Model",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://biocomputer.bio.cuhk.edu.hk/T3DB/help.php"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "https://biocomputer.bio.cuhk.edu.hk/T3DB/T3_MM.php",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:57Z",
    "name": "T3_MM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0058173",
            "metadata": {
                "abstract": "Motivation: Type III Secretion Systems (T3SSs) play important roles in the interaction between gram-negative bacteria and their hosts. T3SSs function by translocating a group of bacterial effector proteins into the host cytoplasm. The details of specific type III secretion process are yet to be clarified. This research focused on comparing the amino acid composition within the N-terminal 100 amino acids from type III secretion (T3S) signal sequences or non-T3S proteins, specifically whether each residue exerts a constraint on residues found in adjacent positions. We used these comparisons to set up a statistic model to quantitatively model and effectively distinguish T3S effectors. Results: In this study, the amino acid composition (Aac) probability profiles conditional on its sequentially preceding position and corresponding amino acids were compared between N-terminal sequences of T3S and non-T3S proteins. The profiles are generally different. A Markov model, namely T3_MM, was consequently designed to calculate the total Aac conditional probability difference, i.e., the likelihood ratio of a sequence being a T3S or a non-T3S protein. With T3_MM, known T3S and non-T3S proteins were found to well approximate two distinct normal distributions. The model could distinguish validated T3S and non-T3S proteins with a 5-fold cross-validation sensitivity of 83.9% at a specificity of 90.3%. T3_MM was also shown to be more robust, accurate, simple, and statistically quantitative, when compared with other T3S protein prediction models. The high effectiveness of T3_MM also indicated the overall Aac difference between N-termini of T3S and non-T3S proteins, and the constraint of Aac exerted by its preceding position and corresponding Aac. Availability: An R package for T3_MM is freely downloadable from: http://biocomputer.bio.cuhk.edu.hk/softwares/T3_MM. T3_MM web server: http://biocomputer.bio.cuhk.edu.hk/T3DB/T3_MM.php. © 2013 Wang et al.",
                "authors": [
                    {
                        "name": "Wang Y."
                    },
                    {
                        "name": "Sun M."
                    },
                    {
                        "name": "Bao H."
                    },
                    {
                        "name": "White A.P."
                    }
                ],
                "citationCount": 26,
                "date": "2013-03-05T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "T3_MM: A Markov Model Effectively Classifies Bacterial Type III Secretion Signals"
            },
            "pmcid": "PMC3589343",
            "pmid": "23472154"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Microbiology",
            "uri": "http://edamontology.org/topic_3301"
        },
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        }
    ],
    "validated": 1
}