{
    "accessibility": "Open access",
    "additionDate": "2023-02-06T07:27:38.648745Z",
    "biotoolsCURIE": "biotools:icam-reg",
    "biotoolsID": "icam-reg",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Cher Bass"
        }
    ],
    "description": "Interpretable Classification and Regression with Feature Attribution for Mapping Neurological Phenotypes in Individual Scans.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Regression analysis",
                    "uri": "http://edamontology.org/operation_3659"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CherBass/ICAM",
    "language": [
        "Python"
    ],
    "lastUpdate": "2023-02-06T07:27:38.651218Z",
    "license": "MIT",
    "name": "ICAM-reg",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1109/TMI.2022.3221890",
            "metadata": {
                "abstract": "AuthorAn important goal of medical imaging is to be able to precisely detect patterns of disease specific to individual scans; however, this is challenged in brain imaging by the degree of heterogeneity of shape and appearance. Traditional methods, based on image registration, historically fail to detect variable features of disease, as they utilise population-based analyses, suited primarily to studying group-average effects. In this paper we therefore take advantage of recent developments in generative deep learning to develop a method for simultaneous classification, or regression, and feature attribution (FA). Specifically, we explore the use of a VAE-GAN (variational autoencoder - general adversarial network) for translation called ICAM, to explicitly disentangle class relevant features, from background confounds, for improved interpretability and regression of neurological phenotypes. We validate our method on the tasks of Mini-Mental State Examination (MMSE) cognitive test score prediction for the Alzheimer&#x2019;s Disease Neuroimaging Initiative (ADNI) cohort, as well as brain age prediction, for both neurodevelopment and neurodegeneration, using the developing Human Connectome Project (dHCP) and UK Biobank datasets. We show that the generated FA maps can be used to explain outlier predictions and demonstrate that the inclusion of a regression module improves the disentanglement of the latent space. Our code is freely available on GitHub https://github.com/CherBass/ICAM.",
                "authors": [
                    {
                        "name": "Alfaro-Almagro F."
                    },
                    {
                        "name": "Bass C."
                    },
                    {
                        "name": "Da Silva M."
                    },
                    {
                        "name": "Fitzgibbon S.P."
                    },
                    {
                        "name": "Glasser M.F."
                    },
                    {
                        "name": "Robinson E.C."
                    },
                    {
                        "name": "Smith S.M."
                    },
                    {
                        "name": "Sousa H.S."
                    },
                    {
                        "name": "Sudre C."
                    },
                    {
                        "name": "Tudosiu P."
                    },
                    {
                        "name": "Williams L.Z.J."
                    }
                ],
                "date": "2022-01-01T00:00:00Z",
                "journal": "IEEE Transactions on Medical Imaging",
                "title": "ICAM-reg: Interpretable Classification and Regression with Feature Attribution for Mapping Neurological Phenotypes in Individual Scans"
            },
            "pmid": "36374873"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Biobank",
            "uri": "http://edamontology.org/topic_3337"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Medical imaging",
            "uri": "http://edamontology.org/topic_3384"
        },
        {
            "term": "Neurobiology",
            "uri": "http://edamontology.org/topic_3304"
        },
        {
            "term": "Neurology",
            "uri": "http://edamontology.org/topic_3334"
        }
    ]
}
