{
    "additionDate": "2021-01-18T09:08:30Z",
    "biotoolsCURIE": "biotools:webpsn",
    "biotoolsID": "webpsn",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "fanelli@unimo.it",
            "name": "Francesca Fanelli",
            "orcidid": "https://orcid.org/0000-0002-7620-6895",
            "typeEntity": "Person"
        }
    ],
    "description": "a webserver to infer fingerprints of structural communication in biomacromolecules.\n\nwebPSN is a free web server for high throughput investigation of allosterism in biological systems, which employs a mixed Protein Structure Network (PSN) and Elastic Network Model-Normal Mode Analysis (ENM-NMA), i.e. PSN-ENM, strategy to investigate the structural communication in proteins and nucleic acids [1-7, 10] .",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Nucleic acid structure comparison",
                    "uri": "http://edamontology.org/operation_2518"
                },
                {
                    "term": "Information extraction",
                    "uri": "http://edamontology.org/operation_3907"
                },
                {
                    "term": "Scaffolding",
                    "uri": "http://edamontology.org/operation_3216"
                }
            ]
        }
    ],
    "homepage": "http://webpsn.hpc.unimore.it",
    "lastUpdate": "2021-03-14T10:59:30Z",
    "name": "webPSN",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.1093/NAR/GKAA397",
            "metadata": {
                "abstract": "© The Author(s) 2020. Published by Oxford University Press on behalf of Nucleic Acids Research.A mixed Protein Structure Network (PSN) and Elastic Network Model-Normal Mode Analysis (ENM-NMA)-based strategy (i.e. PSN-ENM) was developed to investigate structural communication in biomacromolecules. Protein Structure Graphs (PSGs) are computed on a single structure, whereas information on system dynamics is supplied by ENM-NMA. The approach was implemented in a webserver (webPSN), which was significantly updated herein. The webserver now handles both proteins and nucleic acids and relies on an internal upgradable database of network parameters for ions and small molecules in all PDB structures. Apart from the radical restyle of the server and some changes in the calculation setup, other major novelties concern the possibility to: a) compute the differences in nodes, links, and communication pathways between two structures (i.e. network difference) and b) infer links, hubs, communities, and metapaths from consensus networks computed on a number of structures. These new features are useful to identify commonalties and differences between two different functional states of the same system or structural-communication signatures in homologous or analogous systems. The output analysis relies on 3D-representations, interactive tables and graphs, also available for download. Speed and accuracy make this server suitable to comparatively investigate structural communication in large sets of bio-macromolecular systems. URL: http://webpsn.hpc.unimore.it.",
                "authors": [
                    {
                        "name": "Felline A."
                    },
                    {
                        "name": "Seeber M."
                    },
                    {
                        "name": "Fanelli F."
                    }
                ],
                "citationCount": 3,
                "date": "2021-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "webPSN v2.0: A webserver to infer fingerprints of structural communication in biomacromolecules"
            },
            "pmcid": "PMC7319592",
            "pmid": "32427333"
        }
    ],
    "topic": [
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Nucleic acids",
            "uri": "http://edamontology.org/topic_0077"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        },
        {
            "term": "Mathematics",
            "uri": "http://edamontology.org/topic_3315"
        },
        {
            "term": "Protein folding, stability and design",
            "uri": "http://edamontology.org/topic_0130"
        }
    ]
}