{
    "additionDate": "2021-01-18T08:00:35Z",
    "biotoolsCURIE": "biotools:scelvis",
    "biotoolsID": "scelvis",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "dieter.beule@bihealth.de",
            "name": "Dieter Beule",
            "typeEntity": "Person"
        }
    ],
    "description": "SCelVis: Easy Single-Cell Visualization is a tool exploratory single cell data analysis on the desktop and in the cloud.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "https://scelvis.readthedocs.io"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/bihealth/scelvis",
    "language": [
        "Python"
    ],
    "lastUpdate": "2021-02-11T17:44:00Z",
    "license": "MIT",
    "name": "SCelVis",
    "owner": "zsmag19",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8607",
            "metadata": {
                "abstract": "© 2020 PeerJ Inc.. All rights reserved.Background. Single cell omics technologies present unique opportunities for biomedical and life sciences from lab to clinic, but the high dimensional nature of such data poses challenges for computational analysis and interpretation. Furthermore, FAIR data management as well as data privacy and security become crucial when working with clinical data, especially in cross-institutional and translational settings. Existing solutions are either bound to the desktop of one researcher or come with dependencies on vendor-specific technology for cloud storage or user authentication. Results. To facilitate analysis and interpretation of single-cell data by users without bioinformatics expertise, we present SCelVis, a flexible, interactive and user-friendly app for web-based visualization of pre-processed single-cell data. Users can survey multiple interactive visualizations of their single cell expression data and cell annotation, define cell groups by filtering or manual selection and perform differential gene expression, and download raw or processed data for further offline analysis. SCelVis can be run both on the desktop and cloud systems, accepts input from local and various remote sources using standard and open protocols, and allows for hosting data in the cloud and locally. We test and validate our visualization using publicly available scRNAseq data. Methods. SCelVis is implemented in Python using Dash by Plotly. It is available as a standalone application as a Python package, via Conda/Bioconda and as a Docker image. All components are available as open source under the permissive MIT license and are based on open standards and interfaces, enabling further development and integration with third party pipelines and analysis components. The GitHub repository is https://github.com/bihealth/scelvis.",
                "authors": [
                    {
                        "name": "Beule D."
                    },
                    {
                        "name": "Holtgrewe M."
                    },
                    {
                        "name": "Messerschmidt C."
                    },
                    {
                        "name": "Nieminen M."
                    },
                    {
                        "name": "Obermayer B."
                    }
                ],
                "citationCount": 1,
                "date": "2020-02-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "SCelVis: Exploratory single cell data analysis on the desktop and in the cloud"
            },
            "pmcid": "PMC7035868",
            "pmid": "32117635"
        }
    ],
    "topic": [
        {
            "term": "Cell biology",
            "uri": "http://edamontology.org/topic_2229"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Protein expression",
            "uri": "http://edamontology.org/topic_0108"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        }
    ]
}
