{
    "accessibility": "Open access",
    "additionDate": "2019-08-09T13:08:57Z",
    "biotoolsCURIE": "biotools:SureTypeSC",
    "biotoolsID": "SureTypeSC",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "ivogel@sund.ku.dk",
            "name": "Ivan Vogel",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Random Forest and Gaussian Mixture predictor of high confidence genotypes in single cell data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/puko818/SureTypeSC/blob/master/README.md"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "homepage": "https://github.com/puko818/SureTypeSC",
    "language": [
        "Python"
    ],
    "lastUpdate": "2020-06-16T10:55:26Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/puko818/SureTypeSC/issues"
        }
    ],
    "maturity": "Mature",
    "name": "SureTypeSC",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "hans",
    "publication": [
        {
            "doi": "10.1093/BIOINFORMATICS/BTZ412",
            "metadata": {
                "abstract": "© 2019 The Author(s).Motivation: Accurate genotyping of DNA from a single cell is required for applications such as de novo mutation detection, linkage analysis and lineage tracing. However, achieving high precision genotyping in the single-cell environment is challenging due to the errors caused by whole-genome amplification. Two factors make genotyping from single cells using single nucleotide polymorphism (SNP) arrays challenging. The lack of a comprehensive single-cell dataset with a reference genotype and the absence of genotyping tools specifically designed to detect noise from the whole-genome amplification step. Algorithms designed for bulk DNA genotyping cause significant data loss when used for single-cell applications. Results: In this study, we have created a resource of 28.7 million SNPs, typed at high confidence from whole-genome amplified DNA from single cells using the Illumina SNP bead array technology. The resource is generated from 104 single cells from two cell lines that are available from the Coriell repository. We used mother-father-proband (trio) information from multiple technical replicates of bulk DNA to establish a high quality reference genotype for the two cell lines on the SNP array. This enabled us to develop SureTypeSC-a two-stage machine learning algorithm that filters a substantial part of the noise, thereby retaining the majority of the high quality SNPs. SureTypeSC also provides a simple statistical output to show the confidence of a particular single-cell genotype using Bayesian statistics. Availability and implementation: The implementation of SureTypeSC in Python and sample data are available in the GitHub repository: https://github.com/puko818/SureTypeSC Supplementary information: Supplementary data are available at Bioinformatics online.",
                "authors": [
                    {
                        "name": "Blanshard R.C."
                    },
                    {
                        "name": "Hoffmann E.R."
                    },
                    {
                        "name": "Vogel I."
                    }
                ],
                "citationCount": 1,
                "date": "2019-12-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "SureTypeSC-a Random Forest and Gaussian mixture predictor of high confidence genotypes in single-cell data"
            },
            "pmid": "31116387",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Script"
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        }
    ],
    "validated": 1
}
