{
    "additionDate": "2017-01-17T14:58:02Z",
    "biotoolsCURIE": "biotools:categorycompare",
    "biotoolsID": "categorycompare",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "rflight79@gmail.com",
            "name": "Robert M. Flight",
            "orcidid": "http://orcid.org/0000-0001-8141-7788",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Calculates significant annotations (categories) in each of two (or more) feature (i.e. gene) lists, determines the overlap between the annotations, and returns graphical and tabular data about the significant annotations and which combinations of feature lists the annotations were found to be significant. Interactive exploration is facilitated through the use of RCytoscape (heavily suggested).",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/categoryCompare.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/categoryCompare_1.18.0.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Gene expression data",
                        "uri": "http://edamontology.org/data_2603"
                    },
                    "format": [
                        {
                            "term": "Gene expression report format",
                            "uri": "http://edamontology.org/format_2058"
                        }
                    ]
                }
            ],
            "operation": [
                {
                    "term": "Statistical calculation",
                    "uri": "http://edamontology.org/operation_2238"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "P-value",
                        "uri": "http://edamontology.org/data_1669"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                },
                {
                    "data": {
                        "term": "Pathway or network",
                        "uri": "http://edamontology.org/data_2600"
                    },
                    "format": [
                        {
                            "term": "Image format",
                            "uri": "http://edamontology.org/format_3547"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/categoryCompare.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-01-10T05:26:48Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/rmflight/categoryCompare"
        }
    ],
    "name": "categoryCompare",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.3389/fgene.2014.00098",
            "metadata": {
                "abstract": "Assessment of high-throughput-omics data initially focuses on relative or raw levels of a particular feature, such as an expression value for a transcript, protein, or metabolite. At a second level, analyses of annotations including known or predicted functions and associations of each individual feature, attempt to distill biological context. Most currently available comparative- and meta-analyses methods are dependent on the availability of identical features across data sets, and concentrate on determining features that are differentially expressed across experiments, some of which may be considered \"biomarkers.\" The heterogeneity of measurement platforms and inherent variability of biological systems confounds the search for robust biomarkers indicative of a particular condition. In many instances, however, multiple data sets show involvement of common biological processes or signaling pathways, even though individual features are not commonly measured or differentially expressed between them. We developed a methodology, CATEGORYCOMPARE, for cross-platform and cross-sample comparison of high-throughput data at the annotation level. We assessed the utility of the approach using hypothetical data, as well as determining similarities and differences in the set of processes in two instances: (1) denervated skin vs. denervated muscle, and (2) colon from Crohn's disease vs. colon from ulcerative colitis (UC). The hypothetical data showed that in many cases comparing annotations gave superior results to comparing only at the gene level. Improved analytical results depended as well on the number of genes included in the annotation term, the amount of noise in relation to the number of genes expressing in unenriched annotation categories, and the specific method in which samples are combined. In the skin vs. muscle denervation comparison, the tissues demonstrated markedly different responses. The Crohn's vs. UC comparison showed gross similarities in inflammatory response in the two diseases, with particular processes specific to each disease. © 2014 Flight, Harrison, Mohammad, Bunge, Moon, Petruska and Rouchka.",
                "authors": [
                    {
                        "name": "Bunge M.B."
                    },
                    {
                        "name": "Flight R.M."
                    },
                    {
                        "name": "Harrison B.J."
                    },
                    {
                        "name": "Mohammad F."
                    },
                    {
                        "name": "Moon L.D.F."
                    },
                    {
                        "name": "Petruska J.C."
                    },
                    {
                        "name": "Rouchka E.C."
                    }
                ],
                "citationCount": 18,
                "date": "2014-01-01T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "Categorycompare, an analytical tool based on feature annotations"
            },
            "pmcid": "PMC4010757",
            "pmid": "24808906",
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        },
        {
            "term": "Molecular biology",
            "uri": "http://edamontology.org/topic_3047"
        }
    ],
    "validated": 1,
    "version": [
        "1.18.0"
    ]
}
