{
    "additionDate": "2018-08-29T12:31:06Z",
    "biotoolsCURIE": "biotools:chemalot",
    "biotoolsID": "chemalot",
    "credit": [
        {
            "email": "lee.man-ling@gene.com",
            "name": "Man-ling Lee",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "The package provides a comprehensive collection of tools for processing files with chemical structures and associated data.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "https://github.com/chemalot/chemalot/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Structure analysis",
                    "uri": "http://edamontology.org/operation_2480"
                }
            ]
        }
    ],
    "homepage": "https://github.com/chemalot/chemalot/",
    "language": [
        "Java",
        "Perl"
    ],
    "lastUpdate": "2018-12-10T12:59:01Z",
    "license": "GPL-3.0",
    "name": "chemalot",
    "operatingSystem": [
        "Linux",
        "Mac"
    ],
    "owner": "d.gabrielaitis",
    "publication": [
        {
            "doi": "10.1186/s13321-017-0228-9",
            "metadata": {
                "abstract": "© 2017 The Author(s).Background: Analyzing files containing chemical information is at the core of cheminformatics. Each analysis may require a unique workflow. This paper describes the chemalot and chemalot-knime open source packages. Chemalot is a set of command line programs with a wide range of functionalities for cheminformatics. The chemalot-knime package allows command line programs that read and write SD files from stdin and to stdout to be wrapped into KNIME nodes. The combination of chemalot and chemalot-knime not only facilitates the compilation and maintenance of sequences of command line programs but also allows KNIME workflows to take advantage of the compute power of a LINUX cluster. Results: Use of the command line programs is demonstrated in three different workflow examples: (1) A workflow to create a data file with project-relevant data for structure-activity or property analysis and other type of investigations, (2) The creation of a quantitative structure-property-relationship model using the command line programs via KNIME nodes, and (3) The analysis of strain energy in small molecule ligand conformations from the Protein Data Bank database. Conclusions: The chemalot and chemalot-knime packages provide lightweight and powerful tools for many tasks in cheminformatics. They are easily integrated with other open source and commercial command line tools and can be combined to build new and even more powerful tools. The chemalot-knime package facilitates the generation and maintenance of user-defined command line workflows, taking advantage of the graphical design capabilities in KNIME.[Figure not available: see fulltext.]",
                "authors": [
                    {
                        "name": "Aliagas I."
                    },
                    {
                        "name": "Feng J.A."
                    },
                    {
                        "name": "Gabriel T."
                    },
                    {
                        "name": "Gobbi A."
                    },
                    {
                        "name": "Lee M.-L."
                    },
                    {
                        "name": "O'Donnell T.J."
                    },
                    {
                        "name": "Sellers B.D."
                    },
                    {
                        "name": "Wiswedel B."
                    }
                ],
                "citationCount": 6,
                "date": "2017-06-12T00:00:00Z",
                "journal": "Journal of Cheminformatics",
                "title": "Chemalot and chemalot-knime: Command line programs as workflow tools for drug discovery"
            }
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Cheminformatics",
            "uri": "http://edamontology.org/topic_2258"
        },
        {
            "term": "Data management",
            "uri": "http://edamontology.org/topic_3071"
        },
        {
            "term": "Structure analysis",
            "uri": "http://edamontology.org/topic_0081"
        },
        {
            "term": "Synthetic chemistry",
            "uri": "http://edamontology.org/topic_3371"
        }
    ],
    "validated": 1
}
