{
    "additionDate": "2015-02-16T10:05:22Z",
    "biotoolsCURIE": "biotools:chooch",
    "biotoolsID": "chooch",
    "collectionID": [
        "Instruct CCP4",
        "Instruct"
    ],
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Instruct",
            "typeEntity": "Institute",
            "typeRole": [
                "Provider"
            ]
        },
        {
            "email": "ccisb@stfc.ac.uk",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "Analysis of X-ray fluorescence spectrum to yield curves for f' and f\", as well as energies for MAD and SAD experiments.",
    "editPermission": {
        "authors": [
            "ELIXIR-EE"
        ],
        "type": "group"
    },
    "function": [
        {
            "note": "A program that will automatically determine values of the anomalous scattering factors, f' and f'', directly from experimentally measured X-ray fluorescence data. It outputs the f' and f'' spectrum and the appropriate X-ray wavelengths to be used for MAD or SAD experiments.",
            "operation": [
                {
                    "term": "Spectral analysis",
                    "uri": "http://edamontology.org/operation_3214"
                }
            ]
        }
    ],
    "homepage": "http://www.gwyndafevans.co.uk/chooch.html",
    "homepage_status": 1,
    "lastUpdate": "2018-12-11T18:28:06Z",
    "name": "Chooch",
    "owner": "Instruct",
    "publication": [
        {
            "doi": "10.1107/s0021889800014655",
            "metadata": {
                "abstract": "A Fortran program CHOOCH, which derives experimental values of the anomalous-scattering factors f″ and f′ from X-ray fluorescence spectra, is described. The program assumes knowledge of theoretical values for the imaginary term, f″, of the anomalous-scattering factor away from the absorption edge to scale the experimental fluorescence spectrum and thus derive values of f″ near the absorption edge, where tabular data are inappropriate. The Kramers - Kronig relation is used to calculate the real part, f′, of the anomalous-scattering factor. The program aids the decision-making process in macro-molecular crystallographic experiments where optimal wavelength selection is required. Magnitudes of f′ and f″ at selected wavelengths can later be used as starting values for heavy-atom refinement with crystallographic phasing programs.",
                "authors": [
                    {
                        "name": "Evans G."
                    },
                    {
                        "name": "Pettifer R.F."
                    }
                ],
                "citationCount": 206,
                "date": "2001-02-24T00:00:00Z",
                "journal": "Journal of Applied Crystallography",
                "title": "CHOOCH: A program for deriving anomalous-scattering factors from X-ray fluorescence spectra"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Structural biology",
            "uri": "http://edamontology.org/topic_1317"
        }
    ],
    "validated": 1,
    "version": [
        "1"
    ]
}