{
    "additionDate": "2017-01-17T14:59:58Z",
    "biotoolsCURIE": "biotools:genogam",
    "biotoolsID": "genogam",
    "collectionID": [
        "BioConductor"
    ],
    "credit": [
        {
            "email": "georg.stricker@in.tum.de",
            "name": "Georg Stricker",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ]
        }
    ],
    "description": "This package allows statistical analysis of genome-wide data with smooth functions using generalized additive models based on the implementation from the R-package 'mgcv'. It provides methods for the statistical analysis of ChIP-Seq data including inference of protein occupancy, and pointwise and region-wise differential analysis. Scaling of generalized additive model fitting to whole chromosomes is achieved by parallelization over overlapping genomic intervals.",
    "documentation": [
        {
            "type": [
                "User manual"
            ],
            "url": "http://bioconductor.org/packages/release/bioc/html/GenoGAM.html"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "http://bioconductor/packages/release/bioc/src/contrib/GenoGAM_1.2.1.tar.gz"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Nucleic acid sequence analysis",
                    "uri": "http://edamontology.org/operation_2478"
                }
            ]
        }
    ],
    "homepage": "http://bioconductor.org/packages/release/bioc/html/GenoGAM.html",
    "language": [
        "R"
    ],
    "lastUpdate": "2018-12-10T12:58:54Z",
    "license": "GPL-2.0",
    "link": [
        {
            "type": [
                "Mirror"
            ],
            "url": "https://github.com/gstricker/GenoGAM"
        }
    ],
    "name": "GenoGAM",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "bioconductor_import",
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btx150",
            "metadata": {
                "abstract": "© The Author 2017. Published by Oxford University Press. All rights reserved.Motivation: Chromatin immunoprecipitation followed by deep sequencing (ChIP-Seq) is a widely used approach to study protein-DNA interactions. Often, the quantities of interest are the differential occupancies relative to controls, between genetic backgrounds, treatments, or combinations thereof. Current methods for differential occupancy of ChIP-Seq data rely however on binning or sliding window techniques, for which the choice of the window and bin sizes are subjective. Results: Here, we present GenoGAM (Genome-wide Generalized Additive Model), which brings the well-established and flexible generalized additive models framework to genomic applications using a data parallelism strategy. We model ChIP-Seq read count frequencies as products of smooth functions along chromosomes. Smoothing parameters are objectively estimated from the data by crossvalidation, eliminating ad hoc binning and windowing needed by current approaches. GenoGAM provides base-level and region-level significance testing for full factorial designs. Application to a ChIP-Seq dataset in yeast showed increased sensitivity over existing differential occupancy methods while controlling for type I error rate. By analyzing a set of DNA methylation data and illustrating an extension to a peak caller, we further demonstrate the potential of GenoGAM as a generic statistical modeling tool for genome-wide assays.",
                "authors": [
                    {
                        "name": "Stricker G."
                    },
                    {
                        "name": "Engelhardt A."
                    },
                    {
                        "name": "Schulz D."
                    },
                    {
                        "name": "Schmid M."
                    },
                    {
                        "name": "Tresch A."
                    },
                    {
                        "name": "Gagneur J."
                    }
                ],
                "citationCount": 5,
                "date": "2017-08-01T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "GenoGAM: Genome-wide generalized additive models for ChIP-Seq analysis"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool",
        "Library"
    ],
    "topic": [
        {
            "term": "ChIP-seq",
            "uri": "http://edamontology.org/topic_3169"
        }
    ],
    "validated": 1,
    "version": [
        "1.2.1"
    ]
}