{
    "additionDate": "2020-06-28T21:18:01Z",
    "biotoolsCURIE": "biotools:bedsect",
    "biotoolsID": "bedsect",
    "description": "An Integrated Web Server Application to Perform Intersection, Visualization, and Functional Annotation of Genomic Regions From Multiple Datasets",
    "editPermission": {
        "type": "private"
    },
    "homepage": "http://imgsb.org/bedsect/",
    "lastUpdate": "2020-06-28T21:18:01Z",
    "name": "BedSect",
    "owner": "arup",
    "publication": [
        {
            "doi": "10.3389/fgene.2020.00003",
            "metadata": {
                "abstract": "© Copyright © 2020 Mishra, Ghosh, Jha and Raghav.A large number of genomic regions, such as transcription factor binding sites (TFBSs) captured from next generation sequencing (NGS) data analyses or those available from the public resource database ENCODE, are generally overlapped to answer a variety of biological questions. Though several command-line tools are available to perform such an analysis, there is a notable lack of an integrated webserver application with which to identify genomic region intersections, generate publication-ready plots depicting subsets of the overlapped regions, and perform functional annotation. Thus, there is an ardent need for a comprehensive and user-friendly webserver application that allows the users to either upload multiple datasets or select from the integrated Gene Transcription Regulation Database (GTRD). We thus introduce BedSect (http://imgsb.org/bedsect/.), which not only fulfils the above criteria but also performs intersection analysis along with visualization of the intersection regions as an UpSet and correlation plot using the integrated Shiny application. Moreover, analyses, including functional annotation, gene ontology, and biological pathways enrichment for the identified unique and intersected genomic regions, can also be performed using the integrated GREAT tool. To view the genomic regions in the genome browser, the inbuilt hyperlink for UCSC can redirect the user to visualize the results as custom tracks.",
                "authors": [
                    {
                        "name": "Mishra G.P."
                    },
                    {
                        "name": "Ghosh A."
                    },
                    {
                        "name": "Jha A."
                    },
                    {
                        "name": "Raghav S.K."
                    }
                ],
                "date": "2020-02-05T00:00:00Z",
                "journal": "Frontiers in Genetics",
                "title": "BedSect: An Integrated Web Server Application to Perform Intersection, Visualization, and Functional Annotation of Genomic Regions From Multiple Datasets"
            },
            "pmid": "32117432"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}