{
    "accessibility": "Open access",
    "additionDate": "2022-01-28T15:19:48.451050Z",
    "biotoolsCURIE": "biotools:beem-static",
    "biotoolsID": "beem-static",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "cli40@mgh.harvard.edu",
            "name": "Chenhao Li",
            "orcidid": "https://orcid.org/0000-0003-1182-6804",
            "typeEntity": "Person"
        },
        {
            "email": "nagarajann@gis.a-star.edu.sg",
            "name": "Niranjan Nagarajan",
            "typeEntity": "Person"
        }
    ],
    "description": "BEEM-Static is an R package for learning directed microbial interactions from cross-sectional microbiome profiling data based on the generalized Lotka-Volterra model (gLVM).",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Ecological modelling",
                    "uri": "http://edamontology.org/operation_3946"
                },
                {
                    "term": "Filtering",
                    "uri": "http://edamontology.org/operation_3695"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                }
            ]
        }
    ],
    "homepage": "https://github.com/CSB5/BEEM-static",
    "language": [
        "R"
    ],
    "lastUpdate": "2022-01-28T15:19:48.453701Z",
    "license": "MIT",
    "name": "BEEM-Static",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PCBI.1009343",
            "metadata": {
                "abstract": "Copyright: © 2021 Li et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.The structure and function of diverse microbial communities is underpinned by ecological interactions that remain uncharacterized. With rapid adoption of next-generation sequencing for studying microbiomes, data-driven inference of microbial interactions based on abundance correlations is widely used, but with the drawback that ecological interpretations may not be possible. Leveraging cross-sectional microbiome datasets for unravelling ecological structure in a scalable manner thus remains an open problem. We present an expectation-maximization algorithm (BEEM-Static) that can be applied to cross-sectional datasets to infer interaction networks based on an ecological model (generalized Lotka-Volterra). The method exhibits robustness to violations in model assumptions by using statistical filters to identify and remove corresponding samples. Benchmarking against 10 state-of-the-art correlation based methods showed that BEEM-Static can infer presence and directionality of ecological interactions even with relative abundance data (AUC-ROC>0.85), a task that other methods struggle with (AUC-ROC<0.63). In addition, BEEM-Static can tolerate a high fraction of samples (up to 40%) being not at steady state or coming from an alternate model. Applying BEEM-Static to a large public dataset of human gut microbiomes (n = 4,617) identified multiple stable equilibria that better reflect ecological enterotypes with distinct carrying capacities and interactions for key species. Conclusion BEEM-Static provides new opportunities for mining ecologically interpretable interactions and systems insights from the growing corpus of microbiome data.",
                "authors": [
                    {
                        "name": "Av-Shalom T.V."
                    },
                    {
                        "name": "Chng K.R."
                    },
                    {
                        "name": "Kwah J.S."
                    },
                    {
                        "name": "Li C."
                    },
                    {
                        "name": "Nagarajan N."
                    },
                    {
                        "name": "Tan J.W.G."
                    }
                ],
                "date": "2021-09-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "BEEM-Static: Accurate inference of ecological interactions from cross-sectional microbiome data"
            },
            "pmcid": "PMC8452072",
            "pmid": "34495960"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Metagenomic sequencing",
            "uri": "http://edamontology.org/topic_3837"
        },
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        }
    ],
    "validated": 1
}
