{
    "accessibility": "Open access",
    "additionDate": "2022-01-01T18:55:18.011555Z",
    "biotoolsCURIE": "biotools:nelly",
    "biotoolsID": "nelly",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "Jens.Neu@yale.edu",
            "name": "Jens Neu",
            "orcidid": "https://orcid.org/0000-0002-1054-0444"
        },
        {
            "email": "uriel.tayvah@yale.edu",
            "name": "Uriel Tayvah",
            "orcidid": "https://orcid.org/0000-0002-2759-131X"
        },
        {
            "name": "Charles A. Schmuttenmaer",
            "orcidid": "https://orcid.org/0000-0001-9992-8578"
        },
        {
            "name": "Jacob A. Spies",
            "orcidid": "https://orcid.org/0000-0002-0148-4823"
        }
    ],
    "description": "A User-Friendly and Open-Source Implementation of Tree-Based Complex Refractive Index Analysis for Terahertz Spectroscopy.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Data retrieval",
                    "uri": "http://edamontology.org/operation_2422"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                }
            ]
        }
    ],
    "homepage": "https://github.com/YaleTHz/nelly",
    "language": [
        "MATLAB",
        "Python",
        "Shell"
    ],
    "lastUpdate": "2022-01-01T18:55:18.014864Z",
    "license": "Not licensed",
    "name": "Nelly",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Jennifer",
    "publication": [
        {
            "doi": "10.1021/ACS.ANALCHEM.1C02132",
            "metadata": {
                "abstract": "© 2021 American Chemical Society.Terahertz (THz) spectroscopy is a powerful tool for unambiguously extracting complex-valued material properties (e.g., refractive index, conductivity, etc.) from a wide range of samples, with applications ranging from materials science to biology. However, extracting complex refractive indices from THz time-domain spectroscopy data can prove challenging, especially for multilayer samples. These challenges arise from the large number of transmission-reflection paths the THz pulse can take through the sample layers, leading to unwieldy strings of Fresnel coefficients. This issue has often been addressed using various approximations. However, these approximations are only applicable to specific classes of samples and can give erroneous results when misapplied. An alternative to this approach is to programmatically model all possible paths through the sample. The many paths through the sample layers can be modeled as a tree that branches at every point where the paths diverge, i.e., whenever the pulse can either be transmitted or reflected. This tree can then be used to generate expressions relating the unknown refractive index to the observed time domain data. Here, we provide a freely available open-source package implementing this method as both a MATLAB library and a corresponding graphical user interface, which can also be run without a MATLAB license (https://github.com/YaleTHz/nelly). We have tested this method for a range of samples and compared the results to commonly used approximations to demonstrate its accuracy and wide applicability. Our method consistently gives better agreement than common approximations.",
                "authors": [
                    {
                        "name": "Neu J."
                    },
                    {
                        "name": "Schmuttenmaer C.A."
                    },
                    {
                        "name": "Spies J.A."
                    },
                    {
                        "name": "Tayvah U."
                    }
                ],
                "date": "2021-08-17T00:00:00Z",
                "journal": "Analytical Chemistry",
                "title": "Nelly: A User-Friendly and Open-Source Implementation of Tree-Based Complex Refractive Index Analysis for Terahertz Spectroscopy"
            },
            "pmid": "34355556"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "NMR",
            "uri": "http://edamontology.org/topic_0593"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}
