
{
    "credit": [
        {
            "email": "tyler.weirick@gmail.com",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://ugahash.uni-frankfurt.de/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://ugahash.uni-frankfurt.de/help/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "ID mapping",
                    "uri": "http://edamontology.org/operation_3282"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Genetics",
                "uri": "http://edamontology.org/topic_3053"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Data management",
                "uri": "http://edamontology.org/topic_3071"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/ugahash-an-algorithm-for-a-distributed-accession-system.html"
        }
    ],
    "publication": [
        {
            "abstract": "© 2016. Published by Oxford University Press.Maintaining the consistency of genomic annotations is an increasingly complex task because of the iterative and dynamic nature of assembly and annotation, growing numbers of biological databases and insufficient integration of annotations across databases. As information exchange among databases is poor, a 'novel' sequence from one reference annotation could be annotated in another. Furthermore, relationships to nearby or overlapping annotated transcripts are even more complicated when using different genome assemblies. To better understand these problems, we surveyed current and previous versions of genomic assemblies and annotations across a number of public databases containing long noncoding RNA. We identified numerous discrepancies of transcripts regarding their genomic locations, transcript lengths and identifiers. Further investigation showed that the positional differences between reference annotations of essentially the same transcript could lead to differences in its measured expression at the RNA level. To aid in resolving these problems, we present the algorithm 'Universal Genomic Accession Hash (UGAHash)' and created an open source web tool to encourage the usage of the UGAHash algorithm. The UGAHash web tool (http://ugahash.uni-frankfurt.de) can be accessed freely without registration. The web tool allows researchers to generate Universal Genomic Accessions for genomic features or to explore annotations deposited in the public databases of the past and present versions.We anticipate that the UGAHash web tool will be a valuable tool to check for the existence of transcripts before judging the newly discovered transcripts as novel.",
            "authors": [
                "Weirick T.",
                "John D.",
                "Uchida S."
            ],
            "cit_count": 3,
            "journal": "Briefings in Bioinformatics",
            "pmid": "26921280",
            "title": "Resolving the problem of multiple accessions of the same transcript deposited across various public databases",
            "year": "2017-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:ugahash",
        "biotoolsID": "ugahash",
        "description": "An algorithm designed to provide a distributed method for assigning accession numbers to genomic features. The website is designed to introduce the utility of the tool by providing resources for mapping human genomic features among various bioinformatic databases and versions of databases with a focus on lncRNAs.",
        "homepage": "http://ugahash.uni-frankfurt.de/",
        "name": "UGAHash"
    }
}