
{
    "credit": [
        {
            "email": "mzoppe@ifc.cnr.it",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www.scivis.ifc.cnr.it/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://www.bioblender.org/documentation/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Structure visualisation",
                    "uri": "http://edamontology.org/operation_0570"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "C++",
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Desktop application"
        ],
        "topic": [
            {
                "term": "Proteins",
                "uri": "http://edamontology.org/topic_0078"
            },
            {
                "term": "Molecular modelling",
                "uri": "http://edamontology.org/topic_2275"
            },
            {
                "term": "Protein structural motifs and surfaces",
                "uri": "http://edamontology.org/topic_0166"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/bioblender-0-6-software-built-open-source-3d-modeling-software-blender.html"
        }
    ],
    "publication": [
        {
            "abstract": "Background: In living cells, proteins are in continuous motion and interaction with the surrounding medium and/or other proteins and ligands. These interactions are mediated by protein features such as electrostatic and lipophilic potentials. The availability of protein structures enables the study of their surfaces and surface characteristics, based on atomic contribution. Traditionally, these properties are calculated by physico-chemical programs and visualized as range of colors that vary according to the tool used and imposes the necessity of a legend to decrypt it. The use of color to encode both characteristics makes the simultaneous visualization almost impossible, requiring these features to be visualized in different images. In this work, we describe a novel and intuitive code for the simultaneous visualization of these properties.Methods: Recent advances in 3D animation and rendering software have not yet been exploited for the representation of biomolecules in an intuitive, animated form. For our purpose we use Blender, an open-source, free, cross-platform application used professionally for 3D work.On the basis Blender, we developed BioBlender, dedicated to biological work: elaboration of protein motion with simultaneous visualization of their chemical and physical features.Electrostatic and lipophilic potentials are calculated using physico-chemical software and scripts, organized and accessed through BioBlender interface.Results: A new visual code is introduced for molecular lipophilic potential: a range of optical features going from smooth-shiny for hydrophobic regions to rough-dull for hydrophilic ones. Electrostatic potential is represented as animated line particles that flow along field lines, proportional to the total charge of the protein.Conclusions: Our system permits visualization of molecular features and, in the case of moving proteins, their continuous perception, calculated for each conformation during motion. Using real world tactile/sight feelings, the nanoscale world of proteins becomes more understandable, familiar to our everyday life, making it easier to introduce \"un-seen\" phenomena (concepts) such as hydropathy or charges. Moreover, this representation contributes to gain insight into molecular functions by drawing viewer's attention to the most active regions of the protein. The program, available for Windows, Linux and MacOS, can be downloaded freely from the dedicated website http://www.bioblender.eu. © 2012 Andrei et al.; licensee BioMed Central Ltd.",
            "authors": [
                "Andrei R.M.",
                "Callieri M.",
                "Zini M.F.",
                "Loni T.",
                "Maraziti G.",
                "Pan M.C.",
                "Zoppe M."
            ],
            "cit_count": 25,
            "journal": "BMC Bioinformatics",
            "pmid": "22536962",
            "title": "Intuitive representation of surface properties of biomolecules using BioBlender",
            "year": "2012-03-28"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bioblender",
        "biotoolsID": "bioblender",
        "description": "Open source viewer that includes features for morphing proteins and visualization of lipophilic and electrostatic potentials.",
        "homepage": "http://bioblender.eu/",
        "name": "BioBlender"
    }
}