
{
    "credit": [
        {
            "email": "yyoo@snu.ac.kr",
            "name": "Yun Joo Yoo",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        },
        {
            "email": "sunny03@snu.ac.kr",
            "name": "Sunah Kim",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "https://github.com/sunnyeesl/BigLD"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence feature detection",
                    "uri": "http://edamontology.org/operation_0253"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "license": "GPL-2.0",
        "operatingSystem": [
            "Linux",
            "Mac"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            },
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Genetic variation",
                "uri": "http://edamontology.org/topic_0199"
            },
            {
                "term": "DNA polymorphism",
                "uri": "http://edamontology.org/topic_2885"
            },
            {
                "term": "Data visualisation",
                "uri": "http://edamontology.org/topic_0092"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© The Author 2017. Motivation Linkage disequilibrium (LD) block construction is required for research in population genetics and genetic epidemiology, including specification of sets of single nucleotide polymorphisms (SNPs) for analysis of multi-SNP based association and identification of haplotype blocks in high density sequencing data. Existing methods based on a narrow sense definition do not allow intermediate regions of low LD between strongly associated SNP pairs and tend to split high density SNP data into small blocks having high between-block correlation. Results We present Big-LD, a block partition method based on interval graph modeling of LD bins which are clusters of strong pairwise LD SNPs, not necessarily physically consecutive. Big-LD uses an agglomerative approach that starts by identifying small communities of SNPs, i.e.The SNPs in each LD bin region, and proceeds by merging these communities. We determine the number of blocks using a method to find maximum-weight independent set. Big-LD produces larger LD blocks compared to existing methods such as MATILDE, Haploview, MIG ++, or S-MIG ++ and the LD blocks better agree with recombination hotspot locations determined by sperm-Typing experiments. The observed average runtime of Big-LD for 13 288 240 non-monomorphic SNPs from 1000 Genomes Project autosome data (286 East Asians) is about 5.83 h, which is a significant improvement over the existing methods.",
            "authors": [
                "Kim S.A.",
                "Cho C.-S.",
                "Kim S.-R.",
                "Bull S.B.",
                "Yoo Y.J."
            ],
            "cit_count": 0,
            "doi": "10.1093/bioinformatics/btx609",
            "journal": "Bioinformatics",
            "title": "A new haplotype block detection method for dense genome sequencing data based on interval graph modeling of clusters of highly correlated SNPs",
            "year": "2018-02-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:bigld",
        "biotoolsID": "bigld",
        "description": "Haplotype block detection method for dense genome sequencing data based on interval graph modeling of clusters of highly correlated SNPs.",
        "homepage": "https://github.com/sunnyeesl/BigLD",
        "name": "BigLD"
    }
}