{
    "additionDate": "2017-04-21T12:12:22Z",
    "biotoolsCURIE": "biotools:blocks_www_server",
    "biotoolsID": "blocks_www_server",
    "credit": [
        {
            "name": "Contact form",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://blocks.fhcrc.org/blocks-bin/contact.pl"
        }
    ],
    "description": "The Blocks WWW server provides tools to search DNA and protein queries against the Blocks database of multiple alignments, which represent conserved protein regions.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://blocks.fhcrc.org/blocks/help/tutorial/tutorial.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence alignment analysis (conservation)",
                    "uri": "http://edamontology.org/operation_0448"
                },
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                },
                {
                    "term": "Protein feature detection",
                    "uri": "http://edamontology.org/operation_3092"
                },
                {
                    "term": "Multiple sequence alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        }
    ],
    "homepage": "http://blocks.fhcrc.org/",
    "homepage_status": 1,
    "lastUpdate": "2018-12-10T12:58:56Z",
    "name": "Blocks WWW Server",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "ELIXIR-EE",
    "publication": [
        {
            "metadata": {
                "abstract": "Motivation: As databanks grow, sequence classification and prediction of function by searching protein family databases become increasingly valuable. The original Blocks Database, which contains ungapped multiple alignments for families documented in PROSITE, can be searched to classify new sequences. However, PROSITE is incomplete, and families from other databases are now available to expand coverage of the Blocks Database. Results: To take advantage of protein family information present in several existing complications, we have used five databases to construct Blocks+, a unified database that is built on the PROTOMAT/BLOSUM scoring model and that can be searched using a single algorithm for consistent sequences classification. The LAMA blocks-versus-blocks searching program identifies overlapping protein families, making possible a non-redundant hierarchical compilation. Blocks+ consists of all blocks derived from PROSITE, blocks from Prints not present in PROSITE, blocks from Pfam-A not present in PROSITE or Prints, and so on for ProDom and Domo, for a total of 1995 protein families represented by 8909 blocks, doubling the coverage of the original Blocks Database. A challenge for any procedure aimed at non-redundancy is to retain related but distinct families while discarding those that are duplicates. We illustrate how using multiple complications can minimize this potential problem by examining the SNF2 family of ATPases, which is detectably similar to distinct families of helicases and ATPases.",
                "authors": [
                    {
                        "name": "Henikoff S."
                    },
                    {
                        "name": "Henikoff J.G."
                    },
                    {
                        "name": "Pietrokovski S."
                    }
                ],
                "citationCount": 230,
                "date": "1999-08-11T00:00:00Z",
                "journal": "Bioinformatics",
                "title": "Blocks+: A non-redundant database of protein alignment blocks derived from multiple compilations"
            },
            "pmid": "10383472"
        },
        {
            "metadata": {
                "abstract": "The Blocks Database WWW (http://blocks.fhcrc.org) and Email (blocks@@@blocks.fhcrc.org) servers provide tools to search DNA and protein queries against the Blocks+ Database of multiple alignments, which represent conserved protein regions. Blocks+ nearly doubles the number of protein families included in the database by adding families from the Pfam-A, ProDom and Demo databases to those from PROSITE and PRINTS. Other new features include improved Block Searcher statistics, searching with NCBI's IMPALA program and 3D display of blocks on PDB structures.",
                "authors": [
                    {
                        "name": "Henikoff J.G."
                    },
                    {
                        "name": "Greene E.A."
                    },
                    {
                        "name": "Pietrokovski S."
                    },
                    {
                        "name": "Henikoff S."
                    }
                ],
                "citationCount": 263,
                "date": "2000-01-01T00:00:00Z",
                "journal": "Nucleic Acids Research",
                "title": "Increased coverage of protein families with the Blocks Database servers"
            },
            "pmid": "10592233"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Proteins",
            "uri": "http://edamontology.org/topic_0078"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        },
        {
            "term": "Structure prediction",
            "uri": "http://edamontology.org/topic_0082"
        }
    ],
    "validated": 1
}