{
    "additionDate": "2021-01-18T12:19:04Z",
    "biotoolsCURIE": "biotools:deepgoa",
    "biotoolsID": "deepgoa",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "guomaozu@bucea.edu.cn",
            "name": "Maozu Guo",
            "typeEntity": "Person"
        },
        {
            "email": "guoxian85@gmail.com",
            "name": "Guoxian Yu",
            "orcidid": "https://orcid.org/0000-0002-1667-6705",
            "typeEntity": "Person"
        }
    ],
    "description": "DeepGOA is a deep Graph Convolutional Network based model to predict GO annotations of proteins. DeepGOA firstly quantifies the correlations (or edges) between GO terms and updates the edge weights of the direct acyclic graph (DAG) by leveraging GO annotations and hierarchy, then learns the semantic representation and latent inter-relations of GO terms in the way by applying GCN on the updated DAG.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Protein function prediction",
                    "uri": "http://edamontology.org/operation_1777"
                },
                {
                    "term": "Variant effect prediction",
                    "uri": "http://edamontology.org/operation_0331"
                },
                {
                    "term": "Protein secondary structure prediction",
                    "uri": "http://edamontology.org/operation_0267"
                }
            ]
        }
    ],
    "homepage": "http://mlda.swu.edu.cn/codes.php?name=DeepGOA",
    "language": [
        "MATLAB",
        "Python"
    ],
    "lastUpdate": "2021-02-24T16:27:43Z",
    "name": "DeepGOA",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-020-03745-6",
            "metadata": {
                "abstract": "© 2020, The Author(s).Background: Maize (Zea mays ssp. mays L.) is the most widely grown and yield crop in the world, as well as an important model organism for fundamental research of the function of genes. The functions of Maize proteins are annotated using the Gene Ontology (GO), which has more than 40000 terms and organizes GO terms in a direct acyclic graph (DAG). It is a huge challenge to accurately annotate relevant GO terms to a Maize protein from such a large number of candidate GO terms. Some deep learning models have been proposed to predict the protein function, but the effectiveness of these approaches is unsatisfactory. One major reason is that they inadequately utilize the GO hierarchy. Results: To use the knowledge encoded in the GO hierarchy, we propose a deep Graph Convolutional Network (GCN) based model (DeepGOA) to predict GO annotations of proteins. DeepGOA firstly quantifies the correlations (or edges) between GO terms and updates the edge weights of the DAG by leveraging GO annotations and hierarchy, then learns the semantic representation and latent inter-relations of GO terms in the way by applying GCN on the updated DAG. Meanwhile, Convolutional Neural Network (CNN) is used to learn the feature representation of amino acid sequences with respect to the semantic representations. After that, DeepGOA computes the dot product of the two representations, which enable to train the whole network end-to-end coherently. Extensive experiments show that DeepGOA can effectively integrate GO structural information and amino acid information, and then annotates proteins accurately. Conclusions: Experiments on Maize PH207 inbred line and Human protein sequence dataset show that DeepGOA outperforms the state-of-the-art deep learning based methods. The ablation study proves that GCN can employ the knowledge of GO and boost the performance. Codes and datasets are available at http://mlda.swu.edu.cn/codes.php?name=DeepGOA.",
                "authors": [
                    {
                        "name": "Zhou G."
                    },
                    {
                        "name": "Wang J."
                    },
                    {
                        "name": "Zhang X."
                    },
                    {
                        "name": "Guo M."
                    },
                    {
                        "name": "Yu G."
                    }
                ],
                "citationCount": 2,
                "date": "2020-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Predicting functions of maize proteins using graph convolutional network"
            },
            "pmcid": "PMC7739465",
            "pmid": "33323113"
        }
    ],
    "toolType": [
        "Script"
    ],
    "topic": [
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}