{
    "additionDate": "2017-08-03T18:36:26Z",
    "biotoolsCURIE": "biotools:arboretum",
    "biotoolsID": "arboretum",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://pages.discovery.wisc.edu/~sroy/"
        }
    ],
    "description": "Scalable computational algorithm that integrates expression data from multiple species with species and gene phylogenies to infer modules of coexpressed genes in extant species and their evolutionary histories.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://pages.discovery.wisc.edu/~sroy/arboretum/index.html"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Phylogenetic tree analysis",
                    "uri": "http://edamontology.org/operation_0324"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        }
    ],
    "homepage": "http://pages.discovery.wisc.edu/~sroy/arboretum/",
    "lastUpdate": "2018-12-10T12:58:55Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/arboretum-reconstruction-and-analysis-of-evolutionary-history-of-condition-specific-transcriptional-modules.html"
        }
    ],
    "name": "Arboretum",
    "operatingSystem": [
        "Linux"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "Comparative functional genomics studies the evolution of biological processes by analyzing functional data, such as gene expression profiles, across species. A major challenge is to compare profiles collected in a complex phylogeny. Here, we present Arboretum, a novel scalable computational algorithm that integrates expression data from multiple species with species and gene phylogenies to infer modules of coexpressed genes in extant species and their evolutionary histories. We also develop new, generally applicable measures of conservation and divergence in gene regulatory modules to assess the impact of changes in gene content and expression on module evolution. We used Arboretum to study the evolution of the transcriptional response to heat shock in eight species of Ascomycota fungi and to reconstruct modules of the ancestral environmental stress response (ESR). We found substantial conservation in the stress response across species and in the reconstructed components of the ancestral ESR modules. The greatest divergence was in the most induced stress, primarily through module expansion. The divergence of the heat stress response exceeds that observed in the response to glucose depletion in the same species. Arboretum and its associated analyses provide a comprehensive framework to systematically study regulatory evolution of condition-specific responses. © 2013, Published by Cold Spring Harbor Laboratory Press.",
                "authors": [
                    {
                        "name": "Roy S."
                    },
                    {
                        "name": "Wapinski I."
                    },
                    {
                        "name": "Pfiffner J."
                    },
                    {
                        "name": "French C."
                    },
                    {
                        "name": "Socha A."
                    },
                    {
                        "name": "Konieczka J."
                    },
                    {
                        "name": "Habib N."
                    },
                    {
                        "name": "Kellis M."
                    },
                    {
                        "name": "Thompson D."
                    },
                    {
                        "name": "Regev A."
                    }
                ],
                "citationCount": 27,
                "date": "2013-06-01T00:00:00Z",
                "journal": "Genome Research",
                "title": "Arboretum: Reconstruction and analysis of the evolutionary history of condition-specific transcriptional modules"
            },
            "pmid": "23640720"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Genetics",
            "uri": "http://edamontology.org/topic_3053"
        },
        {
            "term": "Population genetics",
            "uri": "http://edamontology.org/topic_3056"
        },
        {
            "term": "DNA",
            "uri": "http://edamontology.org/topic_0654"
        }
    ],
    "validated": 1
}