
{
    "credit": [
        {
            "email": "techsupport@w-fusion.co.jp",
            "name": "Support",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "type": "General",
            "url": "http://www.lskb.w-fusionus.com/"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Sequence analysis",
                    "uri": "http://edamontology.org/operation_2403"
                },
                {
                    "term": "Pathway or network analysis",
                    "uri": "http://edamontology.org/operation_2497"
                },
                {
                    "term": "SNP detection",
                    "uri": "http://edamontology.org/operation_0484"
                }
            ]
        }
    ],
    "labels": {
        "maturity": "Mature",
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Database portal"
        ],
        "topic": [
            {
                "term": "Genomics",
                "uri": "http://edamontology.org/topic_0622"
            },
            {
                "term": "Workflows",
                "uri": "http://edamontology.org/topic_0769"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2015 Nishimura, Sasagawa, Ariyoshi, Ichikawa, Shimada, Kawaguchi, Kawase, Yamamoto, Uehara, Yanai, Takata and Tanaka. Both caloric restriction (CR) and resveratrol (RSV) have beneficial effects on obesity. However, the biochemical pathways that mediate these beneficial effects might be complex and interconnected and have not been fully elucidated. To reveal the common therapeutic mechanism of CR and RSV, we performed a comparative transcriptome analysis of adipose tissues from diet-induced obese (DIO) zebrafish and obese humans. We identified nine genes in DIO zebrafish and seven genes in obese humans whose expressions were regulated by CR and RSV. Although the gene lists did not overlap except for one gene, the gene ontologies enriched in the gene lists were highly overlapped, and included genes involved in adipocyte differentiation, lipid storage and lipid metabolism. Bioinformatic analysis of cis-regulatory sequences of these genes revealed that their transcriptional regulators also overlapped, including EP300, HDAC2, CEBPB, CEBPD, FOXA1, and FOXA2. We also identified 15 and 46 genes that were dysregulated in the adipose tissue of DIO zebrafish and obese humans, respectively. Bioinformatics analysis identified EP300, HDAC2, and CEBPB as common transcriptional regulators for these genes. EP300 is a histone and lysyl acetyltransferase that modulates the function of histone and various proteins including CEBPB, CEBPD, FOXA1, and FOXA2. We demonstrated that adiposity in larval zebrafish was significantly reduced by C646, an inhibitor of EP300 that antagonizes acetyl-CoA. The reduction of adiposity by C646 was not significantly different from that induced by RSV or co-treatment of C646 and RSV. These results indicate that the inhibition of EP300 might be a common therapeutic mechanism between CR and RSV in adipose tissues of obese individuals.",
            "authors": [
                "Nishimura Y.",
                "Sasagawa S.",
                "Ariyoshi M.",
                "Ichikawa S.",
                "Shimada Y.",
                "Kawaguchi K.",
                "Kawase R.",
                "Yamamoto R.",
                "Uehara T.",
                "Yanai T.",
                "Takata R.",
                "Tanaka T."
            ],
            "cit_count": 8,
            "doi": "10.3389/fphar.2015.00199",
            "journal": "Frontiers in Pharmacology",
            "title": "Systems pharmacology of adiposity reveals inhibition of EP300 as a common therapeutic mechanism of caloric restriction and resveratrol for α obesity",
            "type": "Other",
            "year": "2015-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:lskb",
        "biotoolsID": "lskb",
        "description": "Comprehensive drug discovery and genomic research workbench, knowledgebase and data management system.",
        "homepage": "http://www.lskb.w-fusionus.com",
        "name": "Life Science Knowledge Bank (LSKB)"
    }
}