{
    "additionDate": "2021-01-18T07:32:00Z",
    "biotoolsCURIE": "biotools:meteolakes",
    "biotoolsID": "meteolakes",
    "confidence_flag": "tool",
    "description": "An operational online three-dimensional forecasting platform for lake hydrodynamics.\n\nThe online platform for monitoring and forecasting the bio-physical state of Swiss lakes.\n\nThis product is developed, managed and maintained by Theo Baracchini and part of his PhD thesis. The application shares with the public some results of 3D hydrodynamic-biological simulations performed daily with the Delft3D modelling framework on a compute server. Additionally, it displays measurements from a field station with data connexion and remote sensing images downloaded from satellites in real-time.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Modelling and simulation",
                    "uri": "http://edamontology.org/operation_2426"
                }
            ]
        }
    ],
    "homepage": "http://meteolakes.ch",
    "lastUpdate": "2021-02-22T08:17:27Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://meteolakes.ch/#!/data"
        }
    ],
    "name": "Meteolakes",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1016/J.WATRES.2020.115529",
            "metadata": {
                "abstract": "© 2020 The AuthorsEnvironmental management depends on high-quality monitoring and its meaningful interpretation. The combination of local weather dynamics, regional anthropogenic stresses and global environmental changes make the evaluation of monitoring information in dynamic freshwater systems a challenging task. While the lake ecosystems gather many complex biogeochemical interactions, they remain constrained by the same physical environment of mixing and transport. It is therefore crucial to obtain high-quality physical system insight. Three-dimensional hydrodynamic models are perfectly suited for providing such information. However, these models are complex to implement, and their use is often limited to modellers. Here, we aim to provide model output via a user-friendly platform to a broad audience ranging from scientists to public and governmental stakeholders. We present a unified approach merging the apparently diverse interests through meteolakes.ch, an online platform openly disseminating lake observations and three-dimensional numerical simulations in near real-time with short-term forecasts and data assimilation. Meteolakes is scalable to a broad range of devices, modular and distributed, hence allowing its expansion to other regions and hardware infrastructures. Since 2016, the platform has continuously provided timely synoptic lake information to more than 250,000 users. This web-based system was built not only to provide guidance to scientists in the design and analysis of field experiments and to foster interdisciplinary lake studies, but also to assist governmental agencies and professionals in the long-term policy and planning of water resources management. Finally, our system aimed at promoting awareness and understanding of the complexity of lakes and providing information to the public through user-friendly interfaces. This article details the design and operation of such a platform and its products. Applications are demonstrated by examples of a recent upwelling and a storm event. Both cases illustrate how Meteolakes help scientists in their quest for process understanding as well as water professionals and civil society in providing specific warnings.",
                "authors": [
                    {
                        "name": "Baracchini T."
                    },
                    {
                        "name": "Wuest A."
                    },
                    {
                        "name": "Bouffard D."
                    }
                ],
                "citationCount": 4,
                "date": "2020-04-01T00:00:00Z",
                "journal": "Water Research",
                "title": "Meteolakes: An operational online three-dimensional forecasting platform for lake hydrodynamics"
            },
            "pmid": "32006775"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "Biophysics",
            "uri": "http://edamontology.org/topic_3306"
        },
        {
            "term": "Imaging",
            "uri": "http://edamontology.org/topic_3382"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}