{
    "additionDate": "2017-08-03T18:50:06Z",
    "biotoolsCURIE": "biotools:mrprimerw",
    "biotoolsID": "mrprimerw",
    "credit": [
        {
            "email": "meinjwsh@dgist.ac.kr",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://infolab.dgist.ac.kr/"
        }
    ],
    "description": "Server that performs complete homology testing, supports batch design of primers for multi-target qPCR experiments, and ranks the resulting primers to return the top-1 best primers to the user.",
    "documentation": [
        {
            "type": [
                "General"
            ],
            "url": "http://mrprimerw.com/"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "http://mrprimerw.com/",
    "language": [
        "Java"
    ],
    "lastUpdate": "2018-12-10T12:58:49Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/mrprimerw-search-valid-primers-for-multiple-targets-of-qpcr-experiments-without-matching-off-targets.html"
        }
    ],
    "name": "MRPrimerW",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "metadata": {
                "abstract": "© The Author(s) 2016. Published by Oxford University Press on behalf of Nucleic Acids Research.Design of high-quality primers for multiple target sequences is essential for qPCR experiments, but is challenging due to the need to consider both homology tests on off-target sequences and the same stringent filtering constraints on the primers. Existing web servers for primer design have major drawbacks, including requiring the use of BLAST-like tools for homology tests, lack of support for ranking of primers, TaqMan probes and simultaneous design of primers against multiple targets. Due to the large-scale computational overhead, the few web servers supporting homology tests use heuristic approaches or perform homology tests within a limited scope. Here, we describe the MRPrimerW, which performs complete homology testing, supports batch design of primers for multi-target qPCR experiments, supports design of TaqMan probes and ranks the resulting primers to return the top-1 best primers to the user. To ensure high accuracy, we adopted the core algorithm of a previously reported MapReduce-based method, MRPrimer, but completely redesigned it to allow users to receive query results quickly in a web interface, without requiring a MapReduce cluster or a long computation. MRPrimerW provides primer design services and a complete set of 341 963 135 in silico validated primers covering 99% of human and mouse genes. Free access: http://MRPrimerW.com.",
                "authors": [
                    {
                        "name": "An K."
                    },
                    {
                        "name": "Kang N."
                    },
                    {
                        "name": "Kim H."
                    },
                    {
                        "name": "Kim M.-S."
                    },
                    {
                        "name": "Koo J."
                    }
                ],
                "citationCount": 9,
                "date": "2016-07-08T00:00:00Z",
                "journal": "Nucleic acids research",
                "title": "MRPrimerW: a tool for rapid design of valid high-quality primers for multiple target qPCR experiments"
            },
            "pmid": "27154272"
        }
    ],
    "toolType": [
        "Web application"
    ],
    "topic": [
        {
            "term": "PCR experiment",
            "uri": "http://edamontology.org/topic_3519"
        },
        {
            "term": "Probes and primers",
            "uri": "http://edamontology.org/topic_0632"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        }
    ],
    "validated": 1
}
