{
    "additionDate": "2017-12-18T00:09:14Z",
    "biotoolsCURIE": "biotools:matt",
    "biotoolsID": "matt",
    "credit": [
        {
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://people.csail.mit.edu/bab/"
        }
    ],
    "description": "Matt (Multiple Alignment with Translations and Twists), an aligned fragment pair chaining algorithm that, in intermediate steps, allows local flexibility between fragments: small translations and rotations are temporarily allowed to bring sets of aligned fragments closer, even if they are physically impossible under rigid body transformations.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Multiple alignment",
                    "uri": "http://edamontology.org/operation_0492"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Structure alignment",
                    "uri": "http://edamontology.org/operation_0295"
                }
            ]
        }
    ],
    "homepage": "http://matt.cs.tufts.edu/",
    "lastUpdate": "2018-12-10T12:58:57Z",
    "link": [
        {
            "type": [
                "Software catalogue"
            ],
            "url": "http://www.mybiosoftware.com/matt-1-0-multiple-protein-structure-alignment-program.html"
        }
    ],
    "name": "Matt",
    "operatingSystem": [
        "Linux",
        "Windows",
        "Mac"
    ],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": "10.1371/journal.pcbi.0040010",
            "metadata": {
                "abstract": "Even when there is agreement on what measure a protein multiple structure alignment should be optimizing, finding the optimal alignment is computationally prohibitive. One approach used by many previous methods is aligned fragment pair chaining, where short structural fragments from all the proteins are aligned against each other optimally, and the final alignment chains these together in geometrically consistent ways. Ye and Godzik have recently suggested that adding geometric flexibility may help better model protein structures in a variety of contexts. We introduce the program Matt (Multiple Alignment with Translations and Twists), an aligned fragment pair chaining algorithm that, in intermediate steps, allows local flexibility between fragments: small translations and rotations are temporarily allowed to bring sets of aligned fragments closer, even if they are physically impossible under rigid body transformations. After a dynamic programming assembly guided by these \"bent\" alignments, geometric consistency is restored in the final step before the alignment is output. Matt is tested against other recent multiple protein structure alignment programs on the popular Homstrad and SABmark benchmark datasets. Matt's global performance is competitive with the other programs on Homstrad, but outperforms the other programs on SABmark, a benchmark of multiple structure alignments of proteins with more distant homology. On both datasets, Matt demonstrates an ability to better align the ends of α-helices and β-strands, an important characteristic of any structure alignment program intended to help construct a structural template library for threading approaches to the inverse protein-folding problem. The related question of whether Matt alignments can be used to distinguish distantly homologous structure pairs from pairs of proteins that are not homologous is also considered. For this purpose, a p-value score based on the length of the common core and average root mean squared deviation (RMSD) of Matt alignments is shown to largely separate decoys from homologous protein structures in the SABmark benchmark dataset. We postulate that Matt's strong performance comes from its ability to model proteins in different conformational states and, perhaps even more important, its ability to model backbone distortions in more distantly related proteins. © 2008 Menke et al.",
                "authors": [
                    {
                        "name": "Menke M."
                    },
                    {
                        "name": "Berger B."
                    },
                    {
                        "name": "Cowen L."
                    }
                ],
                "citationCount": 162,
                "date": "2008-01-01T00:00:00Z",
                "journal": "PLoS Computational Biology",
                "title": "Matt: Local flexibility aids protein multiple structure alignment"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Protein structure",
            "uri": "http://edamontology.org/topic_2814"
        }
    ],
    "validated": 1,
    "version": [
        "1.0"
    ]
}