{
    "additionDate": "2021-12-13T13:09:48.429392Z",
    "biotoolsCURIE": "biotools:vdptools",
    "biotoolsID": "vdptools",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "maizezhao@126.com",
            "name": "Jiuran Zhao",
            "typeEntity": "Person"
        },
        {
            "name": "Fengge Wang",
            "typeEntity": "Person"
        }
    ],
    "description": "Variety discrimination power (VDP) is an Appraisal Index for Loci Combinations Screening Applied in Plant Variety Discrimination. VDP refers to the overall capability of a certain loci combination to distinguish all given varieties calculated by certain statistic method, based on the fact that the genotype of a loci combination can be used to identify a certain variety of plant.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Phasing",
                    "uri": "http://edamontology.org/operation_3454"
                },
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://github.com/caurwx1/VDPtools",
    "language": [
        "C#"
    ],
    "lastUpdate": "2021-12-13T13:10:09.821003Z",
    "license": "MIT",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/caurwx1/VDPtools/issues"
        }
    ],
    "name": "VDPtools",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.3389/FPLS.2021.566796",
            "metadata": {
                "abstract": "© Copyright © 2021 Yang, Tian, Wang, Wang, Yi, Liu, Xu, Fan, Zhao and Wang.Molecular marker technology is used widely in plant variety discrimination, molecular breeding, and other fields. To lower the cost of testing and improve the efficiency of data analysis, molecular marker screening is very important. Screening usually involves two phases: the first to control loci quality and the second to reduce loci quantity. To reduce loci quantity, an appraisal index that is very sensitive to a specific scenario is necessary to select loci combinations. In this study, we focused on loci combination screening for plant variety discrimination. A loci combination appraisal index, variety discrimination power (VDP), is proposed, and three statistical methods, probability-based VDP (P-VDP), comparison-based VDP (C-VDP), and ratio-based VDP (R-VDP), are described and compared. The results using the simulated data showed that VDP was sensitive to statistical populations with convergence toward the same variety, and the total probability of discrimination power (TDP) method was effective only for partial populations. R-VDP was more sensitive to statistical populations with convergence toward various varieties than P-VDP and C-VDP, which both had the same sensitivity; TDP was not sensitive at all. With the real data, R-VDP values for sorghum, wheat, maize and rice data begin to show downward tendency when the number of loci is 20, 7, 100, 100 respectively, while in the case of P-VDP and C-VDP (which have the same results), the number is 6, 4, 9, 19 respectively and in the case of TDP, the number is 6, 4, 4, 11 respectively. For the variety threshold setting, R-VDP values of loci combinations with different numbers of loci responded evenly to different thresholds. C-VDP values responded unevenly to different thresholds, and the extent of the response increased as the number of loci decreased. All the methods gave underestimations when data were missing, with systematic errors for TDP, C-VDP, and R-VDP going from smallest to biggest. We concluded that VDP was a better loci combination appraisal index than TDP for plant variety discrimination and the three VDP methods have different applications. We developed the software called VDPtools, which can calculate the values of TDP, P-VDP, C-VDP, and R-VDP. VDPtools is publicly available at https://github.com/caurwx1/VDPtools.git.",
                "authors": [
                    {
                        "name": "Fan Y."
                    },
                    {
                        "name": "Liu Y."
                    },
                    {
                        "name": "Tian H."
                    },
                    {
                        "name": "Wang F."
                    },
                    {
                        "name": "Wang L."
                    },
                    {
                        "name": "Wang R."
                    },
                    {
                        "name": "Xu L."
                    },
                    {
                        "name": "Yang Y."
                    },
                    {
                        "name": "Yi H."
                    },
                    {
                        "name": "Zhao J."
                    }
                ],
                "citationCount": 1,
                "date": "2021-03-18T00:00:00Z",
                "journal": "Frontiers in Plant Science",
                "title": "Variety Discrimination Power: An Appraisal Index for Loci Combination Screening Applied to Plant Variety Discrimination"
            },
            "pmcid": "PMC8014032",
            "pmid": "33815430"
        }
    ],
    "topic": [
        {
            "term": "Agricultural science",
            "uri": "http://edamontology.org/topic_3810"
        },
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
