{
    "accessibility": [],
    "additionDate": "2017-08-03T19:03:23Z",
    "biotoolsCURIE": "biotools:transcriptator",
    "biotoolsID": "transcriptator",
    "collectionID": [],
    "confidence_flag": null,
    "cost": null,
    "credit": [
        {
            "email": "labgtp@na.icar.cnr.it",
            "gridid": null,
            "name": null,
            "note": null,
            "orcidid": null,
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "http://www-labgtp.na.icar.cnr.it/"
        }
    ],
    "description": "A computational pipeline to functionally annotate differentially expressed transcripts and carry out GO enrichment analysis of expression profiles, under the different treatment condition for organisms, which lacks the referenced genome.",
    "documentation": [
        {
            "note": null,
            "type": "User manual",
            "url": "http://www-labgtp.na.icar.cnr.it/Transcriptator/index.zul;jsessionid=4F807A4D916228613A4CD06C5AA095ED"
        }
    ],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "private"
    },
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Sequence annotation",
                    "uri": "http://edamontology.org/operation_0361"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ],
            "output": []
        }
    ],
    "homepage": "http://www-labgtp.na.icar.cnr.it/Transcriptator/",
    "homepage_status": 0,
    "language": [
        "R",
        "Python"
    ],
    "lastUpdate": "2018-12-10T12:58:51Z",
    "license": null,
    "link": [
        {
            "note": null,
            "type": "Software catalogue",
            "url": "http://www.mybiosoftware.com/transcriptator-annotate-transcripts-and-assembled-reads-from-rna-seq-data.html"
        }
    ],
    "maturity": null,
    "name": "Transcriptator",
    "operatingSystem": [
        "Linux"
    ],
    "otherID": [],
    "owner": "mbs_import",
    "publication": [
        {
            "doi": null,
            "metadata": {
                "abstract": "© 2015 Tripathi et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.RNA-seq is a new tool to measure RNA transcript counts, using high-throughput sequencing at an extraordinary accuracy. It provides quantitative means to explore the transcriptome of an organism of interest. However, interpreting this extremely large data into biological knowledge is a problem, and biologist-friendly tools are lacking. In our lab, we developed Transcriptator, a web application based on a computational Python pipeline with a user-friendly Java interface. This pipeline uses the web services available for BLAST (Basis Local Search Alignment Tool), QuickGO and DAVID (Database for Annotation, Visualization and Integrated Discovery) tools. It offers a report on statistical analysis of functional and Gene Ontology (GO) annotation's enrichment. It helps users to identify enriched biological themes, particularly GO terms, pathways, domains, gene/proteins features and protein-protein interactions related informations. It clusters the transcripts based on functional annotations and generates a tabular report for functional and gene ontology annotations for each submitted transcript to the web server. The implementation of QuickGo web-services in our pipeline enable the users to carry out GO-Slim analysis, whereas the integration of PORTRAIT (Prediction of transcriptomic non coding RNA (ncRNA) by ab initio methods) helps to identify the non coding RNAs and their regulatory role in transcriptome. In summary, Transcriptator is a useful software for both NGS and array data. It helps the users to characterize the de-novo assembled reads, obtained from NGS experiments for non-referenced organisms, while it also performs the functional enrichment analysis of differentially expressed transcripts/genes for both RNA-seq and micro-array experiments. It generates easy to read tables and interactive charts for better understanding of the data. The pipeline is modular in nature, and provides an opportunity to add new plugins in the future. Web application is freely available at: http://www-labgtp.na.icar.cnr.it/Transcriptator.",
                "authors": [
                    {
                        "name": "Tripathi K.P."
                    },
                    {
                        "name": "Evangelista D."
                    },
                    {
                        "name": "Zuccaro A."
                    },
                    {
                        "name": "Guarracino M.R."
                    }
                ],
                "citationCount": 10,
                "date": "2015-11-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "Transcriptator: An automated computational pipeline to annotate assembled reads and identify non coding RNA"
            },
            "note": null,
            "pmcid": null,
            "pmid": "26581084",
            "type": null,
            "version": null
        }
    ],
    "relation": [],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Data submission, annotation and curation",
            "uri": "http://edamontology.org/topic_0219"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "RNA",
            "uri": "http://edamontology.org/topic_0099"
        },
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        },
        {
            "term": "Data visualisation",
            "uri": "http://edamontology.org/topic_0092"
        }
    ],
    "validated": 1,
    "version": []
}