
{
    "credit": [
        {
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://www2.cmbi.ru.nl/"
        }
    ],
    "documentation": [
        {
            "type": "GENERAL",
            "url": "http://weget.cmbi.umcn.nl/about"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Gene expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                }
            ]
        },
        {
            "operation": [
                {
                    "term": "Query and retrieval",
                    "uri": "http://edamontology.org/operation_0224"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "Python"
        ],
        "operatingSystem": [
            "Linux",
            "Windows",
            "Mac"
        ],
        "toolType": [
            "Web application"
        ],
        "topic": [
            {
                "term": "Gene expression",
                "uri": "http://edamontology.org/topic_0203"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/weget-weighted-gene-coexpression-tool.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author(s) 2015. We have developed the Weighted Gene Expression Tool and database (WeGET, http://weget.cmbi.umcn. nl) for the prediction of new genes of a molecular system by correlated gene expression. WeGET utilizes a compendium of 465 human and 560 murine gene expression datasets that have been collected from multiple tissues under a wide range of experimental conditions. It exploits this abundance of expression data by assigning a high weight to datasets in which the known genes of a molecular system are harmoniously up- and down-regulated. WeGET ranks new candidate genes by calculating their weighted coexpression with that system. A weighted rank is calculated for human genes and their mouse orthologs. Then, an integrated gene rank and p-value is computed using a rank-order statistic. We applied our method to predict novel genes that have a high degree of co-expression with Gene Ontology terms and pathways from KEGG and Reactome. For each query set we provide a list of predicted novel genes, computed weights for transcription datasets used and cell and tissue types that contributed to the final predictions. The performance for each query set is assessed by 10-fold cross-validation. Finally, users can use the WeGET to predict novel genes that coexpress with a custom query set.",
            "authors": [
                "Szklarczyk R.",
                "Megchelenbrink W.",
                "Cizek P.",
                "Ledent M.",
                "Velemans G.",
                "Szklarczyk D.",
                "Huynen M.A."
            ],
            "cit_count": 5,
            "journal": "Nucleic Acids Research",
            "pmid": "26582928",
            "title": "WeGET: Predicting new genes for molecular systems by weighted co-expression",
            "year": "2016-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:weget",
        "biotoolsID": "weget",
        "description": "WeGET is a computational tool to find mammalian genes that strongly co-express with a human query gene set of interest.",
        "homepage": "http://weget.cmbi.umcn.nl/",
        "name": "WeGet"
    }
}