{"credit":[{"email":"hlin@uestc.edu.cn","name":"Hao Lin","typeEntity":"Person","typeRoles":["Primary contact"],"url":"http://lin.uestc.edu.cn/"}],"documentation":[{"type":"GENERAL","url":"http://lin.uestc.edu.cn/server/MycoMem/readme"}],"function":[{"operation":[{"term":"Transmembrane protein prediction","uri":"http://edamontology.org/operation_0269"}]}],"labels":{"operatingSystem":["Linux","Windows","Mac"],"toolType":["Web application"],"topic":[{"term":"Proteins","uri":"http://edamontology.org/topic_0078"},{"term":"Membrane and lipoproteins","uri":"http://edamontology.org/topic_0820"},{"term":"Microbiology","uri":"http://edamontology.org/topic_3301"}]},"link":[{"type":"SOFTWARE_CATALOGUE","url":"http://www.mybiosoftware.com/mycomemsvm-identification-of-mycobacterial-membrane-proteins.html"}],"publication":[{"abstract":"Mycobacterium can cause many serious diseases, such as tuberculosis and leprosy. Its membrane proteins play a critical role for multidrug-resistance and its tenacious survival ability. Knowing the types of membrane proteins will provide novel insights into understanding their functions and facilitate drug target discovery. In this study, a novel method was developed for predicting mycobacterial membrane protein and their types by using over-represented tripeptides. A total of 295 non-membrane proteins and 274 membrane proteins were collected to evaluate the performance of proposed method. The results of jackknife cross-validation test show that our method achieves an overall accuracy of 93.0% in discriminating between mycobacterial membrane proteins and mycobacterial non-membrane proteins and an overall accuracy of 93.1% in classifying mycobacterial membrane protein types. By comparing with other methods, the proposed method showed excellent predictive performance. Based on the proposed method, we built a predictor, called MycoMemSVM, which is freely available at http://lin.uestc.edu.cn/server/MycoMemSVM. It is anticipated that MycoMemSVM will become a useful tool for the annotation of mycobacterial membrane proteins and the development of anti-mycobacterium drug design. © 2012 Elsevier B.V.","authors":["Ding C.","Yuan L.-F.","Guo S.-H.","Lin H.","Chen W."],"cit_count":63,"journal":"Journal of Proteomics","pmid":"23000219","title":"Identification of mycobacterial membrane proteins and their types using over-represented tripeptide compositions","year":"2012-11-08"}],"summary":{"biotoolsCURIE":"biotools:mycomemsvm","biotoolsID":"mycomemsvm","description":"A sequence-based predictor for identifying mycobacterial membrane proteins and their types.","homepage":"http://lin.uestc.edu.cn/server/MycoMemSVM","name":"MycoMemSVM"}}