{
    "accessibility": "Open access",
    "additionDate": "2023-09-15T17:12:12.195120Z",
    "biotoolsCURIE": "biotools:phylobone",
    "biotoolsID": "phylobone",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "email": "miho.nakamura@utu.fi",
            "name": "Pere Puigbò",
            "typeEntity": "Person"
        },
        {
            "email": "pepuav@utu.fi",
            "name": "Miho Nakamura",
            "typeEntity": "Person"
        },
        {
            "name": "Margalida Fontcuberta-Rigo",
            "typeEntity": "Person"
        }
    ],
    "description": "A comprehensive database of bone extracellular matrix proteins in human and model organisms.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Deposition",
                    "uri": "http://edamontology.org/operation_3431"
                },
                {
                    "term": "Network analysis",
                    "uri": "http://edamontology.org/operation_3927"
                },
                {
                    "term": "Phylogenetic inference",
                    "uri": "http://edamontology.org/operation_0323"
                }
            ]
        }
    ],
    "homepage": "https://phylobone.com",
    "lastUpdate": "2023-09-15T17:12:12.197690Z",
    "license": "CC-BY-4.0",
    "name": "Phylobone",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1038/s41413-023-00281-w",
            "metadata": {
                "abstract": "The bone extracellular matrix (ECM) contains minerals deposited on highly crosslinked collagen fibrils and hundreds of non-collagenous proteins. Some of these proteins are key to the regulation of bone formation and regeneration via signaling pathways, and play important regulatory and structural roles. However, the complete list of bone extracellular matrix proteins, their roles, and the extent of individual and cross-species variations have not been fully captured in both humans and model organisms. Here, we introduce the most comprehensive resource of bone extracellular matrix (ECM) proteins that can be used in research fields such as bone regeneration, osteoporosis, and mechanobiology. The Phylobone database (available at https://phylobone.com) includes 255 proteins potentially expressed in the bone extracellular matrix (ECM) of humans and 30 species of vertebrates. A bioinformatics pipeline was used to identify the evolutionary relationships of bone ECM proteins. The analysis facilitated the identification of potential model organisms to study the molecular mechanisms of bone regeneration. A network analysis showed high connectivity of bone ECM proteins. A total of 214 functional protein domains were identified, including collagen and the domains involved in bone formation and resorption. Information from public drug repositories was used to identify potential repurposing of existing drugs. The Phylobone database provides a platform to study bone regeneration and osteoporosis in light of (biological) evolution, and will substantially contribute to the identification of molecular mechanisms and drug targets.",
                "authors": [
                    {
                        "name": "Fontcuberta-Rigo M."
                    },
                    {
                        "name": "Nakamura M."
                    },
                    {
                        "name": "Puigbo P."
                    }
                ],
                "date": "2023-12-01T00:00:00Z",
                "journal": "Bone Research",
                "title": "Phylobone: a comprehensive database of bone extracellular matrix proteins in human and model organisms"
            },
            "pmcid": "PMC10425349",
            "pmid": "37580331"
        }
    ],
    "toolType": [
        "Database portal"
    ],
    "topic": [
        {
            "term": "Model organisms",
            "uri": "http://edamontology.org/topic_0621"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        },
        {
            "term": "Proteomics",
            "uri": "http://edamontology.org/topic_0121"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
