{
    "additionDate": "2021-03-19T09:18:09Z",
    "biotoolsCURIE": "biotools:betweennet",
    "biotoolsID": "betweennet",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "hilal.kazan@antalya.edu.tr",
            "name": "Hilal Kazan",
            "orcidid": "https://orcid.org/0000-0003-2461-4579",
            "typeEntity": "Person"
        }
    ],
    "description": "BetweenNet is a computational approach that integrates genomic data with a protein-protein interaction network to identify cancer driver genes. BetweenNet utilizes a measure based on betweenness centrality on patient specific networks to identify the so-called outlier genes that correspond to dysregulated genes for each patient. Setting up the relationship between the mutated genes and the outliers through a bipartite graph, it employs a random-walk process on the graph, which provides the final prioritization of the mutated genes.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Gene prediction",
                    "uri": "http://edamontology.org/operation_2454"
                }
            ]
        }
    ],
    "homepage": "https://github.com/abu-compbio/BetweenNET",
    "language": [
        "Python",
        "C++"
    ],
    "lastUpdate": "2021-03-19T18:14:03Z",
    "name": "BetweenNet",
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1186/S12859-021-03989-W",
            "metadata": {
                "abstract": "© 2021, The Author(s).Background: Recent cancer genomic studies have generated detailed molecular data on a large number of cancer patients. A key remaining problem in cancer genomics is the identification of driver genes. Results: We propose BetweenNet, a computational approach that integrates genomic data with a protein-protein interaction network to identify cancer driver genes. BetweenNet utilizes a measure based on betweenness centrality on patient specific networks to identify the so-called outlier genes that correspond to dysregulated genes for each patient. Setting up the relationship between the mutated genes and the outliers through a bipartite graph, it employs a random-walk process on the graph, which provides the final prioritization of the mutated genes. We compare BetweenNet against state-of-the art cancer gene prioritization methods on lung, breast, and pan-cancer datasets. Conclusions: Our evaluations show that BetweenNet is better at recovering known cancer genes based on multiple reference databases. Additionally, we show that the GO terms and the reference pathways enriched in BetweenNet ranked genes and those that are enriched in known cancer genes overlap significantly when compared to the overlaps achieved by the rankings of the alternative methods.",
                "authors": [
                    {
                        "name": "Erten C."
                    },
                    {
                        "name": "Houdjedj A."
                    },
                    {
                        "name": "Kazan H."
                    }
                ],
                "date": "2021-12-01T00:00:00Z",
                "journal": "BMC Bioinformatics",
                "title": "Ranking cancer drivers via betweenness-based outlier detection and random walks"
            },
            "pmcid": "PMC7877041",
            "pmid": "33568049"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Genetic variation",
            "uri": "http://edamontology.org/topic_0199"
        }
    ]
}