
{
    "credit": [
        {
            "email": "amos.tanay@weizmann.ac.il",
            "name": "A. Tanay",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://drive.google.com/file/d/0B_P8lz5bDkf1RU9NbXFmanI4Mkk/view?usp=sharing"
        },
        {
            "type": "GENERAL",
            "url": "https://drive.google.com/file/d/10aF9Q09sT9Mb2IMROK4qGcDyXJ6Vxtkk/view"
        }
    ],
    "download": [
        {
            "type": "Source code",
            "url": "https://drive.google.com/file/d/0B_P8lz5bDkf1eVpXMUplR1Vyb3c/view?usp=sharing"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Primer removal",
                    "uri": "http://edamontology.org/operation_3237"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Sorting",
                    "uri": "http://edamontology.org/operation_3802"
                }
            ]
        }
    ],
    "labels": {
        "accessibility": [
            "Open access"
        ],
        "cost": "Free of charge",
        "language": [
            "R",
            "Perl"
        ],
        "license": "Unlicense",
        "maturity": "Mature",
        "operatingSystem": [
            "Linux"
        ],
        "toolType": [
            "Script"
        ],
        "topic": [
            {
                "term": "RNA-seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Transcriptomics",
                "uri": "http://edamontology.org/topic_3308"
            },
            {
                "term": "Probes and primers",
                "uri": "http://edamontology.org/topic_0632"
            }
        ]
    },
    "publication": [
        {
            "abstract": "© 2019, The Author(s), under exclusive licence to Springer Nature Limited.Human tissues comprise trillions of cells that populate a complex space of molecular phenotypes and functions and that vary in abundance by 4–9 orders of magnitude. Relying solely on unbiased sampling to characterize cellular niches becomes infeasible, as the marginal utility of collecting more cells diminishes quickly. Furthermore, in many clinical samples, the relevant cell types are scarce and efficient processing is critical. We developed an integrated pipeline for index sorting and massively parallel single-cell RNA sequencing (MARS-seq2.0) that builds on our previously published MARS-seq approach. MARS-seq2.0 is based on >1 million cells sequenced with this pipeline and allows identification of unique cell types across different tissues and diseases, as well as unique model systems and organisms. Here, we present a detailed step-by-step procedure for applying the method. In the improved procedure, we combine sub-microliter reaction volumes, optimization of enzymatic mixtures and an enhanced analytical pipeline to substantially lower the cost, improve reproducibility and reduce well-to-well contamination. Data analysis combines multiple layers of quality assessment and error detection and correction, graphically presenting key statistics for library complexity, noise distribution and sequencing saturation. Importantly, our combined FACS and single-cell RNA sequencing (scRNA-seq) workflow enables intuitive approaches for depletion or enrichment of cell populations in a data-driven manner that is essential to efficient sampling of complex tissues. The experimental protocol, from cell sorting to a ready-to-sequence library, takes 2–3 d. Sequencing and processing the data through the analytical pipeline take another 1–2 d.",
            "authors": [
                "Keren-Shaul H.",
                "Kenigsberg E.",
                "Jaitin D.A.",
                "David E.",
                "Paul F.",
                "Tanay A.",
                "Amit I."
            ],
            "cit_count": 0,
            "doi": "10.1038/s41596-019-0164-4",
            "journal": "Nature Protocols",
            "pmid": "31101904",
            "title": "MARS-seq2.0: an experimental and analytical pipeline for indexed sorting combined with single-cell RNA sequencing",
            "type": "Primary",
            "year": "2019-06-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:MARS-seq2.0",
        "biotoolsID": "MARS-seq2.0",
        "description": "Experimental and analytical pipeline for indexed sorting combined with single-cell RNA sequencing.",
        "homepage": "http://compgenomics.weizmann.ac.il/tanay/?page_id=672",
        "name": "MARS-seq2.0"
    }
}