{
    "additionDate": "2021-01-18T12:32:32Z",
    "biotoolsCURIE": "biotools:htrack",
    "biotoolsID": "htrack",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "DRodriguezVargas@cdc.gov",
            "name": "Dania M. Rodríguez ,",
            "typeEntity": "Person"
        }
    ],
    "description": "A new tool to facilitate public health field visits and electronic data capture.\n\nHTrack (Household Tracking) is an application built in R-Shiny for use on encrypted Android devices. This app was created to allow for offline data collection in studies where stringent data-security requirements must be met (see https://doi.org/10.1371/journal.pone.0244028), though it can also be run online if needed. The application allows for field navigation and secure field-level data capture. It also serves as a bridge to an alternate software, like EpiInfo, to collect participant-level questionnaire data. This repository houses:.",
    "editPermission": {
        "type": "private"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Editing",
                    "uri": "http://edamontology.org/operation_3096"
                }
            ]
        }
    ],
    "homepage": "https://github.com/dmrodz/htrack",
    "language": [
        "R"
    ],
    "lastUpdate": "2021-02-01T08:44:46Z",
    "name": "HTrack",
    "owner": "Niclaskn",
    "publication": [
        {
            "doi": "10.1371/JOURNAL.PONE.0244028",
            "metadata": {
                "abstract": "© 2020 Public Library of Science. All rights reserved.Many applications have been developed for electronic data collection. However, offline field navigation tools incorporating secure electronic data capture and field visit tracking are currently scarce. We created an R-Shiny application, HTrack (Household Tracking), for use on encrypted Android devices in the field. The application was implemented in the Communities Organized to Prevent Arboviruses (COPA) project, a study beginning in 2018 to better understand arboviral disease incidence in 38 communities in Puerto Rico. The application was used to navigate to randomly selected structures and capture visit outcomes after conducting multiple visits for participant recruitment. It also served as a bridge to an alternate software, Epi Info, to collect participant-level questionnaire data. This application successfully captured each visit outcome and improved the logistics of field level activities for the COPA project, eliminating the use of paper maps for navigation. We show the development of HTrack and comment on the limitations and strengths of this application and further improvements.",
                "authors": [
                    {
                        "name": "Adams L."
                    },
                    {
                        "name": "Paz-Bailey G."
                    },
                    {
                        "name": "Rivera-Amill V."
                    },
                    {
                        "name": "Rodriguez D.M."
                    },
                    {
                        "name": "Ryff K."
                    },
                    {
                        "name": "Sanchez-Gonzalez L."
                    }
                ],
                "date": "2020-12-01T00:00:00Z",
                "journal": "PLoS ONE",
                "title": "HTrack: A new tool to facilitate public health field visits and electronic data capture"
            },
            "pmid": "33320896"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Data security",
            "uri": "http://edamontology.org/topic_3263"
        },
        {
            "term": "Mapping",
            "uri": "http://edamontology.org/topic_0102"
        },
        {
            "term": "Public health and epidemiology",
            "uri": "http://edamontology.org/topic_3305"
        },
        {
            "term": "Software engineering",
            "uri": "http://edamontology.org/topic_3372"
        }
    ]
}
