{
    "name": "MassSpecWavelet", 
    "description": "Processing Mass Spectrometry spectrum by using wavelet based algorithm.", 
    "homepage": "http://bioconductor.org/packages/release/bioc/html/MassSpecWavelet.html", 
    "biotoolsID": "massspecwavelet", 
    "biotoolsCURIE": "biotools:massspecwavelet", 
    "version": [
        "1.40.0"
    ], 
    "otherID": [], 
    "relation": [], 
    "function": [
        {
            "operation": [
                {
                    "uri": "http://edamontology.org/operation_3214", 
                    "term": "Spectral analysis"
                }
            ], 
            "input": [], 
            "output": [], 
            "note": null, 
            "cmd": null
        }
    ], 
    "toolType": [
        "Command-line tool", 
        "Library"
    ], 
    "topic": [
        {
            "uri": "http://edamontology.org/topic_3520", 
            "term": "Proteomics experiment"
        }, 
        {
            "uri": "http://edamontology.org/topic_0121", 
            "term": "Proteomics"
        }, 
        {
            "uri": "http://edamontology.org/topic_0154", 
            "term": "Small molecules"
        }
    ], 
    "operatingSystem": [
        "Linux", 
        "Windows", 
        "Mac"
    ], 
    "language": [
        "R"
    ], 
    "license": "GPL-2.0", 
    "collectionID": [
        "Proteomics", 
        "BioConductor"
    ], 
    "maturity": null, 
    "cost": null, 
    "accessibility": [], 
    "elixirPlatform": [], 
    "elixirNode": [], 
    "link": [], 
    "download": [
        {
            "url": "http://bioconductor/packages/release/bioc/src/contrib/MassSpecWavelet_1.40.0.tar.gz", 
            "type": "Source code", 
            "note": null, 
            "version": null
        }
    ], 
    "documentation": [
        {
            "url": "http://bioconductor.org/packages/release/bioc/html/MassSpecWavelet.html", 
            "type": "Manual", 
            "note": null
        }
    ], 
    "publication": [
        {
            "doi": "10.1093/bioinformatics/btl355", 
            "pmid": "16820428", 
            "pmcid": null, 
            "type": "Primary", 
            "version": null, 
            "metadata": {
                "title": "Improved peak detection in mass spectrum by incorporating continuous wavelet transform-based pattern matching", 
                "abstract": "Motivation: A major problem for current peak detection algorithms is that noise in mass spectrometry (MS) spectra gives rise to a high rate of false positives. The false positive rate is especially problematic in detecting peaks with low amplitudes. Usually, various baseline correction algorithms and smoothing methods are applied before attempting peak detection. This approach is very sensitive to the amount of smoothing and aggressiveness of the baseline correction, which contribute to making peak detection results inconsistent between runs, instrumentation and analysis methods. Results: Most peak detection algorithms simply identify peaks based on amplitude, ignoring the additional information present in the shape of the peaks in a spectrum. In our experience, 'true' peaks have characteristic shapes, and providing a shape-matching function that provides a 'goodness of fit' coefficient should provide a more robust peak identification method. Based on these observations, a continuous wavelet transform (CWT)-based peak detection algorithm has been devised that identifies peaks with different scales and amplitudes. By transforming the spectrum into wavelet space, the pattern-matching problem is simplified and in addition provides a powerful technique for identifying and separating the signal from the spike noise and colored noise. This transformation, with the additional information provided by the 2D CWT coefficients can greatly enhance the effective signal-to-noise ratio. Furthermore, with this technique no baseline removal or peak smoothing preprocessing steps are required before peak detection, and this improves the robustness of peak detection under a variety of conditions. The algorithm was evaluated with SELDI-TOF spectra with known polypeptide positions. Comparisons with two other popular algorithms were performed. The results show the CWT-based algorithm can identify both strong and weak peaks while keeping false positive rate low. © 2006 Oxford University Press.", 
                "date": "2006-09-01T00:00:00Z", 
                "citationCount": 353, 
                "authors": [
                    {
                        "name": "Du P."
                    }, 
                    {
                        "name": "Kibbe W.A."
                    }, 
                    {
                        "name": "Lin S.M."
                    }
                ], 
                "journal": "Bioinformatics"
            }
        }
    ], 
    "credit": [
        {
            "name": "Pan Du", 
            "email": "dupan.mail@gmail.com", 
            "url": null, 
            "orcidid": null, 
            "typeEntity": "Person", 
            "typeRole": [
                "Primary contact"
            ], 
            "note": null
        }
    ], 
    "owner": "bioconductor_import", 
    "additionDate": "2017-01-17T15:04:46Z", 
    "lastUpdate": "2019-03-26T08:23:00Z", 
    "editPermission": {
        "type": "group", 
        "authors": [
            "proteomics.bio.tools"
        ]
    }, 
    "validated": 0, 
    "homepage_status": 0, 
    "elixir_badge": 0
}