{
    "accessibility": "Open access (with restrictions)",
    "additionDate": "2021-05-05T10:54:24Z",
    "biotoolsCURIE": "biotools:brain-extraction-ct-cta-images",
    "biotoolsID": "brain-extraction-ct-cta-images",
    "collectionID": [
        "File Exchange",
        "MATLAB"
    ],
    "cost": "Free of charge (with restrictions)",
    "credit": [
        {
            "email": "qiu.wu.ch@gmail.com",
            "name": "Wu Qiu",
            "typeEntity": "Person",
            "typeRole": [
                "Primary contact"
            ],
            "url": "https://www.mathworks.com/matlabcentral/profile/9946107-wu-qiu"
        }
    ],
    "description": "Extract brain from  CT and CTA images",
    "download": [
        {
            "type": "Screenshot",
            "url": "https://www.mathworks.com//matlabcentral/images/default_screenshot.jpg"
        }
    ],
    "editPermission": {
        "type": "private"
    },
    "homepage": "https://www.mathworks.com/matlabcentral/fileexchange/71935-brain-extraction-from-ct-and-cta-images",
    "language": [
        "MATLAB"
    ],
    "lastUpdate": "2021-05-14T13:41:04Z",
    "link": [
        {
            "type": [
                "Issue tracker"
            ],
            "url": "https://github.com/WuChanada/StripSkullCT/issues"
        },
        {
            "type": [
                "Repository"
            ],
            "url": "https://github.com/WuChanada/StripSkullCT"
        }
    ],
    "name": "Brain extraction from CT and CTA images",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Kigaard",
    "publication": [
        {
            "doi": "10.1016/j.cmpb.2019.04.030",
            "metadata": {
                "abstract": "© 2019 Elsevier B.V.Background and objective: Non-Contrast Computer Tomography (NCCT) and CT angiography (CTA) are the most used and widely acceptable imaging modalities in clinical practice for the diagnosis and treatment of acute ischemic stroke (AIS) patients. Brain extraction of CT/CTA images plays an essential role in stroke imaging research. There is no robust automated brain extraction method in the literature that is well established for both NCCT and CTA images. Thus, a validated and automated brain extraction tool for CT imaging would be of great value for both research and clinical practice. Methods: The proposed brain extraction method is based on the contour evolution technique, which extracts brain tissues from acquired NCCT and CTA images in a slice-by-slice fashion. Specifically, the proposed approach makes use of a novel propagation framework, which is initialized by a localized slice with the largest brain section in axial views, followed by a geodesic level-set evolution for automatically extracting the brain section in each slice. In particular, the segmented contour propagated from the previous slice is reused to penalize the defined object function for contour evolution to enforce the shape continuity between any two adjacent contours. We show that the defined contour evolution function can be solved iteratively by globally optimal convex optimization. Results: The proposed brain extraction approach is quantitatively evaluated using 40 NCCT and CTA images acquired from 20 AIS patients and drawn from 4 different vendors, compared to manual segmentations using Dice and Jaccard coefficient metrics. The quantitative results show that the proposed segmentation algorithm is consistently accurate for both NCCT and CTA images using Dice metric. The proposed method is further validated on 1736 NCCT and CTA images of 1331 AIS patients acquired from three multi-national multi-centric clinical trials. A visual check performed on these data demonstrates a low failure rate of 0.4% for 1331 NCCT images and a zero-failure rate for 405 CTA images. Conclusions: Both quantitative and qualitative evaluation suggest that the proposed brain extraction approach for NCCT and CTA images can be used for different clinical imaging settings, thus serving to improve current image analysis in the field of neuroimaging.",
                "authors": [
                    {
                        "name": "Demchuk A."
                    },
                    {
                        "name": "Federico A."
                    },
                    {
                        "name": "Goyal M."
                    },
                    {
                        "name": "Hill M.D."
                    },
                    {
                        "name": "Jogiat U."
                    },
                    {
                        "name": "Kuang H."
                    },
                    {
                        "name": "Menon B.K."
                    },
                    {
                        "name": "Najm M."
                    },
                    {
                        "name": "Qiu W."
                    }
                ],
                "citationCount": 5,
                "date": "2019-07-01T00:00:00Z",
                "journal": "Computer Methods and Programs in Biomedicine",
                "title": "Automated brain extraction from head CT and CTA images using convex optimization with shape propagation"
            },
            "type": [
                "Primary"
            ]
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Biology",
            "uri": "http://edamontology.org/topic_3070"
        },
        {
            "term": "Biomedical science",
            "uri": "http://edamontology.org/topic_3344"
        },
        {
            "term": "Tomography",
            "uri": "http://edamontology.org/topic_3452"
        }
    ],
    "version": [
        "1.0.0"
    ]
}
