
{
    "credit": [
        {
            "email": "Baheti.saurabh@mayo.edu",
            "name": "Saurabh Baheti",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ],
            "url": "http://bioinformaticstools.mayo.edu/research/rvboost/"
        },
        {
            "email": "Wang.Chen@mayo.edu",
            "name": "Chen Wang",
            "typeEntity": "Person",
            "typeRoles": [
                "Primary contact"
            ]
        }
    ],
    "documentation": [
        {
            "url": "https://s3-us-west-2.amazonaws.com/mayo-bic-tools/rvboost/RVboost_UserManualv0.1.pdf"
        }
    ],
    "function": [
        {
            "operation": [
                {
                    "term": "Variant prioritisation",
                    "uri": "http://edamontology.org/operation_3226"
                }
            ]
        }
    ],
    "labels": {
        "language": [
            "R"
        ],
        "operatingSystem": [
            "Linux",
            "Windows"
        ],
        "toolType": [
            "Command-line tool"
        ],
        "topic": [
            {
                "term": "RNA",
                "uri": "http://edamontology.org/topic_0099"
            },
            {
                "term": "RNA-Seq",
                "uri": "http://edamontology.org/topic_3170"
            },
            {
                "term": "Sequencing",
                "uri": "http://edamontology.org/topic_3168"
            }
        ]
    },
    "link": [
        {
            "type": "SOFTWARE_CATALOGUE",
            "url": "http://www.mybiosoftware.com/rvboost-0-1-rna-seq-variant-prioritization-approach-for-illumina-next-generation-sequencing-data.html"
        }
    ],
    "publication": [
        {
            "abstract": "© The Author 2014. Published by Oxford University Press. Motivation: RNA-seq has become the method of choice to quantify genes and exons, discover novel transcripts and detect fusion genes. However, reliable variant identification from RNA-seq data remains challenging because of the complexities of the transcriptome, the challenges of accurately mapping exon boundary spanning reads and the bias introduced during the sequencing library preparation. Method: We developed RVboost, a novel method specific for RNA variant prioritization. RVboost uses several attributes unique in the process of RNA library preparation, sequencing and RNA-seq data analyses. It uses a boosting method to train a model of 'good quality' variants using common variants from HapMap, and prioritizes and calls the RNA variants based on the trained model. We packaged RVboost in a comprehensive workflow, which integrates tools of variant calling, annotation and filtering. Results: RVboost consistently outperforms the variant quality score recalibration from the Genome Analysis Tool Kit and the RNA-seq variant-calling pipeline SNPiR in 12 RNA-seq samples using ground-truth variants from paired exome sequencing data. Several RNAseq- specific attributes were identified as critical to differentiate true and false variants, including the distance of the variant positions to exon boundaries, and the percent of the reads supporting the variant in the first six base pairs. The latter identifies false variants introduced by the random hexamer priming during the library construction.",
            "authors": [
                "Wang C.",
                "Davila J.I.",
                "Baheti S.",
                "Bhagwate A.V.",
                "Wang X.",
                "Kocher J.-P.A.",
                "Slager S.L.",
                "Feldman A.L.",
                "Novak A.J.",
                "Cerhan J.R.",
                "Thompson E.A.",
                "Asmann Y.W."
            ],
            "cit_count": 12,
            "journal": "Bioinformatics",
            "pmid": "25170027",
            "title": "RVboost: RNA-seq variants prioritization using a boosting method",
            "year": "2014-01-01"
        }
    ],
    "summary": {
        "biotoolsCURIE": "biotools:rvboost",
        "biotoolsID": "rvboost",
        "description": "RNA-seq variant prioritization approach for Illumina next-generation sequencing data.",
        "homepage": "http://bioinformaticstools.mayo.edu/research/rvboost/",
        "name": "RVboost"
    }
}