{
    "additionDate": "2019-11-14T20:08:33Z",
    "biotoolsCURIE": "biotools:NMA",
    "biotoolsID": "NMA",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "jacob.bauer@savba.sk",
            "name": "Jacob A. Bauer",
            "orcidid": "https://orcid.org/0000-0002-1396-1340",
            "typeEntity": "Person"
        }
    ],
    "description": "Normal Mode Analysis as a Routine Part of a Structural Investigation | Webtool for Normal Mode Analysis | Web-server for Normal Mode Analysis of proteins | Are you submitting large files to WEBnma? Provide your email address in the submission box above and we will send you a link that you can visit to inspect your results when they are ready. Alternatively, you can bookmark the URL appearing in your web browser once you have submitted your job. The results can be accessed at this URL within two weeks of your submission date",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Essential dynamics",
                    "uri": "http://edamontology.org/operation_3891"
                },
                {
                    "term": "Principal component visualisation",
                    "uri": "http://edamontology.org/operation_2939"
                },
                {
                    "term": "Molecular dynamics",
                    "uri": "http://edamontology.org/operation_2476"
                }
            ]
        }
    ],
    "homepage": "http://apps.cbu.uib.no/webnma/home",
    "lastUpdate": "2021-01-04T08:30:55Z",
    "name": "NMA",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/MOLECULES24183293",
            "metadata": {
                "abstract": "© 2019 by the authors.Normal mode analysis (NMA) is a technique that can be used to describe the flexible states accessible to a protein about an equilibrium position. These states have been shown repeatedly to have functional significance. NMA is probably the least computationally expensive method for studying the dynamics of macromolecules, and advances in computer technology and algorithms for calculating normal modes over the last 20 years have made it nearly trivial for all but the largest systems. Despite this, it is still uncommon for NMA to be used as a component of the analysis of a structural study. In this review, we will describe NMA, outline its advantages and limitations, explain what can and cannot be learned from it, and address some criticisms and concerns that have been voiced about it. We will then review the most commonly used techniques for reducing the computational cost of this method and identify the web services making use of these methods. We will illustrate several of their possible uses with recent examples from the literature. We conclude by recommending that NMA become one of the standard tools employed in any structural study.",
                "authors": [
                    {
                        "name": "Bauer J.A."
                    },
                    {
                        "name": "Pavlovic J."
                    },
                    {
                        "name": "Bauerova-Hlinkova V."
                    }
                ],
                "citationCount": 7,
                "date": "2019-09-10T00:00:00Z",
                "journal": "Molecules",
                "title": "Normal mode analysis as a routine part of a structural investigation"
            },
            "pmcid": "PMC6767145",
            "pmid": "31510014"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "X-ray diffraction",
            "uri": "http://edamontology.org/topic_2828"
        },
        {
            "term": "Molecular dynamics",
            "uri": "http://edamontology.org/topic_0176"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ],
    "validated": 1
}