{
    "additionDate": "2023-03-09T14:34:19.665404Z",
    "biotoolsCURIE": "biotools:complet_plus",
    "biotoolsID": "complet_plus",
    "confidence_flag": "tool",
    "credit": [
        {
            "email": "empr3ss@gmail.com",
            "name": "Gail L. Rosen",
            "typeEntity": "Person"
        }
    ],
    "description": "A computationally scalable method to improve completeness of large-scale protein sequence clustering.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Database search",
                    "uri": "http://edamontology.org/operation_2421"
                },
                {
                    "term": "Sequence clustering",
                    "uri": "http://edamontology.org/operation_0291"
                },
                {
                    "term": "Structure clustering",
                    "uri": "http://edamontology.org/operation_2844"
                }
            ]
        }
    ],
    "homepage": "https://github.com/EESI/Complet-Plus",
    "language": [
        "Python",
        "Shell"
    ],
    "lastUpdate": "2024-11-24T14:55:29.230887Z",
    "license": "Not licensed",
    "name": "Complet_plus",
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.7717/peerj.14779",
            "metadata": {
                "abstract": "A major challenge for clustering algorithms is to balance the trade-off between homogeneity, i.e., the degree to which an individual cluster includes only related sequences, and completeness, the degree to which related sequences are broken up into multiple clusters. Most algorithms are conservative in grouping sequences with other sequences. Remote homologs may fail to be clustered together and instead form unnecessarily distinct clusters. The resulting clusters have high homogeneity but completeness that is too low. We propose Complet+, a computationally scalable post-processing method to increase the completeness of clusters without an undue cost in homogeneity. Complet+ proves to effectively merge closely-related clusters of protein that have verified structural relationships in the SCOPe classification scheme, improving the completeness of clustering results at little cost to homogeneity. Applying Complet+ to clusters obtained using MMseqs2’s clusterupdate achieves an increased V-measure of 0.09 and 0.05 at the SCOPe superfamily and family levels, respectively. Complet+ also creates more biologically representative clusters, as shown by a substantial increase in Adjusted Mutual Information (AMI) and Adjusted Rand Index (ARI) metrics when comparing predicted clusters to biological classifications. Complet+ similarly improves clustering metrics when applied to other methods, such as CD-HIT and linclust. Finally, we show that Complet+ runtime scales linearly with respect to the number of clusters being post-processed on a COG dataset of over 3 million sequences. Code and supplementary information is available on Github: https://github.com/EESI/Complet-Plus.",
                "authors": [
                    {
                        "name": "Nguyen R."
                    },
                    {
                        "name": "Polikar R."
                    },
                    {
                        "name": "Rosen G.L."
                    },
                    {
                        "name": "Sokhansanj B.A."
                    }
                ],
                "date": "2023-02-08T00:00:00Z",
                "journal": "PeerJ",
                "title": "Complet+: a computationally scalable method to improve completeness of large-scale protein sequence clustering"
            },
            "pmcid": "PMC9921987",
            "pmid": "36785708"
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Gene and protein families",
            "uri": "http://edamontology.org/topic_0623"
        },
        {
            "term": "Sequence analysis",
            "uri": "http://edamontology.org/topic_0080"
        },
        {
            "term": "Sequencing",
            "uri": "http://edamontology.org/topic_3168"
        },
        {
            "term": "Small molecules",
            "uri": "http://edamontology.org/topic_0154"
        }
    ]
}
