{
    "additionDate": "2023-02-25T13:30:51.907200Z",
    "biotoolsCURIE": "biotools:gocompare",
    "biotoolsID": "gocompare",
    "confidence_flag": "tool",
    "cost": "Free of charge",
    "credit": [
        {
            "name": "Chrystian C. Sosa"
        }
    ],
    "description": "An R package to compare functional enrichment analysis between two species.",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Gene-set enrichment analysis",
                    "uri": "http://edamontology.org/operation_2436"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ]
        }
    ],
    "homepage": "https://github.com/ccsosa/GOCompare",
    "language": [
        "R"
    ],
    "lastUpdate": "2024-11-24T14:58:10.678738Z",
    "license": "GPL-3.0",
    "name": "GOCompare",
    "operatingSystem": [
        "Linux",
        "Mac",
        "Windows"
    ],
    "owner": "Chan019",
    "publication": [
        {
            "doi": "10.1016/j.ygeno.2022.110528",
            "metadata": {
                "abstract": "Functional enrichment analysis is a cornerstone in bioinformatics as it makes possible to identify functional information by using a gene list as source. Different tools are available to compare gene ontology (GO) terms, based on a directed acyclic graph structure or content-based algorithms which are time-consuming and require a priori information of GO terms. Nevertheless, quantitative procedures to compare GO terms among gene lists and species are not available. Here we present a computational procedure, implemented in R, to infer functional information derived from comparative strategies. GOCompare provides a framework for functional comparative genomics starting from comparable lists from GO terms. The program uses functional enrichment analysis (FEA) results and implement graph theory to identify statistically relevant GO terms for both, GO categories and analyzed species. Thus, GOCompare allows finding new functional information complementing current FEA approaches and extending their use to a comparative perspective. To test our approach GO terms were obtained for a list of aluminum tolerance-associated genes in Oryza sativa subsp. japonica and their orthologues in Arabidopsis thaliana. GOCompare was able to detect functional similarities for reactive oxygen species and ion binding capabilities which are common in plants as molecular mechanisms to tolerate aluminum toxicity. Consequently, the R package exhibited a good performance when implemented in complex datasets, allowing to establish hypothesis that might explain a biological process from a functional perspective, and narrowing down the possible landscapes to design wet lab experiments.",
                "authors": [
                    {
                        "name": "Clavijo-Buritica D.C."
                    },
                    {
                        "name": "Diaz M.V."
                    },
                    {
                        "name": "Garcia-Merchan V.H."
                    },
                    {
                        "name": "Londono D.A."
                    },
                    {
                        "name": "Lopez-Rozo N."
                    },
                    {
                        "name": "Quimbaya M.A."
                    },
                    {
                        "name": "Riccio-Rengifo C."
                    },
                    {
                        "name": "Sosa C.C."
                    }
                ],
                "date": "2023-01-01T00:00:00Z",
                "journal": "Genomics",
                "title": "GOCompare: An R package to compare functional enrichment analysis between two species"
            },
            "pmid": "36462728"
        }
    ],
    "toolType": [
        "Library"
    ],
    "topic": [
        {
            "term": "Comparative genomics",
            "uri": "http://edamontology.org/topic_0797"
        },
        {
            "term": "Ontology and terminology",
            "uri": "http://edamontology.org/topic_0089"
        },
        {
            "term": "Plant biology",
            "uri": "http://edamontology.org/topic_0780"
        }
    ]
}
